-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-11-24 11:45:44
-- 伺服器版本： 10.4.18-MariaDB
-- PHP 版本： 8.0.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `testdb`
--

-- --------------------------------------------------------

--
-- 資料表結構 `admin`
--

CREATE TABLE `admin` (
  `ID` int(10) NOT NULL,
  `account` varchar(10) CHARACTER SET utf8 NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `admin`
--

INSERT INTO `admin` (`ID`, `account`, `password`) VALUES
(1, 'csumis', '9d848d4b8d1f0187b55b68be33b361f939319781a2d517d047a3421cf8329e5d');

-- --------------------------------------------------------

--
-- 資料表結構 `allrec`
--

CREATE TABLE `allrec` (
  `ID` int(50) NOT NULL,
  `name` varchar(200) NOT NULL,
  `ing` varchar(200) NOT NULL,
  `num` varchar(200) NOT NULL,
  `img` varchar(50) DEFAULT NULL,
  `link` varchar(50) DEFAULT NULL,
  `heartattack` int(32) DEFAULT 0,
  `pneumonia` int(32) DEFAULT 0,
  `diabetes` int(32) DEFAULT 0,
  `Lower_respiratory_tract` int(32) DEFAULT 0,
  `hypertension` int(32) DEFAULT 0,
  `Nephritis` int(32) DEFAULT 0,
  `Liver` int(32) DEFAULT 0,
  `total` int(20) DEFAULT 0 COMMENT '點擊量',
  `type` int(20) DEFAULT NULL,
  `step` varchar(3000) NOT NULL,
  `unit` varchar(500) NOT NULL COMMENT '食材單位'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `allrec`
--

INSERT INTO `allrec` (`ID`, `name`, `ing`, `num`, `img`, `link`, `heartattack`, `pneumonia`, `diabetes`, `Lower_respiratory_tract`, `hypertension`, `Nephritis`, `Liver`, `total`, `type`, `step`, `unit`) VALUES
(69, '家常義大利肉醬', '牛絞肉、豬絞肉、紅酒、番茄醬、紅椒粉、高湯、蒜頭、洋蔥、Mozzarella起司、巴西里葉', '250、200、、25、1、250、1、25、1', '69.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 0, 8, 1, '<hr><h1>1</h1><p>用橄欖油或奶油、已經切碎的蒜頭和洋蔥炒香</p> <hr><h1>2</h1><p>牛絞肉和豬絞肉用紅酒醃大概5分鐘、放入鍋內一起炒</p> <hr><h1>3</h1><p>肉大概8分熟的時候加入番茄醬</p> <hr><h1>4</h1><p>再加入高湯</p> <hr><h1>5</h1><p>再加入紅椒粉</p> <hr><h1>6</h1><p>加入起司</p> <hr><h1>7</h1><p>全部一起燉煮、肉熟了?起司融化了即可。最後可以加上巴西里葉或碎末增加香氣（可加可不加）</p> <hr>', 'g、g、、g、大匙、g、大匙、g、朵'),
(70, '義式香料紙包雞', '帶骨雞腿、洋蔥、紅蘿蔔、無鹽奶油、義大利綜合香料、黑胡椒粒、蒜泥、米酒、鹽巴', '3、0.5、0.5、、5、3、15、30、2', '70.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 0, 0, 8, 1, '<hr><h1>1</h1><p>紅蘿蔔及洋蔥切塊\\n醃料混合好備用</p> <hr><h1>2</h1><p>雞腿中間剁一刀分開\\n用竹籤戳一些洞方便醃漬</p> <hr><h1>3</h1><p>雞腿洋蔥紅蘿蔔跟醃料拌勻冷藏兩小時</p> <hr><h1>4</h1><p>取適當烘焙紙先放紅蘿蔔洋蔥\\n再擺入雞腿\\n切一塊薄片的奶油放上去</p> <hr><h1>5</h1><p>烘焙紙上下折疊</p> <hr><h1>6</h1><p>左右折疊後成一個正方形翻面烤</p> <hr><h1>7</h1><p>200度烤箱約烤三十分鐘</p> <hr><h1>8</h1><p>烤好後即可盛盤</p> <hr><h1>9</h1><p>香嫩紙包雞完成</p> <hr>', '支、顆、根、少許、g、g、g、g、茶匙'),
(71, '義大利雞肉丸子麵', '雞胸肉或雞里肌、大蒜、奧勒岡粉、新鮮巴西里、鹽、黑胡椒、麵包粉、帕瑪森乳酪粉、辣椒片、蛋、自製或市售義大利紅醬、白酒、牛奶、義大利麵、鹽', '1、4、2、2、2、1、170、100、、2、500、118、118、454、', '71.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 2, 1, '<hr><h1>1</h1><p>雞肉用調理機打成泥；大蒜剁碎；肉丸子其他料都加進攪拌盆裡</p> <hr><h1>2</h1><p>用手拌勻與搓揉到有黏性</p> <hr><h1>3</h1><p>起油鍋、小火煎到丸子上色</p> <hr><h1>4</h1><p>丸子撈起待用</p> <hr><h1>5</h1><p>熱鍋、加入白酒蒸發酒精、加入紅醬攪拌、再加入牛奶。同時另外燒水、照包裝上的指示煮麵、煮麵水需酌量加鹽</p> <hr><h1>6</h1><p>麵熟撈起、留1至2杯煮麵水。把麵到入醬汁中、如果醬汁稍乾酌量加入煮麵水、再加入肉丸子、可以撒上一些羅勒和黑胡椒、就完成了</p> <hr>', 'kg、瓣、小匙、大匙、小匙、小匙、g、g、隨意、顆、ml、ml、ml、g、適量'),
(72, '義式起司奶青醬燉飯', '雞肉、南瓜、花椰菜、鴻禧菇、白醬、起司、高湯、白飯、油、洋蔥、青醬', '500、0.5、0.5、1、1、酌量、3、4、2、辦克、2', '72.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>將花椰菜、洗淨（流水15分鐘）\\n南瓜去皮蒸7分熟。\\n雞肉切小塊\\n鴻禧菇和洋蔥洗淨</p> <hr><h1>2</h1><p>熱油鍋將洋蔥、雞肉下鍋炒至雞肉5分熟。加入高湯、白醬、南瓜白飯煮至熟、\\n湯汁稍微收乾\\n將花椰菜川燙放入燉飯中\\n盛盤撒上起司烤至金黃色\\n即可完成?！</p> <hr>', 'g、顆、朵、包、包、酌量、碗、碗、匙、辦克、包'),
(73, '經典義大利紅醬', '番茄罐頭、黃洋蔥、大蒜、紅蘿蔔、西芹、鹽、黑胡椒、乾奧勒岡、乾羅勒、月桂葉、二砂、奶油', '1600、1、2、1、1、1、1、0.5、0.5、2、1、2', '73.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 1, 1, '<hr><h1>1</h1><p>洋蔥、大蒜、紅蘿蔔與西芹剁碎或用料理機打碎</p> <hr><h1>2</h1><p>熱鍋後下2大匙橄欖油、炒香洋蔥碎和大蒜碎、炒至稍微軟化</p> <hr><h1>3</h1><p>紅蘿蔔碎與西芹碎加進去炒、加鹽與黑胡椒調味、再炒4-5分鐘稍微軟化</p> <hr><h1>4</h1><p>加入碎蕃茄罐頭與奧勒岡、乾羅勒、月桂葉、煮開後轉小火、蓋鍋悶煮1小時、或至蔬菜軟化。間中偶爾開鍋攪拌、確保不會黏鍋</p> <hr><h1>5</h1><p>1小時後開鍋蓋拿出月桂葉、加入二砂與奶油、再用攪拌棒把醬汁裡的蔬菜攪拌到泥狀</p> <hr><h1>6</h1><p>我通常會馬上取一些加工弄成義大利肉醬麵來吃、其他的冷凍起來、以後煮紅醬類的義大利麵或料理隨時拿出來退冰都很方便</p> <hr>', 'g、棵、瓣、條、條、小匙、小匙、大匙、大匙、片、大匙、大匙'),
(74, '茄汁肉醬義大利麵', '義大利麵、牛絞肉、橄欖油、鹽水、番茄醬、黑胡椒、牛番茄、九層塔、蒜頭', '60、70、10、5:1000、5、1/8、2、幾片、3', '74.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 1, 1, '<hr><h1>1</h1><p>準備食材如圖所示\\n\\n牛肉我買肉條自己剁碎、肥肉含量會比外面直接買的牛絞肉少許多、減少飽和脂肪的攝取、遠離血管堵住的風險！</p> <hr><h1>2</h1><p>-九層塔漂亮的留起來裝飾、其他切小片\\n-蒜頭切末\\n-番茄切丁\\n-牛肉剁碎</p> <hr><h1>3</h1><p>1000c.c.的水煮滾\\n>加入5g的鹽\\n>丟入麵條煮8分鐘\\n\\n看包裝的時間減去2-3分鐘就是煮麵的時間囉！</p> <hr><h1>4</h1><p>冷鍋倒入10g的烹調油\\n>加入蒜末\\n>炒到微金黃色\\n\\n蒜頭容易焦掉、要集中精神觀察它！</p> <hr><h1>5</h1><p>加入牛絞肉炒香</p> <hr><h1>6</h1><p>加入番茄及番茄醬</p> <hr><h1>7</h1><p>等到醬汁微稠時候加入剛剛煮的麵條</p> <hr><h1>8</h1><p>起過前加入九層塔及黑胡椒粒拌勻</p> <hr><h1>9</h1><p>開動！</p> <hr>', 'g、g(一掌心）、g、5:1000、g、t、顆、幾片、瓣'),
(75, '義式蕃茄冷麵【懶人料理便當盒版】', '義大利麵、橄欖油、鹽巴、牛番茄、小黃瓜、洋蔥、蒜頭、義大利香料 黑胡椒粒、檸檬、糖、Tabasco、鹽巴', '100、2、1、1、1、0.5、3、、0.5、0.5、1、1', '75.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 1, 2, 1, '<hr><h1>1</h1><p>混合調味醬汁糖、鹽巴、檸檬汁、tabasco混合攪拌均勻</p> <hr><h1>2</h1><p>製作配料洋蔥切碎、泡冰水去除辛辣味</p> <hr><h1>3</h1><p>製作配料再放入洋蔥、蒜末、小番茄丁</p> <hr><h1>4</h1><p>製作配料加入義大利香料</p> <hr><h1>5</h1><p>製作配料加入黑胡椒粒、攪拌均勻靜置備用。</p> <hr><h1>6</h1><p>義大利麵條煮熟後、泡冰水冰鎮、再加入2匙橄欖油攪拌均勻。</p> <hr><h1>7</h1><p>與「配料及醬汁」混合拌勻、即可上桌。</p> <hr>', 'g、匙、小匙、顆、條、顆、顆、適量、顆、小匙、小匙、小匙'),
(76, '清炒海鮮義大利麵', '蝦子、小捲、花枝、甜椒、美白菇、洋蔥絲、蒜頭、義大利麵、黑胡椒粒、胡椒粉、鹽巴、辣椒粉、乳酪絲', '10、1、0.5、1、0.5、3-5、1/3、、、、、', '76.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 1, 1, '<hr><h1>1</h1><p>備料：\\n先將菇類、甜椒和洋蔥備好切絲</p> <hr><h1>2</h1><p>海鮮可以先川燙過備好</p> <hr><h1>3</h1><p>義大利麵下水燙過、再翻炒</p> <hr><h1>4</h1><p>蒜頭切碎下鍋爆香、金黃後再下洋蔥炒至上色</p> <hr><h1>5</h1><p>加入海鮮翻炒、些微出水後加入義大利麵下鍋一同翻炒、炒熟後再加入調味料、調味後可適量加入些微乳酪絲～</p> <hr><h1>6</h1><p>完成啦～～～～～</p> <hr>', '隻、隻、顆、包、顆、顆、包、適量、適量、適量、適量、適量'),
(77, '懶人早餐-披薩餡', '起司、番茄醬、蛋、吐司、生菜、火腿、鮪魚罐頭', '個人喜好、個人喜好、1、1-1.5、個人喜好、1、2', '77.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>將蛋打散、然後加入吐司塊（手撕或切的都行）、確保每塊吐司都吸到蛋液。</p> <hr><h1>2</h1><p>1.擠上番茄醬加上起士。\\n2.鋪上自己想要的料（培根、鮪魚、生菜）。\\n3.再擠上番茄醬加上起士。</p> <hr><h1>3</h1><p>送進微波爐2分鐘就完成啦?超簡單懶人料理??</p> <hr>', '個人喜好、個人喜好、顆、片、個人喜好、片、匙'),
(78, '巴沙米克醋炒野菇', '鮮香菇、杏鮑菇、鴻禧菇、蒜頭、橄欖油、乾燥牛肝菌、巴沙米克醋、鹽、黑胡椒、奶油', '8、4、1、3-5、、10、1-1.5、、、10', '78.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>鴻禧菇去除蒂頭撥散。</p> <hr><h1>2</h1><p>鮮香菇傘部1/4切、蒂頭手撕成絲。（香菇若要用水清洗、則洗完後擦乾水分立即料理、或是用沾水的廚房紙巾擦拭）。</p> <hr><h1>3</h1><p>杏鮑菇頭部切下後掰成小塊狀、體部手撕成絲。（ 菇類若要用水清洗、則洗完後擦乾水分立即料理、或是用沾水的廚房紙巾擦拭）。??若有使用乾燥牛肝菌、請以少量的水泡開、與牛肝菌齊平的水量即可</p> <hr><h1>4</h1><p>鍋中下橄欖油、油熱後將所有菇類下鍋與橄欖油拌勻後便不需時常拌炒、大約每30秒翻炒幾下即可。</p> <hr><h1>5</h1><p>大約2分鐘後菇類體積已減少1/3（如圖）、此時水份已開始大量釋出、一樣維持20-30秒拌炒一次即可。</p> <hr><h1>6</h1><p>大約4-5分鐘後部份菇類呈現金黃（如圖）即可進行下一步驟。（若有使用乾燥牛肝菌、請在此時加入並再炒1分鐘待水收乾）??過程中均以中火或中大火炒。</p> <hr><h1>7</h1><p>菇類呈金黃色後加入蒜末、鹽、黑胡椒拌炒均勻後加入奶油及巴沙米克醋翻炒至奶油融化即完成?</p> <hr><h1>8</h1><p>蒜頭用量則依個人喜好調整、奶油建議不超過10g、避免蓋鍋巴沙米克醋的味道。巴沙米克醋各廠牌的甜酸度、濃稠度都有所差異、份量可依據自己喜愛的味道調整。</p> <hr><h1>9</h1><p>若要做成吐司可撒上起司粉、並放上半熟蛋或水波蛋、蛋黃液裹上野菇後、口味變得濃郁且品嚐得到淡淡甜味。</p> <hr>', '朵、根1包、粒、適量、g、大匙、適量、適量、g'),
(79, '提拉米蘇蛋糕', '馬斯卡彭乳酪、動物性鮮奶油、蛋黃、砂糖、吉利丁片、濃縮咖啡、咖啡酒、可可粉', '250、250、3、50、11、1、(可有可無)、(裝飾用)', '79.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 1, '<hr><h1>1</h1><p>鮮奶油打發至有紋路冷藏備用</p> <hr><h1>2</h1><p>鮮奶油打發至有紋路冷藏備用</p> <hr><h1>3</h1><p>打軟馬斯卡彭乳酪</p> <hr><h1>4</h1><p>吉利丁片泡冰水軟化</p> <hr><h1>5</h1><p>馬斯卡彭乳酪+糖隔水加熱融化後 加入蛋黃快速拌勻</p> <hr><h1>6</h1><p>加入吉利丁拌勻至吉利丁完全溶解</p> <hr><h1>7</h1><p>1/3的打發鮮奶油先加進去拌勻 再加入剩下的鮮奶油拌勻</p> <hr><h1>8</h1><p>1/3的打發鮮奶油先加進去拌勻 再加入剩下的鮮奶油拌勻</p> <hr><h1>9</h1><p>加入一點濃縮咖啡、咖啡酒後攪拌均勻 兩者合計大約50ml 完成麵糊～</p> <hr><h1>10</h1><p>入模冷藏一晚</p> <hr><h1>11</h1><p>脫模後撒上可可粉裝飾就完成了??</p> <hr>', 'g、g、顆、g、g、小杯、少許(可有可無)、適量(裝飾用)'),
(80, '義式涼拌南瓜', '南瓜、蒜末、紅辣椒末、糯米醋、紅葡萄酒、烹大師或鹽巴、冰糖、義大利香料、迷迭香料、白芝麻', '１、１０、２、２、２、、２、、、', '80.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>南瓜洗淨、削皮後、以１切４後、再切成極薄片、放入一深碗中、用鹽巴抓醃１０分鐘、抓乾水份備用！</p> <hr><h1>2</h1><p>取一個密封塑膠袋、將南瓜片與醃料醬放入！</p> <hr><h1>3</h1><p>確實將密封袋封好後、隔著袋子稍微搓揉、搖晃、讓南瓜能均勻浸泡醬料！</p> <hr><h1>4</h1><p>放入冰箱冷藏３０分鐘以上、讓南瓜能入味！（最好是醃置１天更棒喔！）</p> <hr><h1>5</h1><p>要吃時、撒上少許蔥花、檸檬屑便可擺盤、上菜囉！</p> <hr>', '顆、瓣、條、大匙、大匙、適量、大匙、適量、適量、適量'),
(81, '義式烤蕃茄', '牛蕃茄、橄欖油、義式香料、黑胡椒、鹽、巴薩米克醋、義式乾酪粉', '3、1、1、1、1、3、3', '81.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>將牛蕃茄洗乾淨後切成片狀、薄厚完全依照自己喜歡的口感。</p> <hr><h1>2</h1><p>將切成片狀的蕃茄平鋪於烤盤上、並將每一片都均勻抹上一層橄欖油、然後撒上義式香料以及黑胡椒和鹽巴。隨後放入烤箱以200度烤約20分鐘即可。（烤箱溫度依自家的去拿捏、每台不盡相同）</p> <hr><h1>3</h1><p>烤箱取出後淋上巴薩米克醋以及乾酪粉提味即可上桌囉！</p> <hr>', '顆、大匙、大匙、小匙、小匙、大匙、大匙'),
(82, '香蒜巴西里義大利麵-忠於原味的簡單經典！', '義大利麵、橄欖油、新鮮巴西里葉、大蒜、鹽巴、黑胡椒', '200、覆蓋滿整個平底鍋的量、30、8、、比平常調味再多1些', '82.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>巴西里洗淨切碎、蒜頭剝皮洗淨切片 (盡量切成厚薄度一致、等等煸的時候比較容易可以同時起鍋喔)\\n(備料時可以一邊在爐上煮好一鍋滾水)</p> <hr><h1>2</h1><p>在滾水中加入一些鹽巴、將義大利麵放進去煮到9分熟~\\n(放義大利麵時可以用撒開呈現扇形的方法、然後讓底部的麵條稍微煮軟之後自然彎曲、再把上方的麵稍微攪拌慢慢沉入鍋中、不要折斷喔)</p> <hr><h1>3</h1><p>煮麵的同時、拿出一個平底鍋、再另一爐上開中小火、將大量的橄欖油倒入鍋中、就可以立刻將蒜片都放進去、記得要從冷油的時候就開始煸蒜片喔\\n煸蒜片的過程、記得全程都要用中小火喔、煸出來的蒜片才比較不會苦\\n這個步驟的要領就是耐心、讓它慢慢煸、直到看見蒜片變成金黃色時就可以取出來了~ 不要過度加熱、不然會燒焦喔</p> <hr><h1>4</h1><p>把煸好的蒜片拿起來放在一旁備用</p> <hr><h1>5</h1><p>麵這時候應該差不多煮好了、把它撈出來放進平底鍋裡、並加一些些煮麵水進來~ (做這些動作前可以先將平底鍋拿離開火爐、因為我們鍋裡的橄欖油很多、讓鍋子稍微降一點溫度、這樣比較不會噴濺、比較安全)\\n接著再撒上比平時稍微多一些的黑胡椒來調味、試吃一下、如果味道不夠的話就再加一點點的鹽巴</p> <hr><h1>6</h1><p>最後把巴西里末放進來稍微拌勻就可以盛盤囉~\\n(巴西里放進來之後不用炒太久喔、不然香草的味道會變少)</p> <hr><h1>7</h1><p>先把麵裝好、上面撒一些起司粉、再擺上一片巴西里葉做裝飾(那時我們家裡只有起司條、所以就用它來代替起司粉、覺得用起來的效果也很不錯喔、給大家參考)\\n接著在盤子周圍鋪上之前煸好的蒜片就大功告成啦！</p> <hr>', 'g、覆蓋滿整個平底鍋的量、g、瓣、適量、比平常調味再多一些'),
(83, '義式燉飯', '豌豆、蠶豆、洋蔥、培根、米、奶油、白葡萄酒、蔬菜高湯、Parmesan 起司、荷蘭芹、butter', '、0.5、60、150、20、50、800、40、、10', '83.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>豌豆去莢後、將豌豆莢放入蔬菜高湯?、用小火煮5分鐘之後、過濾。</p> <hr><h1>2</h1><p>將鹽撒在豌豆上、混合比率為（豌豆1杯（約130g））、鹽 1小湯匙（5g）</p> <hr><h1>3</h1><p>鍋?加入1公升水加熱燒開後、將?的豌豆放入、煮2分鐘、關火冷置（立刻從熱水中取出的話、皮易皺）</p> <hr><h1>4</h1><p>蠶豆 -- 在1公升水中加入1大匙食鹽、把蠶豆的豆莢剝去取出豆粒、在豆身黑色部分的反側用刀切開一道2公分左右的開口。</p> <hr><h1>5</h1><p>把其加入熱水中煮約3分鐘</p> <hr><h1>6</h1><p>剝除表面的薄皮 （有切口較易取出 豆粒、食鹽容易入味）</p> <hr><h1>7</h1><p>鍋?加butter</p> <hr><h1>8</h1><p>20g將培根炒熱、待出油後、炒洋?</p> <hr><h1>9</h1><p>洋?炒軟之後、炒生米（未洗）</p> <hr><h1>10</h1><p>加入白葡萄酒後、將尚熱的?加?、 用中火煮。在將米完全浸泡於高湯?的狀態下陸續添加?的高湯以小火煮15分鐘。\\n（在15分鐘?把蔬菜高湯全部加入）</p> <hr><h1>11</h1><p>加入豌豆、蠶豆、</p> <hr><h1>12</h1><p>荷蘭芹、butter、起士粉之後、撒上鹽、胡椒即可。</p> <hr>', '適量、個、g、g、g、cc、cc、g、適量、g'),
(84, '千層麵連義大利人都說好吃', '千層麵、莫札瑞拉起士絲、帕瑪森起士粉、橄欖油、無鹽奶油、低筋麵粉、牛奶、牛絞肉、洋蔥、蒜頭、番茄肉醬罐頭、番茄切塊罐頭、番茄糊、水、黑胡椒、鹽', '12、600、100、、80、80、500、300、1、5、1、1、1、150、、', '84.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>白醬製作\\n-開中小火放入奶油融化\\n-分次加入低筋麵粉慢慢拌勻\\n-分次慢慢加入牛奶\\n（一開始會像麵團、但慢慢加牛奶後會變稀）\\n-剩下1/3牛奶時、轉中大火\\n-繼續分次加入牛奶攪拌均勻至上圖有紋路的濃稠狀即可關火\\n\\n**這個過程一定要耐心攪拌喔！如果太大火煮會把麵粉煮熟成團、就煮不出糊狀了</p> <hr><h1>2</h1><p>將洋蔥及蒜頭切碎</p> <hr><h1>3</h1><p>紅醬製作\\n-大火熱過\\n-倒入橄欖油\\n-加入洋蔥炒至上色\\n-加入牛絞肉炒至上色\\n-加入蒜頭碎炒出香氣\\n-倒入番茄肉醬、番茄切塊及番茄糊三種罐頭拌勻\\n-加入水煮滾\\n-加入鹽及黑胡椒調味即可</p> <hr><h1>4</h1><p>燙千層麵\\n-起一鍋熱水\\n-加入適量的鹽和橄欖油煮滾\\n-放入千層麵\\n（一次最多3片、不然容易黏在一起）\\n-煮軟即可取出\\n（不要煮到完全爛、烤的過程中還會繼續熟化。這步驟煮太軟、烤出來口感會太爛。）\\n\\n**煮麵同時將白醬倒入紅醬拌勻\\n**烤箱開上下火200度預熱</p> <hr><h1>5</h1><p>在玻璃鋪上一層醬料</p> <hr><h1>6</h1><p>-放上千層麵\\n-再鋪上一層醬料、均勻塗抹\\n-均勻灑上莫札瑞拉起士絲及帕瑪森起士粉\\n-重複3次以上的步驟\\n\\n**最後一層要鋪上滿滿的見不到底起士、烤起來才會漂亮、好吃</p> <hr><h1>7</h1><p>-先鋪上一層烘焙紙\\n（避免起士黏在鋁箔紙上）\\n-再鋪一層鋁箔紙\\n-放入烤箱烤20分鐘</p> <hr><h1>8</h1><p>-取出烘焙紙及鋁箔紙\\n-繼續烤25-30分鐘至上色即可</p> <hr>', '片、g、g、適量、g、g、ml、g、顆、瓣、瓶、瓶、小瓶、ml、適量、適量'),
(85, '氣炸雞腿排', '雞腿排、蒜頭、甜椒、小番茄、橄欖油、義式香料、鹽巴、黑胡椒', '600、4、3、18、1、、、', '85.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>將雞腿排以黑胡椒、鹽巴、橄欖油醃漬10分鐘</p> <hr><h1>2</h1><p>將食材洗淨、小番茄對半切、甜椒切成塊狀</p> <hr><h1>3</h1><p>依序將小番茄、甜椒、蒜頭、雞腿排(皮面朝下)鋪上烘烤鍋中</p> <hr><h1>4</h1><p>烘烤鍋放入氣炸鍋中、溫度設定180度、時間設定30分鐘(不用預熱、時間20分鐘時、將雞腿排翻面)、30分鐘後再以200度烘烤3分鐘、雞皮才會酥脆唷</p> <hr><h1>5</h1><p>盛盤享用囉、可將雞油淋上雞腿排與蔬菜、也可以拿來拌飯喔</p> <hr>', '克、瓣、顆、顆、大匙、適量、適量、適量'),
(86, '肉醬千層麵', '豬絞肉、洋蔥、番茄、蒜頭、紅蘿蔔、高湯、麵片、起司絲、橄欖油、番茄醬、月桂葉、百里香、義大利綜合香料、鹽、糖、胡椒', '400、0.5、1、4、1/3、1、6、、、60、2、1、1、、、', '86.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 0, 0, 1, '<hr><h1>1</h1><p>炒香洋蔥末和蒜末、加入豬絞肉炒熟</p> <hr><h1>2</h1><p>加入紅蘿蔔末和番茄丁</p> <hr><h1>3</h1><p>加入調味料拌勻、煮10分鐘</p> <hr><h1>4</h1><p>千層麵格10秒放入加鹽的滾水裡煮7分鐘</p> <hr><h1>5</h1><p>將千層麵取出並抹上油</p> <hr><h1>6</h1><p>裝千層麵的容器裡一層肉醬一層千層麵放最上面是肉醬、最後在鋪上一層的起司絲。</p> <hr><h1>7</h1><p>上火200/0℃烤10-15分鐘即可</p> <hr>', 'g、顆、顆、顆、條、罐、片、適量、適量、g、片、T、T、適量、適量、適量'),
(87, '自製免發酵薄片披薩', '奶油、糖、鹽、中筋麵粉、冰水、喜歡的蔬菜、番茄醬、蝦仁、甜羅勒', '10、1.5、2、250、140、切小塊裝、、8、、6-7', '87.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 1, 1, '<hr><h1>1</h1><p>先將麵粉、奶油放入攪拌機 打到粉狀、在慢慢加入冰水140ml、橄欖油些許、打倒成團、沒有攪拌機 用手揉也不難的！</p> <hr><h1>2</h1><p>在隨意鋪平、沒有麵桿、就隨意用手或玻璃瓶桿平、烤箱預熱200度、餅皮先送入烤箱200烤10 分鐘（烤薄片所以速度很快）</p> <hr><h1>3</h1><p>先在餅皮上抹上一層番茄醬、\\n準備喜歡的食材(海鮮、蔬菜)切小塊狀先燙或煎半熟、口味甜或鹹都不錯、鋪上餅皮加上起司 送入在烤5-10分鐘左右、烤至起司微焦</p> <hr><h1>4</h1><p>因為很薄片、可以用 食物剪刀剪食會比較方便呦！喜歡Tabasco 的可以灑上一些??</p> <hr>', '克、克、g、g、cc、切小塊裝、適量、尾、適量、葉'),
(88, '義式檸檬香雞排CHICKENPICCA', '雞胸、奶油、橄欖油、白酒、檸檬汁、大蒜、紅蔥頭、酸豆、麵粉、義大利香料、鹽、胡椒、義大利香芹', '480、40、1、250、2、1、2、30、3、、、1些', '88.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>雞胸先橫剖成兩片、讓肉片變薄。</p> <hr><h1>2</h1><p>雞胸肉蓋上保鮮膜、用肉槌敲擊讓雞肉鬆軟變大。</p> <hr><h1>3</h1><p>兩面以鹽與黑胡椒調味。</p> <hr><h1>4</h1><p>麵粉加入乾燥香料、將雞片兩面沾上薄薄一層麵粉。</p> <hr><h1>5</h1><p>大平底鍋、中火加熱、放入20g奶油和1大匙橄欖油、燒熱後、放入雞胸肉烹煮到兩面都變得金黃色、取出備用</p> <hr><h1>6</h1><p>在同一鍋子中放入白酒250cc、維持中火繼續烹煮直到白酒蒸發至僅剩下一半。</p> <hr><h1>7</h1><p>再加入檸檬汁、大蒜末、紅蔥頭碎後繼續烹煮約一分鐘。</p> <hr><h1>8</h1><p>加入酸豆和奶油20g。</p> <hr><h1>9</h1><p>奶油融解後、將雞排重新放回鍋中繼續烹煮1-2分鐘。</p> <hr><h1>10</h1><p>以鹽和胡椒調味、加入義大利香芹、拌一下就可起鍋。</p> <hr><h1>11</h1><p>雞肉軟嫩入味、酸味很夠、配飯正好。不喜歡太酸的可以將檸檬和酸豆減量。</p> <hr>', 'g、g、大匙、cc、大匙、瓣、瓣、顆、大匙、適量、適量、一些'),
(89, '橄欖油漬番茄', '牛番茄（大顆）、蒜片、義式香料、鹽、橄欖油', '1、1、0.5、、約150', '89.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>將牛番茄切小塊放在陽光下曬一天、讓表面水份流失?\\n或直接用烤箱烘烤100分鐘左右、讓表面水份流失?</p> <hr><h1>2</h1><p>蒜頭切片擺在風乾的蕃茄上、撒上少許鹽?</p> <hr><h1>3</h1><p>放進烤箱烤15分鐘?\\n（我用的是沒用溫控的小烤箱。）</p> <hr><h1>4</h1><p>烤好後放涼?</p> <hr><h1>5</h1><p>放進乾淨的玻璃瓶裡?</p> <hr><h1>6</h1><p>加入一小匙義式香料?</p> <hr><h1>7</h1><p>加入橄欖油淹過蕃茄?</p> <hr><h1>8</h1><p>靜置半天以上就可食用??</p> <hr><h1>9</h1><p>橄欖油漬番茄搭配烤的酥脆的法國麵包或吐司、或加在義大利麵都很美味哦??</p> <hr>', '顆、瓣、小匙、少許、ml'),
(90, '義式番茄肉醬烤櫛瓜', '黃櫛瓜、綠櫛瓜、茄子、義式肉醬、黑胡椒粉、鹽、莫札瑞拉起司、洋香菜粉', '1、1、1', '90.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>材料:\\n黃櫛瓜:一條\\n綠櫛瓜:一條\\n茄子:一條\\n義式肉醬:適量\\n黑胡椒粉:適量\\n鹽:適量\\n莫札瑞拉起司絲:適量\\n洋香菜粉:適量\\n1.烤箱180度預熱、將櫛瓜跟茄子切片、切好後依序疊於盤中撲滿。\\n2.在中央鋪上適量肉醬、沒有撲到肉醬的部分灑上適量鹽跟黑胡椒粉、入烤箱烤10分鐘。</p> <hr><h1>2</h1><p>3.取出鋪上莫札瑞拉起司入箱烤、起司融成一片就行了、約5分左右。</p> <hr><h1>3</h1><p>4.在起司上面灑些洋香菜粉即可。</p> <hr><h1>4</h1><p>小叮嚀:\\n1.沒有鋪到肉醬的部分也可不灑鹽黑胡椒調味、因為跟肉醬一起烤會有湯汁浸濡、可以沾著湯汁或夾著肉醬一起吃就夠味了。\\n2.肉醬可以買現成的也可自製、肉醬作法https://reurl.cc/qdYgYg</p> <hr>', '條、條、條、適量、適量、適量'),
(91, '義式蔬菜筆管麵', '大筆管麵、海鹽、橄欖油、帕馬森起司、莫札瑞拉起司、小黃瓜、黃櫛瓜、綠櫛瓜、紅甜椒、番茄、茄子、番茄糊、高湯、大蒜、洋蔥、橄欖油、百里香、迷迭香、羅勒葉、海鹽、黑胡椒', '200、、、10、3、2、1、1、1、1、80、150、100、3、0.5、2、8、10、、1、1', '91.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>大筆管麵放入滾水中、 加入少許鹽、橄欖油煮熟、 取出後沖冷水瀝乾備用.</p> <hr><h1>2</h1><p>所有蔬菜切丁備用. (大蒜&洋蔥切末)</p> <hr><h1>3</h1><p>取一鍋放橄欖油、 先將蒜末與洋蔥末炒至金黃色、 再依序放入所有蔬菜丁、百里香、迷迭香稍微拌炒.\\n接著、 加入番茄糊、與高湯、 並海鹽、黑胡椒與羅勒葉調味、 小火煮15分鐘後熄火. \\n熄火後拌入帕馬森起司.</p> <hr><h1>4</h1><p>將醬料塞進筆管麵中、 並排鋪在焗烤盤內、 在放上帕馬森起司&莫札瑞拉起司、 放入烤箱180度C烤10分鐘、 即可出爐享用.</p> <hr>', 'g、少許、少許、g、片、根、根、根、顆、顆、g、g、g、瓣、顆、匙、g、g、少許、小匙、小匙'),
(92, '咖啡義式堅果脆餅', '杏仁粉、砂糖、無鹽奶油、巧克力豆、泡打粉、全蛋、咖啡粉、糖粉、堅果', '115、40、15、15、1、1、3、10、25 ', '92.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 1, 1, 0, 1, '<hr><h1>1</h1><p>所有食材拌勻</p> <hr><h1>2</h1><p>整成橢圓型放入烤箱180度 25-30分鐘</p> <hr><h1>3</h1><p>取出後靜置30分鐘放涼</p> <hr><h1>4</h1><p>切成1-1.5公分的片狀</p> <hr><h1>5</h1><p>放入烤箱120度繼續烤20分鐘</p> <hr><h1>6</h1><p>翻面繼續烤15-20分鐘</p> <hr><h1>7</h1><p>放涼降溫後就是義式咖啡堅果脆餅??????</p> <hr>', '克、克、克、克、克、顆、克、克、克'),
(93, '義式香料烤馬鈴薯', 'Baby馬鈴薯（全聯）、史雲生雞高湯、冷壓橄欖油、奶油、蒜頭、黑胡椒、義式香料', '1、250、2、10、6、、', '93.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>Baby馬鈴薯洗淨後不需去皮、直接對切即可。</p> <hr><h1>2</h1><p>使用可直接進烤箱的鍋具、鍋中加入橄欖油、奶油、並將馬鈴薯煎至兩面金黃。</p> <hr><h1>3</h1><p>烤箱以210°C預熱、預熱過程中加入高湯、黑胡椒、義式綜合香料（或任何自己喜愛的乾燥香草）、蒜頭熬煮、並不時將湯汁澆淋在馬鈴薯上。</p> <hr><h1>4</h1><p>烤箱預熱好後將馬鈴薯送入烤箱烘烤18-20分鐘即可。</p> <hr>', '袋、ml、大匙、g、粒、少許、適量'),
(94, '希臘香料燉雞', '土雞、麵粉、冷壓橄欖油、九層塔或新鮮羅勒、蒜頭、洋蔥、小番茄、鴻禧菇、史雲生雞高湯、白酒、黑胡椒、摩洛哥檸檬或黃檸檬片、鹽', '0.5、、3、30、15、1、約200、20、1、250、100、、2-3、', '94.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>雞肉可先請肉販切塊、清洗後以紙巾擦乾水分兩面灑上少許海鹽及黑胡椒、靜置於冰箱約20分鐘。</p> <hr><h1>2</h1><p>小番茄對切、菇類去除蒂頭、洋蔥切丁、蒜頭拍裂。</p> <hr><h1>3</h1><p>雞肉拍上薄粉備用。</p> <hr><h1>4</h1><p>鍋中倒入橄欖油、將雞肉煎至兩面金黃後先取出。</p> <hr><h1>5</h1><p>同鍋用餘油先將洋蔥炒至略透明、再下蒜頭炒出香氣、最後放入鴻禧菇將之炒軟。</p> <hr><h1>6</h1><p>鍋中放入小番茄、九層塔（或新鮮羅勒）、摩洛哥檸檬2片（或新鮮黃檸檬片）、乾燥百里香2/3小匙、雞湯250ml、白葡萄酒150ml一同熬煮。\\n湯汁煮滾後加蓋轉小火燉煮25分鐘。25分鐘後開蓋持續燉煮至湯汁濃稠、並以黑胡椒調味即可。\\n??若使用新鮮檸檬片則需試味道後以鹽調味。</p> <hr><h1>7</h1><p>??摩洛哥檸檬食材：10顆黃檸檬、海鹽120g、黑胡椒原粒（未研磨）適量、月桂葉3片。作法：檸檬6顆切片（約0.3-0.4厚度、勿太薄）4顆擠汁、取一個消毒烘乾的容器（玻璃尤佳）、將一層檸檬片一層海鹽交錯堆疊、最後放入黑胡椒原粒、月桂葉、檸檬汁、至於冰箱一個月後可使用。</p> <hr>', '隻、適量、大匙、片、粒、顆、g、粒、包、ml、ml、適量、片、少許'),
(95, '義式甜菜根燉飯', '泰國香米、甜菜根、紅蔥頭碎、白葡萄酒、昆布柴魚高湯、鹽、胡椒粉、起司', '40、40、2、2、、、、10', '95.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 0, 0, 1, 1, '<hr><h1>1</h1><p>甜菜根洗淨削皮切片備用.</p> <hr><h1>2</h1><p>取不沾鍋、倒入白葡萄酒與紅蔥頭碎煮滾出香氣、續放入泰國香米拌勻.大米可洗可不要洗.</p> <hr><h1>3</h1><p>倒入90cc昆布柴魚高湯、加蓋煮至收汁.再攪拌倒入30cc昆布柴魚高湯、加蓋煮、反覆這步驟.</p> <hr><h1>4</h1><p>香米夠受、放入鹽、胡椒粉及起司攪拌、起司溶化即可.</p> <hr>', 'g、g、顆、小匙、適量、少許、少許、g'),
(96, '義式馬卡龍ItalianMacaron', '杏仁粉、糖粉、蛋白、食物色素膠、蛋白、糖、水、糖', '100、90、35、1點、42、23、27、60', '96.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 1, '<hr><h1>1</h1><p>所需材料量好</p> <hr><h1>2</h1><p>首先將材料1的杏仁粉跟糖粉混合。\\n\\n將你要的食物色膠倒入材料1的蛋白裡。</p> <hr><h1>3</h1><p>將加入色素的蛋白倒進麵粉裡攪拌均勻。</p> <hr><h1>4</h1><p>攪拌均勻後放一邊。\\n\\n開始把糖跟水煮沸到116度（用小火）、跟打蛋白霜。</p> <hr><h1>5</h1><p>煮到116度後把糖漿加入打好的蛋白霜（soft peak軟性發泡）、一邊用攪拌機攪拌到硬性發泡stiff peak。\\n\\n之後再把蛋白霜加入剛的麵粉裡、用扮刀扮均勻直到麵糊流動不會斷。</p> <hr><h1>6</h1><p>之後在倒入擠花袋、用0.6 or 0.8公分的圓嘴、擠在馬卡龍的烤壂。</p> <hr><h1>7</h1><p>烤箱設定140度。\\n\\n第一次先將烤箱底下放入一個烤盤、讓他先乾燥6-7分鐘。\\n\\n之後將底下烤盤拿出來後再繼續烤14-15分鐘</p> <hr>', 'g、g、g、點、g、g、g、g'),
(97, 'Gnocchi', '薯仔、中筋麵粉', '1、50', '97.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>1a)準備一煲滾水、薯仔去皮、切片或粒後放入煲內蓋上蓋、開大火煮至薯仔淋身、瀝乾水備用 b) 薯仔放入盤內用叉壓成蓉、(無須用攪拌機打、因為薯仔會打至更吸力、很難從Hand Blender取出)</p> <hr><h1>2</h1><p>薯蓉冷卻後、加入其他材料搓成麵團、 (可因應薯仔濕度加麵粉至不黏手即可)、取出一部份搓成條狀、用刀切成1厘米大 意大利人會用一塊坑紋板去做出紋路、亦可用叉壓出花紋</p> <hr><h1>3</h1><p>煲一熱水、水滾後放入Gnocchi、用叉攪一圈以防黏底、浮起後1分鐘試試是否自己想要的口感、滿意的話可瀝去水份、加入已預熱的醬汁即可享用。</p> <hr>', '個、克'),
(98, '義式水煮魚', '鱸魚魚片、牛番茄、小黃瓜、芹菜、蒜頭、蛤蜊、米酒、鹽、黑胡椒、迷迭香', '7、2、0.5、1-2、4、10、1、、、', '98.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>先把所有蔬菜切成丁 (番茄、小黃瓜、芹菜）、 蒜頭切成末</p> <hr><h1>2</h1><p>冷油下蒜頭、把蒜頭炒香、下魚片（魚片要先用紙巾擦乾避免噴油）</p> <hr><h1>3</h1><p>魚片稍微熟了之後、把魚片暫時移到盤子上、把蔬菜丟入鍋中炒到番茄稍微糊化之後將魚片放回鍋中。</p> <hr><h1>4</h1><p>加一米杯的白酒（我用米酒代替）、再加水剛好淹過食材(或少一點點水）。撒入一點迷迭香、加蓋煮15分鐘。</p> <hr><h1>5</h1><p>放入蛤蜊、 在煮至蛤蜊熟透。\\n起鍋前加入適量鹽巴 和黑胡椒即完成。</p> <hr>', '片、顆、根、根、瓣、顆、米杯、適量、適量、適量'),
(99, '義式佛卡夏麵包', '高筋麵粉、細砂糖、冰水、橄欖油、速發酵母、青花椰菜、小蕃茄、迷迭香、橄欖油、黑胡椒粉、海鹽、', '280、15、190、30、3、、、、50、、', '99.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>??將高筋麵粉、細砂糖、速發酵母、橄欖油先放入攪拌盆裡、開中速攪拌2分鐘後、分3-4次慢慢加入冰水（牛奶??）。\\n??當牛奶被麵粉吸收後（約5分鐘後）、轉高速攪拌至麵糰可拉出半透手套膜即可。\\n??用保鮮膜覆蓋麵糰進行發酵約1小時（溫度在28度為限）至麵糰膨脹為2倍大。</p> <hr><h1>2</h1><p>??發酵後的麵糰先用指節輕輕槌打排氣、並桿出厚度約1.5cm厚大圓餅。\\n??此配方揉出發酵後麵糰約為500-510g之間、分為四等份後滾圓（收口在下）、再蓋上保鮮膜讓麵糰喘口氣10分鐘。</p> <hr><h1>3</h1><p>將四等份小麵糰桿成厚度約1cm長?圓形、並且拿筷子??頭隨意地在麵皮上戳洞。</p> <hr><h1>4</h1><p>??餡料我是趁麵糰發酵時間、先做均勻攪拌（也是一種涼拌菜喔）。\\n??隨意地在戳好的洞裡插入餡料（要戳夠深喔）\\n??接著將泡餡料剩的香料橄欖油均勻刷在麵皮及餡料上～</p> <hr><h1>5</h1><p>送入已200度預熱好的烤箱中、上下火都190度烘烤20分鐘（視不同機種烤箱要微調烤溫及時間喔～）\\n\\n看到麵包表層上色而且餡料呈現一些乾化現象就可以出爐啦！</p> <hr>', 'g、g、ml、ml、g、適量、適量、少許、ml、少許、少許'),
(100, '義式蔬菜湯', '洋蔥、西芹、紅蘿蔔、甜椒、培根、高湯、小番茄、節瓜、鹽、白胡椒', '0.5、3、1、2、2、1000、100、1、、', '100.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>冷鍋開小火加入少許奶油融化、加入節瓜丁、西芹丁、甜椒丁炒香（不用炒軟）</p> <hr><h1>2</h1><p>蔬菜炒香後倒入湯鍋備用</p> <hr><h1>3</h1><p>用奶油將培根炒香後、加入紅蘿蔔炒香後、再加入洋蔥絲。</p> <hr><h1>4</h1><p>將所有炒香的蔬菜倒入湯鍋</p> <hr><h1>5</h1><p>加入高湯熬煮、過程中將雜質撈出、熬至蔬菜軟化。</p> <hr><h1>6</h1><p>起鍋前加入鹽巴、白胡椒調味後、再加入番茄丁煮一下。</p> <hr><h1>7</h1><p>即可盛碗</p> <hr>', '顆（60克）、根（60克）、條（60克）、顆（60克）、片、 c.c、克、條（60克）、適量、適量'),
(101, '義式香料野菇燉飯+橄欖油櫛瓜', '白米、鴻禧菇、小白菇、洋菇、碗豆、洋蔥、櫛瓜、起司絲、橄欖油、奶油、雞高湯、料理用鮮奶油、黑胡椒粉、海鹽', '1.5、0.25、0.25、7、、0.25、0.5、、、20、2、200、、', '101.png', 'https://icook.tw/recipes/', 0, 1, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>這是食材</p> <hr><h1>2</h1><p>碗豆洗淨去蒂頭剝絲備用、洋蔥切成丁狀備用、洋菇切片、鴻禧菇小白菇切丁備用</p> <hr><h1>3</h1><p>鑄釜鍋開中火預熱2分鐘加入奶油再下洋蔥丁炒至透明狀、轉小火續下菇類拌炒均勻</p> <hr><h1>4</h1><p>再加入白米與菇類拌炒均勻、接著下碗豆攪拌後再加入雞高湯、鮮奶油100ml開大火煮滾後</p> <hr><h1>5</h1><p>將櫛瓜切片放入蒸蓋上下鍋與燉飯一起小火烹煮10分鐘後、熄火燜10分鐘、開蓋櫛瓜淋上橄欖油適量與黑胡椒粉、海鹽即可</p> <hr><h1>6</h1><p>燉飯加入剩下的100ml鮮奶油、起司絲攪拌均勻即可完成</p> <hr><h1>7</h1><p>完成</p> <hr>', '杯、顆、顆、顆、適量、顆、節、適量、適量、g、杯、ml、適量、適量'),
(102, '義式蕃茄燉飯', '牛蕃茄、杏苞菇、玉米筍、洋蔥、豬肉、米、水、鹽、黑胡椒、義式綜合香料、奶油、橄欖油', '1、1、4、3/1、些許、1、1.2、1、酌量、酌量、1、酌量', '102.png', 'https://icook.tw/recipes/', 0, 1, 1, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>米先洗好備用</p> <hr><h1>2</h1><p>起鍋下少許橄欖油、豬肉下鍋炒至變白、（不一定要全熟）。盛起備用。</p> <hr><h1>3</h1><p>原鍋加入半湯匙橄欖油及一小塊奶油、奶油溶化後、下洋蔥、杏苞菇、玉米筍一起炒、炒至洋蔥半透明即可。</p> <hr><h1>4</h1><p>將步驟2、3炒好的食材放入米鍋中、加入蕃茄泥、鹽、黑胡椒、義式香料。\\n\\n??蕃茄可先放入果汁機打成泥、或直接切小丁放入鍋中。</p> <hr><h1>5</h1><p>加入1.2杯水、攪拌均勻、然後放入電鍋燉煮30～40分鐘、起鍋前攪拌均勻就完成囉！\\n\\n??加入1.2杯水（即米：水=1:1.2）這樣煮出來的飯差不多是平常吃的白飯。如果喜歡吃軟爛濕潤些的人、水量要再增加。</p> <hr><h1>6</h1><p>好吃??</p> <hr>', '顆、條、支、顆、些許、杯、杯、小匙、酌量、酌量、小塊、酌量'),
(103, '經典肉醬千層麵', '千層麵、番茄醬、瑞可達起司、牛絞肉、洋菇、培根、起司絲、九層塔、鹽巴、橄欖油', '8、2、1、200、8、4、2、2、1、1', '103.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>在沸水放入鹽巴以及橄欖油跟千層麵後煮8分鐘</p> <hr><h1>2</h1><p>將培根切成方便入口大小、洋菇切片</p> <hr><h1>3</h1><p>以中火預熱的鍋中放入培根跟牛絞肉或是豬絞肉炒兩分鐘、然後放入洋菇炒兩分鐘、倒入番茄醬後烹煮五分鐘即可（千層麵醬汁）</p> <hr><h1>4</h1><p>將醬汁鋪於鍋面上、鋪上四面千層麵</p> <hr><h1>5</h1><p>依序將步驟３個醬汁．瑞可達起司．起司絲．千層麵鋪上</p> <hr><h1>6</h1><p>最後將義大利扁葉巴西利葉片摘下後放入鍋中後、以小火烘烤約十分鐘即可</p> <hr>', '片、杯、杯、g、朵、片、杯、段、大匙、大匙'),
(104, '無油無泡打粉蜂蜜義式脆片', '蛋白、蛋黃、黑糖、蜂蜜、冰糖、鹽、肉桂粉、本土產中高筋麵粉、杏仁果粉、南瓜籽、草莓、可可豆', '1、1、15、14、10、0.3、0.2、40、30、30、20、16', '104.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 1, 0, 1, '<hr><h1>1</h1><p>蛋打入無油無水調理盆、蛋黃放入大碗。大碗放黑糖、蛋黃、蜂蜜拌勻(壓碎結塊)。粉類一起過篩(必)；過篩過不去的杏仁粉結塊弄散。烤箱預熱180?</p> <hr><h1>2</h1><p>果乾、可可豆切約葡萄乾大小</p> <hr><h1>3</h1><p>蛋白分2次加糖粉打到硬性發泡</p> <hr><h1>4</h1><p>取1/3與蛋黃蜜、用刮刀充分切拌均勻</p> <hr><h1>5</h1><p>倒入蛋白霜以切拌手法(跟做蛋糕一樣)、拌至剩少許白色即可、不用均勻</p> <hr><h1>6</h1><p>把粉類倒入蛋糊以切拌(勿壓)方式混至無白粉即可(不用均勻、只要粉都黏在蛋霜就好)</p> <hr><h1>7</h1><p>放堅果碎、可可豆、果乾粗略拌切拌幾下</p> <hr><h1>8</h1><p>輕輕勿壓鋪在烘焙紙上、不用認真塑形、厚度約2公分以下的長方狀</p> <hr><h1>9</h1><p>第一層180/155烤15分 (我的大P下火比較熱情)、取出、小心燙、用尖刀拿斜斜的切、不要壓。厚約1.1cm (頭尾切下來直接吃掉)</p> <hr><h1>10</h1><p>切成約1公分的薄片\\n烤箱預熱150?、炫風130/100第一層烤50分、燜10分、取出放涼</p> <hr><h1>11</h1><p>烤箱預熱150?、炫風130/100第一層烤50分、燜10分、取出放涼</p> <hr>', '顆、顆、g、g、g、g、g、g、g、g、g、g'),
(105, '菠菜肉醬千層麵', '千層麵、紅醬、台式肉醬、蕃茄麵醬、洋蔥、義大利香料、黑胡椒、紅酒、白醬、奶油、麵粉、牛奶、黑胡椒、鹽、波菜', '3、0、0.5、3、70、1、0.5、1、0、10、2、100、0.5、0.5、200', '105.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>準備食材、肉醬罐頭把底部油份全部去掉。</p> <hr><h1>2</h1><p>沸水煮千層麵3分鐘撈起備用。</p> <hr><h1>3</h1><p>把波菜燙熟泡冷水取出去水份備用。</p> <hr><h1>4</h1><p>起鍋放入奶油準炒白醬。</p> <hr><h1>5</h1><p>下麵粉不斷攪拌直至粉均勻下牛奶煮好備用。</p> <hr><h1>6</h1><p>起鍋炒洋蔥加沸水50ml煮滾下炒好的麵糊用打蛋器攪拌至均勻備用。</p> <hr><h1>7</h1><p>攪好的白醬如果太乾再下1湯匙牛奶即關火備用。</p> <hr><h1>8</h1><p>再起ㄧ個鍋炒洋蔥</p> <hr><h1>9</h1><p>下台式肉醬炒勻下紅酒炒。</p> <hr><h1>10</h1><p>下蕃茄麵醬、義大利香料、黑胡椒炒勻。</p> <hr><h1>11</h1><p>加沸水3湯匙煮滾備用。</p> <hr><h1>12</h1><p>取出烤盤先抹白醬。</p> <hr><h1>13</h1><p>再放上1片麵再抹上紅醬。</p> <hr><h1>14</h1><p>抹勻四周再疊一片麵。</p> <hr><h1>15</h1><p>再上白醬跟波菜。</p> <hr><h1>16</h1><p>再撒上起司絲。</p> <hr><h1>17</h1><p>再疊一片麵。</p> <hr><h1>18</h1><p>在依緒上紅醬再舖上波菜。</p> <hr><h1>19</h1><p>再填上白醬。</p> <hr><h1>20<h1><p>再撒上起司絲和巴西利（可不加）放入預熱的烤箱220度18分鐘。</p> <hr><h1>21</h1><p>稍微放涼即可享用。</p> <hr>', '片、0、罐、湯匙、g、茶匙、茶匙、湯匙、0、g、湯匙、ml、茶匙、茶匙、g'),
(106, '義大利蛋餅Frittata', '洋蔥、紅椒、磨菇、菠菜、培根、雞蛋、牛奶、起司', '0.5、1、150、150、100、6-8、50、60', '106.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 1, 0, 0, 1, 1, '<hr><h1>1</h1><p>熱鍋後下油、炒洋蔥至軟身、然後加入培根、磨菇、紅椒、用鹽和黑胡椒粉調味、盛起備用</p> <hr><h1>2</h1><p>在大碗內打發雞蛋、牛奶、下鹽和黑胡椒粉調味</p> <hr><h1>3</h1><p>再加入起司和所有煮熟的餡料、拌勻</p> <hr><h1>4</h1><p>將所有材料倒入烤盤內、放入已預熱180度C烤箱、烤約30-35分鐘即成！</p> <hr>', '個、個、克、克、克、個、毫升、克'),
(107, '義式豬肉蔬菜捲', '萵苣、豬肉片、番茄丁、毛豆、海鹽、黑胡椒、帕馬森起司、橄欖油', '3、100、50、20、5、5、15、12', '107.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>將豬肉片與黑胡椒、海鹽醃製約10分鐘.</p> <hr><h1>2</h1><p>將豬肉片用平底鍋煎熟備用. \\n(也可直接生肉備用)</p> <hr><h1>3</h1><p>將豬肉片鋪平、加入豬肉片、番茄丁及毛豆、捲起來.</p> <hr><h1>4</h1><p>進烤箱前抹上香料橄欖油.</p> <hr><h1>5</h1><p>180度C烤15分鐘即可.</p> <hr><h1>6</h1><p>上菜前、 可刨一些帕馬森起司.</p> <hr>', '大片(約30g)、g、g、g、g、g、g、g'),
(108, '意式餡餅Focacce', '中筋麵粉、水、鹽、乾酵母、橄欖油、芝士、蕃茄 ', '400、220、1、1、1、100、2', '108.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>大碗內放酵母及麵粉攪拌後、放入其他所有材料</p> <hr><h1>2</h1><p>搓揉成團狀</p> <hr><h1>3</h1><p>分成8等份 ((如做餡餅分成8份、如做pizza分成4份)</p> <hr><h1>4</h1><p>撒少許麵粉在檯及麵粉棍上、用麵粉棍壓成皮、放上餡料</p> <hr><h1>5</h1><p>放上另一塊皮埋口</p> <hr><h1>6</h1><p>鑊開中火、放少許油、放入餡餅或pizza</p> <hr><h1>7</h1><p>然後蓋上蓋煎兩分鐘至底金黃、即可返轉另一面繼續蓋上蓋煎至金黃</p> <hr><h1>8</h1><p>即可上碟、小心啊！超級燙口！慢慢享受吧！</p> <hr>', '克、毫升、茶匙、茶匙、湯匙、克、個'),
(109, '義式香料烤蔬菜', '小南瓜、牛番茄、大黃瓜、義大利香料、黑胡椒、鹽、橄欖油', '1/4、1、1/5、、、、', '109.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>將食材切成一口大小</p> <hr><h1>2</h1><p>將食材放入碗中、照個人喜好加入調味料、並找個盤子蓋上、然後搖勻。</p> <hr><h1>3</h1><p>將搖勻的食材放進烤盤、我是用氣炸鍋、所以就放進氣炸鍋附的烤器。</p> <hr><h1>4</h1><p>200度烤10分鐘、就完成囉！</p> <hr><h1>5</h1><p>盛盤後就可以開動了??</p> <hr>', '顆、顆、條、適量、適量、適量、適量'),
(110, 'Biscotti義大利杏仁脆餅', '雞蛋、香草精、糖、鹽、泡打粉、中筋麵粉、杏仁粉、堅果、巧克力、可可粉、咖啡粉、奶粉', '2、0.5、75、、0.5、150、25、100～150、20、0.5、0.5、1、視個人口味', '110.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 1, '<hr><h1>1</h1><p>事先將?堅果切碎、但不須先烘烤、避免過焦！烤箱180度預熱。</p> <hr><h1>2</h1><p>以手動打蛋器將?雞蛋跟?香草精拌勻；</p> <hr><h1>3</h1><p>加入?糖拌勻；</p> <hr><h1>4</h1><p>?中筋麵粉、?杏仁粉、?泡打粉、?鹽混合過篩、並加入步驟3用橡皮刮刀拌勻；</p> <hr><h1>5</h1><p>可分為2份、其中一份可擇一加入：\\nA.20克巧克力（事先隔水加熱）\\nB.1/2大匙可可粉\\nC.1/2大匙咖啡粉\\nD.1大匙奶粉\\nE.視個人口味；</p> <hr><h1>6</h1><p>拌入堅果；</p> <hr><h1>7</h1><p>在烤盤紙上灑粉、每次以1份的量、分次倒入麵團（食譜本身為2份；照片為3份）；</p> <hr><h1>8</h1><p>手沾麵粉、將麵團整為扁平長方形（烘烤時會再膨脹長高！）；</p> <hr><h1>9</h1><p>進烤箱以180度先烤25分鐘、取出放涼；</p> <hr><h1>10</h1><p>以麵包刀切片、每片寬約0.8～1公分；</p> <hr><h1>11</h1><p>於烤盤上並排並以150度烤10分鐘後、中途翻面再烤5分鐘；</p> <hr><h1>12</h1><p>取出放涼、裝入密封罐。</p> <hr>', '顆、大匙、克、少許、大匙、克、克、克、克、大匙、大匙、大匙、視個人口味'),
(111, '義式蕃茄奶油燉飯', '白飯、蝦子、豬肉、牛蕃茄、洋蔥、杏苞菇、蒜頭、橄欖油、奶油、牛奶、鹽巴、義式綜合香料', '1、3、7、2、0.5、1、2、1、1、酌量、酌量、酌量', '111.png', 'https://icook.tw/recipes/', 0, 1, 1, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>起鍋開中火放入橄欖油、油熱後放入蝦頭、煸至蝦頭變深紅。</p> <hr><h1>2</h1><p>放入洋蔥及蒜頭拌炒\\n再加入切碎的蕃茄一起炒、炒至蕃茄軟爛。（這步驟忘了拍照）\\n\\n??我先將煎好的蝦頭取出、比較好炒、炒好記得將蝦頭放入一起燉煮喔。</p> <hr><h1>3</h1><p>加入水、燉煮15分。（將蝦頭的美味燉入湯汁）</p> <hr><h1>4</h1><p>加入杏苞菇、蝦身、肉片、白飯及所有的調味料、攪拌均勻、繼續燉煮。</p> <hr><h1>5</h1><p>記得偶爾攪拌一下、避免飯黏在鍋底。\\n燉煮至白飯軟爛即完成囉！</p> <hr><h1>6</h1><p>太美味了??</p> <hr>', '碗、條、片、顆、顆、支、瓣、湯匙、小塊、酌量、酌量、酌量'),
(112, '義式料理-肉醬千層麵', '千層麵、起司絲、豬絞肉、蘑菇、市售義大利麵紅醬、洋蔥、蒜末、義式香料、黑胡椒粒、鹽、水、北海道奶油塊、水', '4人份、、400g、1盒、1罐、1顆、6顆、、、、、1小盒、300cc', '112.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>蘑菇用廚房紙巾擦乾淨（不能用水洗喔、會影響蘑菇的香氣及口感）、切片備用</p> <hr><h1>2</h1><p>不放油、下蘑菇乾炒、炒至蘑菇的水份都沒了（如圖）、起鍋備用</p> <hr><h1>3</h1><p>起油鍋、加少許的油、下絞肉、炒至絞肉微焦</p> <hr><h1>4</h1><p>加入切末的洋蔥及蒜末、拌炒至香氣冒出</p> <hr><h1>5</h1><p>倒入義大利麵紅醬罐頭拌炒</p> <hr><h1>6</h1><p>加入適量的水、義大利綜合香料、黑胡椒粒、拌炒均勻後、轉小火燉煮20分鐘左右</p> <hr><h1>7</h1><p>將300CC的水煮滾、放入北海道奶油塊、攪拌至奶油塊融化、備用</p> <hr><h1>8</h1><p>煮一鍋熱水、水滾後放一大匙的鹽、來燙千層麵、千層麵不用久煮、稍微變軟即可</p> <hr><h1>9</h1><p>取一個可以入氣炸鍋、烤箱的容器、底部先鋪一層肉醬</p> <hr><h1>10</h1><p>肉醬上舖上白醬</p> <hr><h1>11</h1><p>白醬上方舖上燙軟的千層麵、重複著肉醬、白醬、千層麵、肉醬、白醬、千層麵???、約3-4層就差不多了、最後一層是肉醬</p> <hr><h1>12</h1><p>最後鋪滿滿滿的起司絲</p> <hr><h1>13</h1><p>氣炸鍋版本：\\n氣炸鍋200度預熱2分鐘後、將千層麵放入氣炸鍋、先不啟動氣炸鍋、悶1-2分鐘、目的讓起司絲先稍微融化、氣炸時起司絲才不會亂飛、之後已150度氣炸15分鐘就完成囉</p> <hr><h1>14</h1><p>烤箱版本：\\n烤箱先以200度預熱10分鐘\\n以180度烤20分鐘、再以200度烤10分鐘、就完成囉</p> <hr><h1>15</h1><p>超好吃的、值得您一試喔</p> <hr>', '人份、適量、g、盒、罐、顆、顆、適量、適量、適量、適量、小盒、cc'),
(113, '自製藍莓優格義式冰淇淋byCara', '藍莓、優格、鮮奶、藍莓優格果泥 、液態鮮奶油 、含糖煉乳、Oreo巧克力夾心餅乾', '100、4、2、180、150、150、6', '113.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>利用果汁機或其他方式、製作藍莓優格果。不用濾渣。</p> <hr><h1>2</h1><p>將藍莓優格果泥與其他材料在另一個攪拌盆中先混拌均勻</p> <hr><h1>3</h1><p>從冷凍庫取出冷凍4小時以上的製冰桶(我的製冰桶平常就儲存在冷凍庫中)</p> <hr><h1>4</h1><p>可依各家品牌的機器說明操作、開啟電源、倒入材料、使自動攪拌。</p> <hr><h1>5</h1><p>我的機器經過15-20分鐘攪拌就會開始逐漸成形。通常在此時我就會將稍微成形的冰淇淋(如圖)挖出放入冷凍用保鮮盒、冷凍約2小時以上、想吃冰淇淋的時候隨時從冷凍庫拿出來挖幾球享用!\\n若要即時享用、可以多攪拌10分鐘、等到更加固化再將冰淇淋挖出、立即享用、這時口感會最接近義式冰淇淋Gelato!</p> <hr>', '、'),
(114, '低醣廚房-義式起司肉丸', '豬絞肉、白酒、義大利香料粉、鹽巴、黑胡椒、馬芝瑞拉起司、起司粉、杏仁粉、雞蛋', '1、1、1、、視個人喜愛、12、1、1、1', '114.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>白酒、香料粉、鹽巴、黑胡椒加入絞肉攪拌均勻至有些微黏性備用、雞蛋打散、起司粉加杏仁粉混合；將起司塊分成12等分搓圓。</p> <hr><h1>2</h1><p>挖一匙絞肉在手心抹平、放上一球起司塊包起來搓圓、沾蛋液後再裹上混合好的起司杏仁粉。</p> <hr><h1>3</h1><p>約可製成11-12顆起司肉丸！</p> <hr><h1>4</h1><p>熱油鍋、肉丸以中火半煎炸的方式煎熟。</p> <hr><h1>5</h1><p>熱騰騰上桌、食用請小心爆漿??</p> <hr>', '盒、匙、匙、少許、視個人喜愛、小塊、大匙、大匙、個'),
(115, '義式蒜香彩椒雞', '紅甜椒、黃甜椒、洋蔥、鴻禧菇/蘑菇、去骨雞腿排、香菜/迷迭香、蒜頭、義式香料、粗黑胡椒粉、鹽、白酒', '1、1、0.5、0.5、2、1、3-4、、、、10', '115.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>1??紅、黃甜椒各1顆洗淨後去籽跟蒂頭後切小塊備用、洋蔥半顆切小塊、蒜頭3-4大瓣切小片、香菜切末、鴻禧菇半朵切去根部備用、雞腿排2塊洗淨後擦乾表面水份切小塊備用。</p> <hr><h1>2</h1><p>2??開中小火、不放油、雞腿塊（皮朝下）下鍋煎、出油後翻面、煎至7分熟先起鍋放一邊備用。</p> <hr><h1>3</h1><p>3??用雞腿的油爆香蒜頭跟洋蔥、洋蔥炒至稍微變軟後、下鴻禧菇、紅黃甜椒持續翻炒。\\n炒至甜椒稍微變軟後、把剛才7分熟的雞腿塊倒回鍋中、並加白酒10c.c.繼續翻炒、最後加入意大利香料、黑胡椒、香菜末、少許鹽調味並炒至雞腿塊全熟即可起鍋??完成?</p> <hr>', '顆、顆、顆、盒、塊、小把、大辦、適量、適量、少許、c.c.'),
(116, '義式水煮魚', '魚、蛤蜊、蒜頭、洋蔥、小番茄、九層塔、白酒、鹽巴、黑胡椒、紅辣椒', '1、1-2、5、1、20-25、、300-350、、、1', '116.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>蒜頭切末、洋蔥切小塊、小蕃茄洗乾淨之後對半切、新鮮蛤蜊洗乾淨之後吐沙備用（我這邊使用的是已經可以直接煮的蛤蜊）、白酒350cc、紅辣椒切圈</p> <hr><h1>2</h1><p>在國外不容易買到台灣的九層塔、就用這種泰國的巴西里、味道跟長相都很像台灣的九層塔</p> <hr><h1>3</h1><p>我今天用的是海石斑魚、把魚洗乾淨之後走、擦掉水分、剁下魚頭（我的鍋子不夠大）、魚身兩面?幾刀之後、各自抹上?巴</p> <hr><h1>4</h1><p>熱油鍋、有油紋之後、把魚放進去煎一下、兩面都要煎一下</p> <hr><h1>5</h1><p>我先把煎好的魚頭拿起來、放入蒜頭和洋蔥拌炒</p> <hr><h1>6</h1><p>洋蔥炒到半熟時、把魚頭放進鍋子中、再加入小蕃茄</p> <hr><h1>7</h1><p>倒入白酒</p> <hr><h1>8</h1><p>煮滾後、舀起一些湯汁淋在上面的魚肉上</p> <hr><h1>9</h1><p>加上黑胡椒及?巴調味、我喜歡多一點黑胡椒、試一試湯汁味道、?巴先不要加太多、等等有蛤蜊、蛤蜊本身產生的湯汁也會有鹹味</p> <hr><h1>10</h1><p>倒入蛤蜊</p> <hr><h1>11</h1><p>蓋上鍋子、大概5分鐘</p> <hr><h1>12</h1><p>加入巴西里和紅辣椒圈</p> <hr><h1>13</h1><p>再淋上橄?油</p> <hr><h1>14</h1><p>完成！另外這湯汁拌飯、好好吃！</p> <hr>', '條、kg、瓣、顆、顆、適量、cc、適量、適量1條'),
(117, '義式香料番茄燉牛肉', '牛肋條、牛番茄、洋蔥、馬鈴薯、紅蘿蔔、水、小磨坊 百搭香草、小磨坊 玫瑰海鹽', '600、6、1、2、1、1200、10、1', '117.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>牛勒條切塊、加水淹過、泡30分～待血水釋出（去腥）；百搭香草裝入茶花袋中</p> <hr><h1>2</h1><p>馬鈴薯、紅蘿蔔去皮切滾刀；番茄去蒂切滾刀；洋蔥去除外膜、逆紋切絲</p> <hr><h1>3</h1><p>取一炒鍋、加入三大匙冷壓初榨橄欖油、倒入洋蔥、紅蘿蔔翻炒均勻接觸油末</p> <hr><h1>4</h1><p>舖入牛肉煎至由紅轉白</p> <hr><h1>5</h1><p>加入番茄翻炒、待茄紅素釋出</p> <hr><h1>6</h1><p>所有材料移至燉鍋中、加入清水、百搭香草、大火煮滾後、改轉小火悶煮1小時</p> <hr><h1>7</h1><p>加鹽調整鹹淡即完成料理</p> <hr>', 'g、顆、顆、顆、根、cc、g、小匙'),
(118, '義大利麵包佛卡夏', '高筋麵粉、即溶酵母粉、鹽、油、水、迷迭香、黑橄欖、蔓越莓', '500、10、10、40、350、、10、50', '118.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>麵粉、酵母粉、鹽、油及水、全部放入鍋中、揉成糰後、等發酵1小時。</p> <hr><h1>2</h1><p>發好的麵糰分成2等份、取一份將麵糰搓成長方形、放入已塗好油的模型裡、發酵30分鐘。</p> <hr><h1>3</h1><p>發酵好的麵糰、用手戳幾個洞。</p> <hr><h1>4</h1><p>淋上油、蔓越莓、橄欖、迷迭香及黑胡椒粉、放入烤箱220度烤20分鐘。</p> <hr>', 'g、g、g、g、g、少許、10、50'),
(119, '傳統義式肉醬麵', '牛絞肉、蒜末、洋蔥末、牛番茄、小番茄、番茄糊、高湯、鮮奶油、紅酒、百里香、迷迭香、月桂葉、海鹽、荳蔻粉、黑胡椒、羅勒葉', '120、15、35、1、80、120、50、50、30、15、20、3、3、3、3、30', '119.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>不沾鍋放橄欖油、 放入蒜末與洋蔥末炒至金黃色.</p> <hr><h1>2</h1><p>將牛絞肉加入鍋內拌炒、 加海鹽、迷迭香百里香、黑胡椒、百里香、迷迭香調味、炒約5分鐘</p> <hr><h1>3</h1><p>加入牛番茄丁與小番茄丁</p> <hr><h1>4</h1><p>再番茄糊、高湯、 紅酒與月桂葉.</p> <hr><h1>5</h1><p>最後加鮮奶油慢慢小火燉煮約25-30分鐘分鐘、 直到湯汁變濃稠</p> <hr><h1>6</h1><p>也可以用鑄鐵鍋、 將所有材料入鍋後、放入烤箱燉煮25-30分鐘.</p> <hr><h1>7</h1><p>將麵條與肉醬拌勻、 加上羅勒葉、即可美味上桌.</p> <hr>', 'g、g、g、顆、g、g、g、g、g、g、g、片、g、g、g、g'),
(120, '肉醬千層麵', '焗盤、優質橄欖油、千層麵、馬薩瑞拉起司、帕馬森起司、巴西里葉、蕃茄肉醬', '1、0.5、7、150、50、、200', '120.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>材料備好後、先煮滾一鍋水、並加入2茶匙鹽；巴西里葉用可飲用水洗淨；</p> <hr><h1>2</h1><p>量好千層麵的片數、再順便把馬薩瑞拉起司切片（用批薩起司也可以）；</p> <hr><h1>3</h1><p>將千層麵逐序放入滾水中、以免沾黏、滾水煮3-4分鐘即可。千層麵煮好後馬上用冷水沖洗降溫防沾、並瀝乾！</p> <hr><h1>4</h1><p>煮麵時倒些優質橄欖油在烤盤中、刷勻。\\n烤箱預熱到180度。</p> <hr><h1>5</h1><p>先鋪一層千層麵；</p> <hr><h1>6</h1><p>再鋪入一層蕃茄肉醬；</p> <hr><h1>7</h1><p>擺上馬薩瑞拉起司、再撒些帕馬森芝士；</p> <hr><h1>8</h1><p>再蓋上一層千層麵；接著重覆上面的步驟舀入蕃茄肉醬、鋪上馬薩瑞拉起司、撒些帕馬森起司.....</p> <hr><h1>9</h1><p>直到最後一層、就不再鋪千層麵了喔！排入馬薩瑞拉起司和撒點帕馬森起司就可準備入烤箱了喔～</p> <hr><h1>10</h1><p>將焗盤放到烤盤上、入烤箱180度烤22分鐘到表面上色即可。\\n趁烤千層麵時、將巴西里葉擦乾、切碎備用。</p> <hr><h1>11</h1><p>從烤箱取出～</p> <hr><h1>12</h1><p>撒些巴西里葉裝飾、待略放涼後再用刀子分切後、裝盤。\\n食用時可再撒點帕馬森起司和巴西里葉。</p> <hr>', '個、湯匙、片、g、g、少許、g'),
(121, '肉醬起司千層麵', '蒜頭、洋蔥、豬絞肉、牛絞肉、牛番茄、番茄配司、罐頭番茄、柳橙、新鮮羅勒葉、免先煮千層麵、Ricotta chz、酸奶、帕瑪森起士', '4-5、0.5、0.5、ㄧ、6-7、、、、、依自己喜好、、、', '121.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>備料??\\n\\n1.蒜頭切末\\n2.洋蔥切細小丁\\n3.羅勒葉切末\\n4.牛番茄去頭、煮滾水放入牛番茄至脫皮、拿起、等涼後切爛、番茄的汁務必留著。</p> <hr><h1>2</h1><p>圖中是未收乾狀態??\\n\\n1.先炒蒜末和洋蔥丁（炒香）\\n2.豬絞肉（炒半熟）加牛絞肉\\n3.放入切爛的去皮牛番茄和精華番茄汁\\n4.加入適量番茄配司和罐頭番茄（炒至快收乾）\\n5.加入羅勒葉末（炒至收乾）\\n6.最後可加柳橙汁增加香氣</p> <hr><h1>3</h1><p>圖中是已收乾狀態??\\n\\n收乾後起鍋、可開始鋪千層麵??</p> <hr><h1>4</h1><p>千層麵鋪法看個人喜好！\\n\\n我的做法??\\n\\n1.先鋪肉醬再撒帕瑪森起士再鋪上ricotta chz和少許酸奶\\n2.鋪千層麵\\n（重複動作、共3層）\\n3.最上面是鋪肉醬和超多帕瑪森起士\\n\\n??即可進烤箱（約30分鐘）??</p> <hr><h1>5</h1><p>?就完成啦</p> <hr>', '顆、顆、份、份、顆、適量、適量、適量、適量、依自己喜好、適量、適量、適量'),
(122, '義式茄汁雞肉咖哩飯', '去骨雞腿排、大蒜末、薑末、洋蔥末、咖哩粉、Prego義大利麵醬、咖哩粉、鹽麴', '3、5、3、1、3、1、2、2', '122.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>雞腿肉切塊後、加入醃料拌勻、醃漬至少1小時。(若天熱要放冷藏)</p> <hr><h1>2</h1><p>熱油鍋、加入蒜末、薑末、洋蔥末炒至洋蔥變軟後、加入咖哩粉炒出香氣。</p> <hr><h1>3</h1><p>接著倒入義大利麵醬拌勻、再加入步驟１的雞肉塊拌炒、蓋上鍋蓋小火燜煮10分鐘至雞肉熟即完成。(中間可開蓋拌炒一下、避免粘鍋煮焦了。)</p> <hr>', '片、瓣、片、個、大匙、罐(680g)、大匙、大匙'),
(123, '義式蒜香嫩煎雞丁佐檸香美乃滋', '雞胸切丁、鹽、水、蒜粉、無鹽奶油、檸檬醋、美乃滋', '300、1、100、各1/4、5、1、1', '123.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>雞胸切丁、放入保鮮盒中、倒入調好的鹽水、密封醃漬至少1小時</p> <hr><h1>2</h1><p>將無鹽奶油放入可微波的小碗中、微波10秒融化</p> <hr><h1>3</h1><p>倒掉鹽水、加入義式香料、蒜粉及融化的奶油拌勻</p> <hr><h1>4</h1><p>不沾鍋免放油、倒入雞丁後蓋上鍋蓋、以小火悶煎至肉表面泛白、翻面後續悶煎約3分鐘至肉熟</p> <hr><h1>5</h1><p>將檸檬醋與美乃滋拌勻成醬汁</p> <hr><h1>6</h1><p>將雞胸丁、醬汁盛盤即可~</p> <hr>', 'g、小匙、cc、小匙、g、小匙、小匙'),
(124, '白醬斜管麵', '斜管麵、雞腿肉、培根、蘑菇、洋蔥、蒜頭、奶油、麵粉、起司粉、鮮奶、黑胡椒、鹽巴、蛋黃', '500、2、5、數、0.5、數、3、3、3、400、、、2', '124.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>滾ㄧ鍋水、將斜管麵煮熟</p> <hr><h1>2</h1><p>雞腿肉去皮切條狀、培根切條狀、蘑菇切片、洋蔥蒜頭切末（未入鏡）</p> <hr><h1>3</h1><p>起鍋、小火將奶油融化\\n爆香洋蔥和蒜末</p> <hr><h1>4</h1><p>放入雞肉和培根拌炒</p> <hr><h1>5</h1><p>再放入蘑菇拌炒一下</p> <hr><h1>6</h1><p>全部炒熟後、加入麵粉、炒到沒有粉狀</p> <hr><h1>7</h1><p>加入牛奶、起司粉、鹽巴、黑胡椒、煮沸\\n試試味道、味道可以重一點、因為還要加麵</p> <hr><h1>8</h1><p>斜管麵煮熟煮軟、瀝乾水分</p> <hr><h1>9</h1><p>將斜管麵加入調好味道的醬汁中、攪拌均勻</p> <hr><h1>10</h1><p>起鍋前加上2顆蛋黃、讓醬汁更濃稠、也可以讓醬汁更容易吸附再麵上</p> <hr>', '克、片、片、顆、顆、瓣、大匙、大匙、大匙、cc、適量、適量、顆'),
(125, '蜜醋茄醬雞肉義大利麵', '去骨雞腿、義大利麵、百家珍 蜂蜜醋、番茄醬、水、冷凍毛豆/玉米粒、鹽', '2、150、2、3、450、各25、0.5', '125.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>乾淨塑膠袋中倒入1大匙蜂蜜醋+1大匙番茄醬揉勻、再放入去骨雞腿揉勻、冷藏醃漬至少半天</p> <hr><h1>2</h1><p>將去骨雞腿皮面朝下入鍋、蓋上鍋蓋以小火悶煎約5分鐘至肉表面變色\\n（這次使用去骨的棒棒腿、所以會比一般雞腿排小、多煎一片是另外吃的、食譜材料份量為2人份）</p> <hr><h1>3</h1><p>將雞腿翻面、續悶煎約5分鐘至肉熟後盛起備用</p> <hr><h1>4</h1><p>原鍋倒入水、2大匙番茄醬、冷凍毛豆、玉米粒、蓋上鍋蓋煮滾</p> <hr><h1>5</h1><p>加鹽調整鹹味、倒入義大利麵、小火悶煮約7分鐘</p> <hr><h1>6</h1><p>掀蓋後加入1大匙蜂蜜醋拌勻、與雞腿排一起盛盤即可</p> <hr><h1>7</h1><p>嫩嫩的雞腿鮮嫩多汁、\\n帶點酸甜很惹味、\\n起鍋前加的蜂蜜醋讓義麵香氣帶點甜、\\n吃起來是蠻清爽的口味~</p> <hr>', '支（約200g）、g、大匙、大匙、cc、g、0小匙'),
(126, '義式香草起司棒', '低筋麵粉、雞蛋、鹽巴、鮮奶、泡打粉、細砂糖、無鹽奶油、金黃起司粉、粗黑胡椒粒、義大利香料粉', '450、2、3、155、6、45、60、10、2、4', '126.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>把需要的食材分別秤好（因為開學日要送老師、所以食材是*2）我的麵粉有900克囧</p> <hr><h1>2</h1><p>低筋麵粉/泡打粉/糖/鹽過篩拌勻</p> <hr><h1>3</h1><p>過篩金黃起司粉</p> <hr><h1>4</h1><p>灑上胡椒粒和香料</p> <hr><h1>5</h1><p>因為我做來送人所以雞蛋是*4（正常是*2）\\n奶油要隔水加熱成液態</p> <hr><h1>6</h1><p>無鹽奶油/雞蛋/鮮奶先攪拌一起</p> <hr><h1>7</h1><p>把液體倒入粉類拌勻</p> <hr><h1>8</h1><p>用刮刀按壓成團</p> <hr><h1>9</h1><p>把麵團放入塑膠袋鬆弛30分鐘、使用桿麵棍桿成0.6公分厚度、放入冷藏30分鐘</p> <hr><h1>10</h1><p>表面刷上鮮奶用叉子戳洞。\\n烤箱210/180烤25分鐘</p> <hr><h1>11</h1><p>烤第一次後放涼。</p> <hr><h1>12</h1><p>切成1*10左右的長條（看你有多大的容器可以裝餅乾）。</p> <hr><h1>13</h1><p>再150/150烤第二次約18分鐘</p> <hr><h1>14</h1><p>放涼後密封即可。</p> <hr>', 'g、個、g、g、g、g、g、g、g、g'),
(127, '義式番茄牛肉', '牛里肌肉、去皮番茄罐頭、義式香料、巴薩米克醋、黑胡椒粉、糖、鹽、水量約', '400、1、1、1、0.5、1.5-2、1、450', '127.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 1, '<hr><h1>1</h1><p>牛里肌肉切塊。平底鍋中放入一大匙橄欖油、開中火加熱、油微溫就可以把肉塊放入、把表面煎熟成上色。</p> <hr><h1>2</h1><p>肉上色後、倒入蕃茄罐頭、水量</p> <hr><h1>3</h1><p>約煮30 分鐘下調味料、再把醬汁收到剩約150ml的量、就差不多可以準備起鍋囉。</p> <hr><h1>4</h1><p>最近番茄價錢不太可愛、所以運用蕃茄罐頭來做料理、也是很方便、美味的。</p> <hr><h1>5</h1><p>使用里肌肉不需要燉煮太久（除非買的里肌肉部位筋比較多） 如果使用其他帶筋部位（像是牛腱）原則上約要滷一小時、筋才咬得動喔。通常要滷比較久的料理、我會運用電鍋幫忙、會可以輕鬆一點免去顧爐。</p> <hr>', 'g、罐、小匙、小匙、小匙、大匙、小匙、ml'),
(128, '蕃茄燉肉', '豬腱肉、蒜末、醬油、黑胡椒、洋蔥、牛蕃茄、黑胡椒、百里香', '400、3、15、2、0.5、560、3、3', '128.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>將大蒜、醬油、黑胡椒放入豬腱肉中充分混合。混和完成後、建議可蓋上保鮮膜放置5-10分鐘、讓豬腱肉更加入味。</p> <hr><h1>2</h1><p>鍋內下油加熱、放入調味好的豬腱肉煎炒至兩面金黃。</p> <hr><h1>3</h1><p>加入洋蔥拌炒至洋蔥稍微軟化即可。</p> <hr><h1>4</h1><p>加入牛番茄拌炒至牛番茄稍微軟化即可。</p> <hr><h1>5</h1><p>火源轉小火、蓋上鍋蓋燉煮30分鐘。燉煮完成後關火、不開鍋蓋再燜10分鐘。</p> <hr><h1>6</h1><p>最後加入黑胡椒與乾燥百里香、拌勻後料理即可完成。</p> <hr>', '克、瓣、克、克、0顆、克、克、克'),
(129, '超濃厚義式蕃茄濃湯', '大蕃茄、洋蔥、大蒜、紅蘿蔔、高湯凍、月桂葉、九層塔或羅勒、鹽、黑胡椒、起司粉', '5、1、3、1、1、2、10、、、', '129.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>蕃茄輕畫十字</p> <hr><h1>2</h1><p>每顆微波30~40秒就可以輕鬆去除外皮（微波爐一次不要放超過兩顆效果比較好）</p> <hr><h1>3</h1><p>備料：大蒜、洋蔥和去皮蕃茄通通切碎、紅蘿蔔切小丁</p> <hr><h1>4</h1><p>熱鍋放一點油炒香洋蔥和大蒜。</p> <hr><h1>5</h1><p>待洋蔥轉黃變軟加入蕃茄和紅蘿蔔拌一拌。</p> <hr><h1>6</h1><p>倒入蓋過食材份量的清水、放高湯凍和月桂葉、煮滾後繼續煮20~30分鐘或直到蔬菜熟透。\\n（我是用凍狀的濃縮高湯、看取得方便用高湯罐頭、高湯塊都可以、口味也不拘、端看個人喜好用雞湯、牛肉湯或蔬菜口味都適合）</p> <hr><h1>7</h1><p>用適量鹽和黑胡椒調味。\\n（如果買到的蕃茄剛好比較酸可以加點糖中和酸味、加牛奶會有奶香我也覺得蠻不錯的）</p> <hr><h1>8</h1><p>用手持攪拌棒或果汁機打碎。</p> <hr><h1>9</h1><p>趁熱放入九層塔葉拌一拌。</p> <hr><h1>10</h1><p>吃之前撒上起司粉就可以了～</p> <hr>', '顆、顆、瓣、根、個、片、片、適量、適量、適量'),
(130, '義式煎南瓜佐鼠尾草奶油', '南瓜、鹽、黑胡椒、新鮮鼠尾草（乾燥亦可）、大蒜、奶油、檸檬汁', '0.5、0.5、0.5、3、2、10、1', '130.png', 'https://icook.tw/recipes/', 0, 1, 0, 0, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>大蒜和鼠尾草切碎、南瓜刷乾淨帶皮切薄片備用</p> <hr><h1>2</h1><p>南瓜片放在可微波的盤子上後均勻撒上鹽和黑胡椒</p> <hr><h1>3</h1><p>微波兩分鐘、翻面再灑一次鹽和黑胡椒後繼續微波兩分鐘（時間請依照自家微波爐瓦數調整、加熱到南瓜熟、拿筷子可以輕鬆穿過的程度即可）</p> <hr><h1>4</h1><p>平底鍋熱鍋抹一點油、放入南瓜片、兩面都煎上色、有點焦焦的就可以拿起來</p> <hr><h1>5</h1><p>用同一把鍋子來做鼠尾草奶油：將奶油、鼠尾草和大蒜一起加熱</p> <hr><h1>6</h1><p>待大蒜炸到變金黃色倒入檸檬汁攪拌均勻即可熄火</p> <hr><h1>7</h1><p>最後把步驟六淋在剛剛煎好的南瓜上</p> <hr>', '顆、小匙、小匙、片、瓣、g、大匙'),
(131, '義大利肉醬', '絞肉<牛或豬都可>、蒜頭、洋蔥、磨菇、紅蘿蔔、牛蕃茄、紅酒、黑胡椒、義式香料、蕃茄醬、月桂葉、蘿葧葉<可不用>', '500、5、0.5、15、1、2、100、、、250、5、1', '131.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>所有食材先切丁\\n加入熱鍋2大匙油先炒洋蔥\\n洋蔥軟後加入\\n蒜未->絞肉->紅蘿蔔->磨菇->蕃茄->月桂葉->紅酒</p> <hr><h1>2</h1><p>燉煮40分鐘至食材熟透\\n太乾可加入雞高湯</p> <hr><h1>3</h1><p>最後開始調味\\n我有加入蘿勃</p> <hr><h1>4</h1><p>放涼後可放入冷凍需要時在拿出來加熱</p> <hr><h1>5</h1><p></p> <hr>', '克<約2盒>、顆、顆、顆<1盒>、條、顆、cc、少許、少許、cc<1瓶>、片、小把'),
(132, '白酒海鮮義大利麵', '義大利麵、透抽、蝦仁、牛蕃茄（中粒）、洋蔥、蒜頭（大）、九層塔（或羅勒）、橄欖油、白酒、黑胡椒（粗）、煮麵水', '0.5、1、10、2、0.25、4、1、、、、1', '132.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>煮一鍋水、??面加入少許鹽、放入義大利麵、煮10分、中途要拌一拌才不會沾鍋底、之後撈起到另一鍋內、加入少許橄欖油拌勻、以防結糰。\\n煮麵的水留1碗待用。\\nps：煮麵時間視不同品牌而定、包裝袋子上會有註明。</p> <hr><h1>2</h1><p>（1）透抽去皮去內臟、切圈、和剖背後的蝦仁、用熱水燙煮約5分熟、撈起、用水洗乾淨、待用。\\n（2）洋蔥切小丁。\\n（3）牛蕃茄切大丁。\\n（4）蒜頭去頭和皮、切片。\\n（5）九層塔稍切成絲。</p> <hr><h1>3</h1><p>鍋內放入適量的橄欖油、爆香蒜片和洋蔥丁、隨後放入處理好的透抽、蝦仁、蕃茄丁、白酒鍋邊搶香後再加入義大利麵、黑胡椒粉、鹽、煮麵水、拌炒勻、滾後再加入九層塔拌勻即可。</p> <hr><h1>4</h1><p>裝盤享用～</p> <hr>', '包、大支、支、粒、粒、瓣、小把、適量、適量、適量、碗'),
(133, '香煎義式香草雞腿肉', '雞腿肉、玉米粉、鹽巴、義式香料粉、煎油', '480、、1、1、', '133.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>雞腿肉洗淨、擦乾、切成小塊.</p> <hr><h1>2</h1><p>將切塊之雞腿肉沾上一層玉米粉.</p> <hr><h1>3</h1><p>取一鍋、鍋中放入少許油、再加入雞腿肉、中火煎熟.(少油開始煎起、若覺得油被玉米粉吸走了、再視情況加少許油.(雞腿肉會再出油的)</p> <hr><h1>4</h1><p>出油的雞腿肉.</p> <hr><h1>5</h1><p>將多餘的油倒出.</p> <hr><h1>6</h1><p>乾鍋的情況下、灑上?巴及義式香料粉、即可起鍋.</p> <hr>', 'g、適量、匙、T、少許'),
(134, '義式烤番茄', '番茄、羅勒葉、義大利香料、海鹽、研磨黑胡椒、橄欖油、巴薩米可醋', '2、、、、、、', '134.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>將番茄切片平鋪在烤盤上</p> <hr><h1>2</h1><p>將義大利香料 海鹽 研磨黑胡椒 橄欖油\\n均勻分佈灑在番茄表面</p> <hr><h1>3</h1><p>烤箱220度 預熱5分鐘 烤15分鐘</p> <hr><h1>4</h1><p>上桌前 再淋上適量的巴薩米可醋</p> <hr><h1>5</h1><p>配上起司片 也很好吃??</p> <hr>', '顆、適量、適量、適量、適量、適量、適量'),
(135, '義大利牛肉蕃茄濃湯', '牛肉、無?奶油、橄欖油、洋蔥、蒜頭、胡蘿蔔、蕃茄、洋菇、迷迭香、月桂葉、罐頭蕃茄、蕃茄醬、糖、高湯、義大利綜合香料、黑胡椒、?、帕瑪森乾酪、法國麵包', '230、、1、2-3、150、2-3、160、1、2、1、、2、300、、、、數片', '135.png', 'https://icook.tw/recipes/', 0, 1, 1, 1, 0, 1, 0, 0, 1, '<hr><h1>1</h1><p>牛肉加?、黑胡椒醃一下</p> <hr><h1>2</h1><p>蒜頭、洋蔥、胡蘿蔔、洋菇、蕃茄切小塊</p> <hr><h1>3</h1><p>鍋中放一點奶油來煎牛肉、香氣更濃郁</p> <hr><h1>4</h1><p>牛肉大致上色後、加入洋蔥拌炒至軟化、再加入蒜末續炒</p> <hr><h1>5</h1><p>胡蘿蔔、洋菇接著下鍋炒</p> <hr><h1>6</h1><p>倒入新鮮蕃茄、蕃茄醬及罐頭蕃茄\\n使用三種不同的蕃茄、可以使味道更豐富、更有層次</p> <hr><h1>7</h1><p>迷迭香、月桂葉及義大利綜合香料加入\\n倒入高湯或水、煮滾後嚐一下味道、適時添加糖以調整酸味\\n蓋上鍋蓋以小火悶煮約40-50分鐘</p> <hr><h1>8</h1><p>盛裝後刨些帕瑪森乾酪、烤幾片酥脆的法國麵包、沾著香氣撲鼻的濃湯吃最對味！</p> <hr>', 'g、適量、個、瓣、g、個、g、支、片、罐、少許、小匙、ml、適量、少許、適量、數片'),
(136, '義大利麵佐青醬奶油醬', '煮好的義大利麵、鮮奶油、青醬、洋蔥', '90、100、40、0.5', '136.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>洋?炒香、加入鮮奶油以小火煮至濃稠、熄火、再拌入青醬、拌勻。</p> <hr><h1>2</h1><p>麵條加入步驟1.拌勻、即可享用。</p> <hr><h1>3</h1><p>食譜參考：https://www.rewe.de/rezepte/spaghetti-mit-pesto-sahnesauce/</p> <hr>', 'g、g、g、顆'),
(137, '茄汁雞肉披薩餃＿平底鍋快速版', '雞胸肉、市售茄汁義大利麵醬、洋蔥、大蒜、糖、九層塔、鹽和黑胡椒、起司片、麵粉、酵母粉、糖、鹽、奶油或植物油、牛奶或水', '1、3、0.5、2、0.5、1、、2~3、200、2、0.5、0.5、10、200', '137.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 1, '<hr><h1>1</h1><p>雞胸肉切小塊、洋蔥和大蒜切碎、九層塔洗淨備用</p> <hr><h1>2</h1><p>熱鍋用少許油炒香洋蔥和大蒜</p> <hr><h1>3</h1><p>放入雞肉略炒一下、雞肉變白後放入砂糖和義大利麵醬拌炒到雞肉熟（如手邊有喜歡的香料也可以加一下）</p> <hr><h1>4</h1><p>放入九層塔葉後蓋鍋蓋悶一下即可熄火、先擺著</p> <hr><h1>5</h1><p>接著做麵團：牛奶和奶油微波50秒（500W）至奶油融化、牛奶一點點溫</p> <hr><h1>6</h1><p>麵粉、糖、鹽、酵母粉混合均勻、倒入剛剛的牛奶奶油攪拌成糰</p> <hr><h1>7</h1><p>麵團微波加熱20秒（500W）</p> <hr><h1>8</h1><p>均分成三小團</p> <hr><h1>9</h1><p>每個麵團都桿成薄片、這次額外黏幾片葉子作裝飾</p> <hr><h1>10</h1><p>麵皮一半的地方放上剛剛炒好的茄汁雞肉和起司、麵皮邊緣用手沾水塗一圈幫助黏合</p> <hr><h1>11</h1><p>對折包起來後用叉子壓一壓、固定開口順便做造型（這次的材料可以做三份）</p> <hr><h1>12</h1><p>熱鍋不用放油、兩面乾烙到金黃有點焦焦的就完成了</p> <hr><h1>13</h1><p>吃不完可以冷凍保存！</p> <hr>', '片、大匙、顆、辦、大匙、撮、適量、片、g、小匙、小匙、小匙、g、ml'),
(138, '義式羅勒番茄冷湯', '紅甜椒、小番茄、羅勒或九層塔、洋蔥、大蒜、冰的高湯+水、橄欖油、鹽和黑胡椒、帕瑪森起司粉', '1、5、5、0.25、2、400、1、、', '138.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>小番茄、甜椒、大蒜、洋蔥和羅勒切碎備用（沒有小番茄用大番茄一顆也可以、沒有羅勒就用九層塔）</p> <hr><h1>2</h1><p>取小碗放入番茄、甜椒、大蒜和洋蔥、加入橄欖油、鹽和黑胡椒調味後攪拌均勻</p> <hr><h1>3</h1><p>微波個50秒（聽說番茄加熱茄紅素比姣好吸收、如果沒有微波爐也可以用鍋子炒一下、但其實不加熱也沒什麼關係啦）</p> <hr><h1>4</h1><p>微波好後加入冰高湯和九層塔</p> <hr><h1>5</h1><p>用手持攪拌棒或果汁機打均勻、如不夠鹹就再加點鹽、最後放冷藏冰到滿意的溫度即可</p> <hr><h1>6</h1><p>吃之前灑點帕瑪森起司粉、也可以額外加點麵包丁豐富口感！</p> <hr>', '顆、顆、片、顆、瓣、ml、小匙、少許、少許'),
(139, '義式肉丸蔬菜湯', '金寶義大利蔬菜湯 10.5oz、水、紅椒汁、麵包粉、牛奶、橄欖油、洋蔥末、牛絞肉、豬絞肉、蛋、巴西里、蒜末、鹽、黑胡椒、乾燥辣椒片、義大利香料、巴馬乾酪粉', '1、300、5、30、100、10、0.5、200、200、1、2、2、5、2、2、5、10', '139.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>於空碗中倒入麵包屑、牛奶、攪拌均勻、靜置 20 分鐘</p> <hr><h1>2</h1><p>取一空鍋倒入橄欖油、放入洋蔥末、拌炒至半透明、取出後放涼備用</p> <hr><h1>3</h1><p>盆中加入步驟一、步驟二、豬絞肉、牛絞肉、雞蛋、巴西里葉、大蒜、鹽、黑胡椒、紅辣椒片、義大利香料、巴馬乾酪粉、所有食材攪拌混合均勻、蓋上保鮮膜冷藏1小時\\r\\n</p> <hr><h1>4</h1><p>手將肉丸搓成小球狀、入烤箱、以220℃烤20分鐘</p> <hr><h1>5</h1><p>起一湯鍋、倒入金寶義大利蔬菜湯、原罐再裝滿水倒入、攪拌均勻、放入烤好的肉丸、小火燉煮入味</p> <hr><h1>6</h1><p>依喜好倒入紅椒汁、撒上些許黑胡椒即可起鍋</p> <hr>', '罐、ml、ml、g、ml、ml、顆、g、g、顆、g、顆、g、g、g、g、g'),
(140, '蒜香蜂蜜烤蕃茄＿簡單義式開胃菜', '小番茄、大蒜、蜂蜜、橄欖油、百里香或義式香料、鹽巴和黑胡椒', '250、2、1、2、、', '140.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>小番茄洗淨對切、放在烤盤或可進烤箱的容器上。（烤箱先預熱190度）</p> <hr><h1>2</h1><p>取小碗混合大蒜、蜂蜜、橄欖油、再用鹽巴和黑胡椒調味</p> <hr><h1>3</h1><p>攪拌均勻後淋在番茄上拌一拌</p> <hr><h1>4</h1><p>再撒上百里香或義式香料</p> <hr><h1>5</h1><p>用烤箱烤20~30分鐘。（中間偶爾看一下避免焦掉、也可以翻個面）</p> <hr><h1>6</h1><p>焦糖化的酸甜番茄超好吃> </p> <hr>', 'g、瓣、大匙、大匙、少許、適量'),
(141, '義式蕃茄燉牛肉', '牛肋條、牛蕃茄、洋蔥、蘑菇、紅蘿蔔、馬鈴薯、義大利香料、海鹽、蕃茄丁罐頭、醬油、冰糖或二砂、熱水', '約900、3、1、10、1、2、2、2、1、3、3、1.5', '141.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>牛肋切塊抓醃、冷藏30分鐘以上。</p> <hr><h1>2</h1><p>洋蔥、紅蘿蔔、馬鈴薯切塊、蘑菇一分為四。\\r\\n牛蕃茄於底部切劃十字、丟入滾水中煮約40秒、可明顯看出皮和果肉分離、撈起丟入冰水中浸泡60秒、即可輕鬆去皮、後切塊。</p> <hr><h1>3</h1><p>冷鍋不放油、乾煸牛肋至微微焦香後、瀝油盛起備用。</p> <hr><h1>4</h1><p>原鍋、用煸出的牛油炒香洋蔥呈半透明狀、加入紅蘿蔔翻炒約5分鐘、再加入蕃茄&蘑菇炒香、最後加入馬鈴薯拌炒均勻。</p> <hr><h1>5</h1><p>牛肋放入翻炒均勻後、加入(調味)、煮沸後、加蓋、小火悶煮40分鐘、續悶40分鐘、即可享用香嫩可口的燉牛肉咯！</p> <hr><h1>6</h1><p>我在家樂福買的蕃茄罐頭。</p> <hr>', 'g、小顆、顆、朵、根、小顆、大匙、小匙、罐、大匙、大匙、米杯'),
(142, '義式烤甜椒', '紅甜椒、黃甜椒、橄欖油、鹽、黑胡椒、羅勒香料、巴薩米克醋', '0.5、1、、、、、', '142.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>將甜椒洗淨去籽、縱切寬長瓣、放入淺烤盤。</p> <hr><h1>2</h1><p>倒入適量橄欖油拌勻、讓甜椒表皮都沾附油。</p> <hr><h1>3</h1><p>以甜椒皮朝上方向、將烤盤放進預熱200度烤箱的最上層、烤約10-15分鐘、當甜椒表皮有呈現焦狀即可取出。</p> <hr><h1>4</h1><p>取出後加入適量的全部調味料即完成。</p> <hr>', '顆、顆、適量、適量、適量、適量、適量'),
(143, '義式雞肉野菇燉飯', '雞高湯 1200 c.c、義大利米/壽司米 200 克、去皮去骨雞大腿、蘑菇 、甜洋蔥、紅蔥頭、大蒜 、白酒、初榨橄欖油、帕梅善起司絲、奶油、鹽、黑胡椒、巴西利葉/香芹葉', '約5、約1.2、5 、6 、0.5、3、4、100、約7、約4、約2、1、、', '143.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>把1公斤雞骨放進滾水中川燙去血水、 另外燒滾2500 c.c.的水、 放入川燙好的雞骨、 熬約2小時、 這就是我們的雞高湯. (讓高湯一直保持小滾的狀態直到做完燉飯)</p> <hr><h1>2</h1><p>取一個有深度的燉飯鍋、 放入橄欖油、 洋蔥、 紅蔥頭和蒜末、 用中小火炒軟.</p> <hr><h1>3</h1><p>放入雞肉煎至一面焦脆後、 再跟其他食材拌炒均勻. (這樣雞肉的兩面會有不同的口感)</p> <hr><h1>4</h1><p>加入蘑菇炒軟</p> <hr><h1>5</h1><p>(米不用洗) 放米入鍋拌炒、 讓米粒充分包覆油脂和均勻受熱. (中小火炒約2.5分鐘)</p> <hr><h1>6</h1><p>火轉大一點、 加入白酒、 持續攪拌讓所有的食材混合均勻、 並注意不要燒焦. (約2分鐘)</p> <hr><h1>7</h1><p>分次加入熱的高湯、 每次加高湯蓋過食材(約2湯瓢)、 用大火大滾的方式、 並不斷攪拌直到米粒吸收高湯、 變成黏稠狀後、 再次加入高湯蓋過食材、 如此重複數次.</p> <hr><h1>8</h1><p>在第三次加湯的時候、 加入鹽巴、 並試吃米粒的硬度、 (理想的米粒硬度是米心不透的狀態、 就是米咬得動、 但米心還有點硬、 米心沒有煮透的質感.)</p> <hr><h1>9</h1><p>當米粒煮到恰到好處後、 不要把湯汁收乾、 保留一點湯汁、 關火後加入奶油、 帕馬森起司和巴西利葉攪拌均勻即可、 撒上黑胡椒趁熱享用.</p> <hr>', '杯、量米杯、片、 朵、個、瓣、瓣、c.c、大匙、大匙、大匙、小匙、適量、適量'),
(144, '義式肉丸佐番茄肉醬', '豬絞肉、牛絞肉、義大利香腸肉、洋蔥、雞蛋、洋蔥粉、白胡椒粉、薑粉、大蒜鹽、蔬菜油、米酒、水、日式麵包粉、市售番茄義大利麵醬 1瓶、鹽、楓糖、白酒、水', '約450、約450、約450、0.5、1、、、、、、、1、1、約680、1、1、、340', '144.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>將豬絞肉、 牛絞肉和義大利香腸肉各取1/2盒放進大碗、 加入所有肉丸子調味料、 攪拌均勻、 放冰箱備用.</p> <hr><h1>2</h1><p>取一中鍋、 待鍋燒熱、 放入少許蔬菜油、 將洋蔥炒軟後、 加入另外1/2盒的三種絞肉、 以中火煸炒直到絞肉散開、 炒的過程中加入少許白酒增加香氣、 等絞肉變色後、 加入義式番茄醬和水、 轉小火續煮20分鐘.</p> <hr><h1>3</h1><p>此時、 預熱旋風烤箱至350度F或177度c、 將醃好的肉餡、 捏成肉丸子、 排放在噴上防沾油錫箔紙的烤盤上、 烤約10分鐘、 或直到肉丸變色.</p> <hr><h1>4</h1><p>攪拌肉醬、 先把醬上的浮油撈除、 然後加入肉丸子、 沸騰後、 小火續煮10鐘、 調味完成即可搭配各種義大利麵.</p> <hr>', '克、克、克、顆、個、適量、適量、適量、適量、少許、少許、大匙、杯 (美式量杯)、ml、小匙、大匙、少許、ml'),
(145, '義式香草麵包棒', '高筋麵粉、南瓜泥、水、鹽、速發酵母粉、細砂糖、無鹽奶油、小磨坊義大利香料', '210、60、70、3、3、15、10、', '145.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>將所有材料丟入麵包機、選擇麵包麵糰模式、揉好成糰後、在麵包機內進行第一次發酵(一發)60分鐘</p> <hr><h1>2</h1><p>將一發過後的麵糰取出來、手揉成圓形狀後、室溫下靜置10分鐘</p> <hr><h1>3</h1><p>將麵糰?成長方形再進行切割、呈長條狀</p> <hr><h1>4</h1><p>再次室溫靜置10分鐘、此時可先預熱烤箱 (175度預熱10分鐘)</p> <hr><h1>5</h1><p>放入175度的烤箱(烤溫須視各家烤箱不同而調整)、烤10~15分鐘即完成</p> <hr><h1>6</h1><p>包裝一下、外出野餐或當早餐也好適合???? 更是送禮的好選擇呢！</p> <hr><h1>7</h1><p>份量做多也不怕、只要放冷凍、隔天再回烤、一樣有好吃的麵包棒！</p> <hr>', 'g、g、g、g、g、g、g、適量'),
(146, '義式風味紅酒特式雞肝', '洋蔥、橄欖油、雞肝、紅酒、黑胡椒 鹽巴、吐司、起士絲', '1、、300、180、、4、', '146.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>起鍋後倒入適量橄欖油\\r\\n將洋蔥絲倒入煸炒</p> <hr><h1>2</h1><p>另外煮一鍋水將雞肝稍為川燙3分鐘備用</p> <hr><h1>3</h1><p>將步驟2倒入步驟1\\r\\n加入紅酒及調味料ㄧ起翻炒</p> <hr><h1>4</h1><p>烹煮完成至收汁約6-8分鐘</p> <hr><h1>5</h1><p>吐司切成小三角型\\r\\n擺上起士絲烤至融化</p> <hr><h1>6</h1><p>最後取適量的步驟4放上烤好的吐司片上一起品嚐層次感豐富好吃哦</p> <hr>', '顆、適量、克、豪升、適量、片、適量'),
(147, '義式香草烤雞', '雞腿肉、新鮮奧勒岡、新鮮迷迭香、新鮮檸檬百里香、紅椒粉（增香、增色、可略）、蒜頭、海鹽、黑胡椒、橄欖油、白酒、洋蔥、小蕃茄、綠、白花椰菜、玉米筍', '2、2、1、1、1、3、1.5、、1、1、0.5、數、、6', '147.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>食材準備如下：\\r\\n請將新鮮香草洗靜略為擦乾、雞腿也洗靜備用\\r\\n\\r\\n??如果沒有新鮮香草、可用義大利綜合香料1小匙代替、在超市就可以買到了</p> <hr><h1>2</h1><p>用叉子在雞肉上叉幾個洞、並用刀子把雞腿比較厚的地方劃開、可以讓雞腿更入味、也更快熟</p> <hr><h1>3</h1><p>香料隨意切碎、和其他醃料一起倒在雞腿肉上、幫雞腿按摩按摩、幫助入味</p> <hr><h1>4</h1><p>按摩好雞肉、放置冰箱3小時以上入味\\r\\n??可以放隔天更加美味喔！！</p> <hr><h1>5</h1><p>取一烤盤、把切大塊的洋蔥舖底、隨意擺上小蕃茄、烤箱預熱200度10分鐘、就可以放入烤箱烤25分鐘\\r\\n\\r\\n??這個時候可以放耐烤的蔬菜一起烤、例如地瓜、南瓜、紅蘿蔔、洋蔥??可依個人喜好改變</p> <hr><h1>6</h1><p>25分鐘過去了、雞腿烤到漂亮的金黃色、可以把花椰菜和玉米筍都放進去一起烤到喜歡的熟度、就可以出爐啦～～</p> <hr><h1>7</h1><p>美味開動啦??????\\r\\n也可以擠上檸檬汁、滋味更加清新喔！！</p> <hr>', '大隻、小隻、隻、小束、小匙、瓣、小匙、少許、大匙、大匙、顆、顆、適量、隻'),
(148, '義式蕃茄牛肉湯', '牛筋肉、牛番茄、罐頭蕃茄糊、洋蔥、蘑菇、紅蘿蔔、芹菜、黑胡椒、鹽巴、義大利香料、水、愛心', '500、3、1、1、15、1、3～4、、、、1000、滿滿的', '148.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 0, 0, 1, '<hr><h1>1</h1><p>準備好義式牛肉湯的食材</p> <hr><h1>2</h1><p>洋蔥、紅蘿蔔、蕃茄切丁\\r\\n（別切太小、長時間燉煮會變很爛）\\r\\n\\r\\n步驟一的牛肉是從大肉塊修整下來的肉、我在把牛肉（筋）分切成適量大小（想大口吃肉就切大塊）、另外把牛油修整下來！\\r\\n</p> <hr><h1>3</h1><p>牛油冷鍋下鍋煎\\r\\n主要是要取牛油與香味！\\r\\n\\r\\n煎到油脂被逼出來後\\r\\n在取出來放在旁邊（先不要丟掉喔）</p> <hr><h1>4</h1><p>牛油取出後\\r\\n先下牛肉煎至外表無血色\\r\\n（大概1～2分鐘）\\r\\n\\r\\n在依序下芹菜與洋蔥\\r\\n入鍋拌炒、炒至洋蔥些微出水</p> <hr><h1>5</h1><p>加入紅蘿蔔拌炒\\r\\n\\r\\n我在這時候加入胡椒與香料\\r\\n其實在下一個步驟也可以再加\\r\\n看個人心情吧??</p> <hr><h1>6</h1><p>滿滿的大蘑菇\\r\\n一樣加入鍋中拌炒</p> <hr><h1>7</h1><p>加入新鮮的牛番茄丁與蕃茄糊\\r\\n\\r\\n全部都加完後再加入1000cc的開水</p> <hr><h1>8</h1><p>煮滾後計時15分鐘（先開蓋）\\r\\n\\r\\n15分鐘後轉小火並蓋上鍋蓋\\r\\n燉煮三小時！！\\r\\n\\r\\n\\r\\n鹽巴什麼時候放呢？\\r\\n因為我們家的口味都不一樣\\r\\n要喝的時候在自己添加鹽巴！\\r\\n\\r\\n\\r\\n還記得牛油嗎？\\r\\n我在這步驟會加入幾塊煎過的牛油\\r\\n這樣味道會更濃郁喔\\r\\n至於要加多少就自由發揮吧！</p> <hr><h1>9</h1><p>Do Re Mi Fa So~  (三小時開蓋\\r\\n\\r\\n相信我、你家一定充滿這鍋湯的香味\\r\\n可以與家人分享這鍋好湯囉！</p> <hr>', '克、顆、罐、顆、朵、條、支、適量、適量、適量、cc、滿滿的'),
(149, '義式檸檬紙包雞腿', '棒棒腿、鹽、水、義式香料/黑胡椒粒/蒜粉、黃檸檬、喜歡的蔬果', '6、1、300、各、1、', '149.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>用刀子在雞腿皮較少的一面切一刀、深度至骨</p> <hr><h1>2</h1><p>將雞腿放入袋中、倒入調勻的鹽水、封緊袋口後冷藏醃漬至隔天\\r\\n（我有再加入自家種的百里香及羅勒一起醃）</p> <hr><h1>3</h1><p>黃檸檬切片、蔬果切成適口大小（此次使用胡蘿蔔、玉米筍及杏鮑菇）</p> <hr><h1>4</h1><p>取一大張烘焙紙鋪在烤盤上、放上蔬果及雞腿、淋些檸檬汁、撒些義式香草、黑胡椒及蒜粉、再放上檸檬切片</p> <hr><h1>5</h1><p>用烘焙紙將全部食材包好、收口處可用釘書機釘牢、放入預熱好的烤箱中、180度烤30分鐘</p> <hr><h1>6</h1><p>打開紙包、重新放回烤箱</p> <hr><h1>7</h1><p>轉200度烤約10~15分至表面上色即可</p> <hr>', '支、大匙、cc、各適量、顆、適量'),
(150, '義大利肉醬', '絞肉、蕃茄、洋蔥、水、?、蕃茄醬、義大利香料、香蒜粉、洋蔥粉', '1、2、１、500、2、100、2、2、2', '150.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>蕃茄切十字刀、放入滾中川燙2分鐘、待蕃茄皮脫落時取出、沖冷水後將皮?除。</p> <hr><h1>2</h1><p>將去皮的蕃茄切丁。</p> <hr><h1>3</h1><p>洋蔥切丁。</p> <hr><h1>4</h1><p>油鍋將洋蔥下鍋炒軟。</p> <hr><h1>5</h1><p>待洋蔥炒出香味後、把絞肉加入拌炒。</p> <hr><h1>6</h1><p>絞肉約炒半熟時、將蕃茄丁加入。</p> <hr><h1>7</h1><p>加入500cc清水、蓋鍋大火悶5分鐘。</p> <hr><h1>8</h1><p>加入蕃茄醬。</p> <hr><h1>9</h1><p>加入其他調味料（?、香蒜粉、洋蔥粉、義大利香料）。</p> <hr><h1>10</h1><p>大火稍為收汁即可起鍋。</p> <hr><h1>11</h1><p>完成品。</p> <hr>', '斤、顆、顆、cc、匙、cc、匙、匙、匙'),
(151, '波隆那肉醬', '肉丸、豬?肉、牛絞肉、現磨黑胡椒粉、荳蔻粉或義式香料、鹽、去皮整顆番茄罐頭、高湯、水、紅葡萄酒、洋蔥、家裡用不完的義大利麵醬', '1盒約300、1盒約300、、、、1罐或2罐、400、200-400、250、1、切碎丁備用、200', '151.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>1.將牛絞肉及豬絞肉混合均勻後加入香料、黑胡椒粉及少許鹽</p> <hr><h1>2</h1><p>2.將材料充分混合。簡單的用雙手互相甩打、做成肉丸子</p> <hr><h1>3</h1><p>3.準備平底鍋將肉丸球表面煎成金黃色、有點焦也沒闖係(不需煎熟) 、肉丸子開始滲出肉汁即關火。</p> <hr><h1>4</h1><p>4.將洋蔥倒入鍋中、加入少許油(可用煎肉丸的油、但要小心勿讓油裡的浮渣流入鍋)拌炒至半透明</p> <hr><h1>5</h1><p>5.倒入250ml紅酒、小火煮至酒精揮發</p> <hr><h1>6</h1><p>6.將肉丸加入鍋中壓平</p> <hr><h1>7</h1><p>7.倒入整粒蕃茄罐頭、並將蕃茄切成塊狀(亦可用食物剪刀剪成塊狀)後加入200ml水及雞湯一起燉煮</p> <hr><h1>8</h1><p>8.加入義大利麵醬200ml 、中火煮30分鐘、待湯汁濃縮略為收乾</p> <hr><h1>9</h1><p>9.最後加入少許鹽或糖調整味道即可*</p> <hr>', 'g、g、適量、適量、少許、一罐或2罐、ml、ml、ml、顆、切碎丁備用、ml'),
(152, '義式堅果脆餅', '蛋、香草精、杏仁精、細砂糖、鹽、泡打粉、低筋麵粉、無鹽綜合堅果', '3、1、0.5、60-100、0.25、1、260、3/4', '152.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>將蛋、（香草精、杏仁精）糖、鹽拌勻</p> <hr><h1>2</h1><p>將泡打粉、麵粉篩入用刮刀拌勻成有點黏的麵團</p> <hr><h1>3</h1><p>拌入堅果</p> <hr><h1>4</h1><p>將麵團捏成一個扁平的長方形（25x10cm)（太黏可以灑點麵粉）、放在烤盤上</p> <hr><h1>5</h1><p>150℃烤30min至表面金黃、一到烤架上放涼至少十分鐘（不放涼的話切會容易散掉）</p> <hr><h1>6</h1><p>用鋸齒刀切0.5-0.7cm薄片</p> <hr><h1>7</h1><p>排列在烤盤上、150℃烤20-25分鐘至餅乾乾燥（中途可以翻個面）</p> <hr><h1>8</h1><p>冷卻、密封保存</p> <hr><h1>9</h1><p>如果喜歡、可以沾巧克力超好吃（因為餅乾本身不甜、搭配巧克力很剛好）</p> <hr><h1>10</h1><p>下午茶配咖啡～</p> <hr>', '顆大的、小匙、小匙、g、小匙、小匙、g、杯'),
(153, '義式茄汁肉丸', '豬絞肉、洋蔥、蒜頭、羅勒葉、黑胡椒、意大利香料、鹽、太白粉、牛番茄、月桂葉、黑胡椒、鹽、羅勒葉', '300、0.5、3、1、1、、1、20、2、2、1、1、2', '153.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>1.洋蔥切丁、蒜頭切末。\\r\\n\\r\\n2.一起下鍋炒至金黃。</p> <hr><h1>2</h1><p>將調味料與炒過的洋蔥、蒜頭、混合均勻至有黏性。</p> <hr><h1>3</h1><p>做成丸子狀、拿去冷凍冰5分鐘定型。</p> <hr><h1>4</h1><p>裹上麵粉下鍋油炸至金黃。</p> <hr><h1>5</h1><p>將番茄切丁、倒入果汁機、取出倒入鍋子煮、並加入調料。</p> <hr><h1>6</h1><p>肉丸倒入茄汁煮10分鐘、起鍋就完成了哦。</p> <hr><h1>7</h1><p>完成嘍！</p> <hr>', 'g、顆、瓣、匙、匙、適量、匙、g、顆、片、小匙、匙、匙');
INSERT INTO `allrec` (`ID`, `name`, `ing`, `num`, `img`, `link`, `heartattack`, `pneumonia`, `diabetes`, `Lower_respiratory_tract`, `hypertension`, `Nephritis`, `Liver`, `total`, `type`, `step`, `unit`) VALUES
(154, '青醬雞肉捲義大利麵', '百味來特濃起司羅勒義大利麵醬、雞腿肉、起司絲、百味來義大利扁麵、百味來特濃起司羅勒義大利麵醬、水、鹽、橄欖油、蒜末、洋蔥、紅黃椒、洋菇', '1、1、、250、1、2500、17、1、2、0.5、各1/4、8', '154.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>將雞腿肉上蓋置保鮮膜、拍平後拿起保鮮膜</p> <hr><h1>2</h1><p>均勻塗抹上百味來特濃起司羅勒義大利麵醬、並依個人喜好加上起司絲</p> <hr><h1>3</h1><p>捲起後包上鋁箔紙、入烤箱以200度烤10分鐘</p> <hr><h1>4</h1><p>取出後拿掉鋁箔紙、再以上火220度烤5-7分鐘、至表皮金黃</p> <hr><h1>5</h1><p>滾水加鹽後、加入百味來扁麵煮7分鐘、撈起備用</p> <hr><h1>6</h1><p>熱油鍋加入蒜末及洋蔥、炒出香味</p> <hr><h1>7</h1><p>加入洋菇、甜椒後、倒入一罐百味來特濃起司羅勒義大利麵醬</p> <hr><h1>8</h1><p>翻炒均勻後、加入煮好的百味來扁麵</p> <hr><h1>9</h1><p>將義大利麵移至盤中、加上烤好的雞肉捲、即可大快朵頤</p> <hr>', '大匙、支、適量、g、罐、g、g、大匙、瓣、顆、顆、顆'),
(155, '義式奶凍PannaCotta', '動物性鮮奶油、牛奶、糖、吉利丁、香草精', '250、250、80-100、8、0.5', '155.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 0, 1, 0, 1, '<hr><h1>1</h1><p>將鮮奶油和牛奶放入小鍋內、用中小火煮至有氣泡、然後加入糖、煮至糖溶化、加點香草精</p> <hr><h1>2</h1><p>將吉利丁粉與30毫升開水拌勻、然後放在一碗熱水內、令吉利丁溶化。將吉利丁加入鮮奶油內、拌勻</p> <hr><h1>3</h1><p>倒入容器內、待涼後放入冰箱內最少5個小時</p> <hr><h1>4</h1><p>可加入果醬和水果享用</p> <hr>', '毫升、毫升、克、克、小匙'),
(156, '義大利獵人燴雞', '雞腿、蘑菇、切片、白酒、紅酒、水、無鹽奶油塊、橄欖油、洋蔥、切絲、蕃茄醬、新鮮或乾燥羅勒、任一食用麵粉、鹽、胡椒', '2、250、300、50、150、60、3、1、150、、30、、', '156.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 0, 0, 0, 1, '<hr><h1>1</h1><p>雞腿兩面均勻塗?鹽和胡椒、橄欖油、奶油塊入鍋以小火慢烘至融化、再放入雞腿以小火慢煎至表層兩面金黃。</p> <hr><h1>2</h1><p>洋蔥、蘑菇、麵粉加入步驟1.、拌勻、再沖入白酒、清水並拌勻。</p> <hr><h1>3</h1><p>紅酒、蕃茄醬加入步驟2.拌勻、蓋上鍋蓋以小火慢燉一小時、再調入鹽、胡椒和香草即可享用。</p> <hr><h1>4</h1><p>食譜參考取自《Dr.Oetker》之「Aus italienischen Landen」P.103.《Pollo alla cacciatore》</p> <hr>', '份、g、ml、ml、ml、g、EL、顆、ml、適量、g、適量、適量'),
(157, '義式茄汁肉丸', '橄欖油、奶油、蒜末、去皮番茄、鹽、黑胡椒、牛絞肉、豬絞肉、雞蛋、洋蔥丁、帕瑪森起司粉、麵包粉、紅椒粉、黑胡椒、鹽、牛奶', '、、10、3、、、300、150、1、0.25、20、20、2、、、10', '157.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 1, 0, 1, '<hr><h1>1</h1><p>將牛豬絞肉、洋蔥、紅椒粉、麵包粉、蛋、牛奶、帕瑪森起士粉、鹽和黑胡椒一起拌勻</p> <hr><h1>2</h1><p>把肉揉到出現黏性之後、捏成圓球狀蓋上保鮮膜放入冷藏約半小時</p> <hr><h1>3</h1><p>平底炒鍋到入橄欖油和些許奶油後、放入冷藏過的肉丸煎七分熟後取出備用</p> <hr><h1>4</h1><p>用鍋底餘油炒香大蒜之後倒入去皮蕃茄、鹽和黑胡椒、煮滾後轉中小火將蕃茄塊搗碎</p> <hr><h1>5</h1><p>煎過的肉丸回鍋用中小火煮、邊煮邊將醬汁淋在肉丸上、大約五分鐘即可盛盤</p> <hr><h1>6</h1><p>最後灑上羅勒葉和帕瑪森起士粉、即可享用！</p> <hr>', '適量、適量、g、顆、適量、適量、g、g、顆、顆、g、g、茶匙、適量、適量、毫升'),
(158, '白酒蛤蜊義大利麵', '義大利麵、蛤蜊、蒜頭、辣椒、九層塔、無鹽奶油、水、白酒、鹽、黑胡椒粒', '100、300、3、1、、10、120、60、、', '158.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 1, 0, 1, '<hr><h1>1</h1><p>將蒜頭去膜切末；辣椒切末；蛤蜊以1000cc的水加入30g的鹽、吐沙1-2小時；九層塔切碎備用。</p> <hr><h1>2</h1><p>鍋內放800cc水煮沸後、加1/2茶匙鹽及油、將麵條以傘狀下鍋後用筷子略拌、避免沾黏。</p> <hr><h1>3</h1><p>中火沸騰後續煮約11分鐘、撈起放入冷水中至涼、瀝乾水分、加1小匙橄欖油拌勻備用。</p> <hr><h1>4</h1><p>鍋內放入奶油、再倒入蒜末、辣椒末用中小火爆香1分鐘、再將蛤蜊、40cc的白酒及120cc的水倒入鍋內、煮約1-2分鐘至蛤蜊全開後撈起備用。</p> <hr><h1>5</h1><p>將作法2的義大利麵放入鍋中拌炒、加入少許鹽、黑胡椒、紅辣椒末以及20cc的白酒拌炒至略收汁。</p> <hr><h1>6</h1><p>起鍋前加入九層塔末略拌、盛盤擺上蛤蜊即可。</p> <hr>', 'g、g、瓣、條、適量、g、cc、cc、少許、適量'),
(159, '巧克力餅乾美式軟餅乾', '無鹽奶油、白糖、黑糖、雞蛋、香草精、中筋麵粉、泡打粉、鹽、巧克力、巧克力豆、核桃、', '125、60、100、1、5、200、5、3、40、180、60', '159.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 1, 1, 2, '<hr><h1>1</h1><p>奶油和雞蛋先拿出來退冰</p> <hr><h1>2</h1><p>室溫奶油 以高速將奶油打發 用刮刀清個邊</p> <hr><h1>3</h1><p>過篩白糖與黑糖 加入奶油中 打致蓬鬆狀</p> <hr><h1>4</h1><p>依序加入蛋汁和香草精 混合均勻即可</p> <hr><h1>5</h1><p>將乾料（麵粉、泡打粉、鹽巴）加入剛剛打發的食材中</p> <hr><h1>6</h1><p>最後加入巧克力豆、巧克力塊 還有核桃 稍混合即可</p> <hr><h1>7</h1><p>將麵團搓成乒乓球大小 一顆約50-60g \\n放進冰箱冷藏1小時\\n*一定要將麵團用保鮮盒或保鮮膜封好、以免麵團溪冰箱得味道*</p> <hr><h1>8</h1><p>烤箱預熱180 度 風扇模式 烤12-15 分鐘\\n*麵團不用退冰、直接進烤箱*</p> <hr><h1>9</h1><p>拿出來表層放涼 就可以吃啦！</p> <hr>', 'g、g、g、顆、ml、g、g、g、g、g、g'),
(160, '八寸——美式肉桂蘋果派', '低筋麵粉、奶油、牛奶、雞蛋、蘋果、奶油、砂糖、肉桂粉、蛋液、八寸塔膜、烘焙石or綠紅豆', '210、110、、1、約400、20、70、（可加可不加）、、1、1', '160.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 1, 0, 0, 2, '<hr><h1>1</h1><p>將低粉過篩、奶油切小塊用手揉捏、揉至奶油較小塊、加入雞蛋、輕輕混合、不可過度攪拌、接著加入適量牛奶、不可過多</p> <hr><h1>2</h1><p>混合至麵團成團、保鮮膜包起來、送去冷藏。\\n（依自家冰箱、我家冷藏很冷?）</p> <hr><h1>3</h1><p>蘋果削皮去核、約400g、建議可以多一些。</p> <hr><h1>4</h1><p>鍋子加熱、奶油放入鍋內完全融化、接著蘋果全下</p> <hr><h1>5</h1><p>翻拌至蘋果微變色（變深）即加入砂糖、繼續翻拌</p> <hr><h1>6</h1><p>蘋果顏色變更深、加入肉桂粉\\n（可不加、口味依個人調整）</p> <hr><h1>7</h1><p>等到蘋果顏色變深、汁液程焦糖色、可起鍋放一旁備用。</p> <hr><h1>8</h1><p>拿出冰箱塔皮、桿平成一片、鋪上八吋塔膜、並用叉子在塔皮戳洞、烤箱200度預熱5分（依個人烤箱溫度）\\n塔皮剩下留著、做上方格狀造型</p> <hr><h1>9</h1><p>塔皮上方鋪上烘焙紙、將烘焙石放上、送入烤箱200度10分鐘</p> <hr><h1>10</h1><p>取出塔皮、倒入蘋果陷、剩下的塔皮麵團、桿平切成長條、以交疊方式排列成格狀。</p> <hr><h1>11</h1><p>塔皮刷上蛋液、出爐顏色才會金黃有光澤。</p> <hr><h1>12</h1><p>烤箱220度考15分。\\n\\n恭喜大大完成了蘋果派(???ω?? ?)\\n不知有沒有很非常成功呢？\\n\\n放涼的蘋果派、一天內無需冷藏\\n若是放冰箱、記得烤箱加熱再食用</p> <hr>', 'g、g、適量、個、g、g、g（依個人口味）、適量（可加可不加）、適量、個、份'),
(161, '美式軟餅乾', '低筋麵粉、白細砂糖、紅糖（黑糖）、無鹽奶油（室溫）、雞蛋、泡打粉、香草精、鹽、巧克力豆', '200、80、70、125、1、1、1、、依各人喜好', '161.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>照食材準備材料、糖的比例與用量可以照喜甜程度調整。（本篇以比正常甜度再略降一些、但畢竟每個人喜甜程度不一嘛～）\\n\\n黑糖比例多=做出來是厚又濕潤的餅乾\\n白糖比例多=做出扁脆的餅乾</p> <hr><h1>2</h1><p>把低筋麵粉+泡打粉+鹽均勻攪拌在一起、並且過篩。 再放置一旁備用。</p> <hr><h1>3</h1><p>室溫奶油放入大盆裡用攪拌器打到蓬鬆的感覺（約1分鐘）\\n\\n*室溫奶油較軟比較容易打。</p> <hr><h1>4</h1><p>加入白砂糖跟黑糖繼續打到呈現蓬鬆感。</p> <hr><h1>5</h1><p>加入蛋與香草精、以低速均勻混合就好。</p> <hr><h1>6</h1><p>分3次加入「步驟一」低筋麵粉、用攪拌匙攪拌至均勻。盡量不要過度攪拌以免麵團出筋</p> <hr><h1>7</h1><p>完全攪拌均勻</p> <hr><h1>8</h1><p>最後加入巧克力豆、稍微攪拌。</p> <hr><h1>9</h1><p>a. 烤盤墊上烘焙紙（之後比較容易拿起來）\\nb. 用湯匙或挖冰匙挖一球、每個麵糊間隔距離要兩倍大（約5公分左右）不然會黏在一起。\\nc. 把弄好的麵團蓋上保鮮膜封住放入冰箱冷藏至少1個小時。（參考、不一定要）</p> <hr><h1>10</h1><p>-烤箱預熱、180度C; 烤大約15分鐘。\\n-表面顏色微微焦色就可以拿出來、不然容易燒焦。\\n-拿出來靜置放涼約5～10分鐘、剛烤好餅乾會很軟、放涼後就可以定型。</p> <hr><h1>11</h1><p>泡一杯熱茶配上餅乾享用。\\n\\n沒吃完的可以放入密封罐（保鮮盒）室溫保存約6～10天</p> <hr>', 'g、g、g、g、顆、小匙、小匙、少許、依各人喜好'),
(162, '美式紅燒牛肉', '牛肉1盒、洋蔥、紅蘿蔔、白蘿蔔、薑、蔥、蒜、滷包、八角、酒、醬油、沙茶醬、豆瓣醬、水（量米杯）、蜂蜜', '2-3、1、1、1、5、3、5、1、5、0.25、120、1、1、5、2', '162.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>處理食材將肉切塊、洋蔥切絲、白蘿蔔和紅蘿蔔削皮切塊、薑切片、蒜瓣去皮、蔥洗淨</p> <hr><h1>2</h1><p>鑄鐵鍋熱鍋後加入適量的油；放進薑片爆香</p> <hr><h1>3</h1><p>加入洋蔥拌炒至軟後接著加入蒜瓣</p> <hr><h1>4</h1><p>加入牛肉拌炒直到肉變白</p> <hr><h1>5</h1><p>接著加入豆瓣醬和沙茶醬</p> <hr><h1>6</h1><p>加入蔥、酒、醬油、蜂蜜、水及滷包</p> <hr><h1>7</h1><p>最後加進八角；將食材攪拌均勻後蓋上鍋蓋用中小火煮1個小時</p> <hr><h1>8</h1><p>盛盤就完成了。</p> <hr>', '磅、顆、條、條、片、根、瓣、包、個、杯、ml、大匙、大匙、杯、大匙'),
(163, '黃金酪梨牛肉漢堡排', '酪梨、牛絞肉、番茄、紅蘿蔔、洋蔥、蘑菇、蛋、起司、鹽巴、胡椒、牛油、橄欖油', '1、2、0.5、少量、0.3、3、1、1、少量、少量、少量、', '163.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>牛絞肉加入紅蘿蔔丁、洋蔥丁並用鹽巴、胡椒調味抓醃\\n番茄少許切丁及兩片番茄片備用</p> <hr><h1>2</h1><p>鍋子加入牛油熱鍋、切蘑菇成片狀及洋蔥丁拌炒至軟(可加入麵粉或太白粉將水份吸乾)、並放入碗中備用。</p> <hr><h1>3</h1><p>將步驟1 之牛絞肉分成兩份並在雙手間互丟(or 拍打 by 可愛安安) 至有黏性 (煎的時候才不會散掉)\\n目的是將其牛絞肉之空氣丟出。\\n\\n並加入橄欖油以中小火慢煎至外表焦脆。\\n起鍋前將起司覆蓋在漢堡肉上面並蓋上鍋蓋、用餘溫融化。</p> <hr><h1>4</h1><p>酪梨切半、一半加入碗中搗碎成泥狀加入少許鹽巴及胡椒調味並鋪在盤中央。\\n另一半完整取出備用。</p> <hr><h1>5</h1><p>漢堡肉起鍋後疊在一起、將步驟2 香菇及番茄擺至肉旁、並在上層蓋上番茄片。</p> <hr><h1>6</h1><p>煎一顆蛋、下面熟了之後可以將鍋子放入烤箱用上層火烤熟一點</p> <hr><h1>7</h1><p>起鍋放至最上層、並將步驟4 另一半的酪梨放上去、並撒上胡椒裝飾就完成了。</p> <hr><h1>8</h1><p></p> <hr><h1>9</h1><p></p> <hr>', '顆、份、顆、少量、顆、朵、顆、片、少量、少量、少量、少許'),
(164, '美式烤雞翅', '兩節翅、馬鈴薯、鹽巴、番茄醬、醬油、米酒、煙燻味tabasco、黑胡椒粒、蒜末、洋蔥末', '12、1、5、10、10、10、、、1、0.25', '164.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>將翅尖去除、因為翅尖肉不多、而且去除後也比較方便食用。</p> <hr><h1>2</h1><p>將所有調味料與雞翅拌勻。冷藏至少四小時使其入味、有時間的話隔夜更好。</p> <hr><h1>3</h1><p>馬鈴薯切片、用開水瓢洗去除多餘的澱粉、用鹽巴調底味、鋪平於烤盤底部。</p> <hr><h1>4</h1><p>鋪上醃好的雞翅、盡量鋪平不要重疊、否則在底下的雞翅無法上色。剩下的醃料及洋蔥末、蒜頭末也要一起倒入、烤過後非常好吃。</p> <hr><h1>5</h1><p>蓋上錫箔紙並戳幾個洞以便透氣。\\n放進預熱好的烤箱、以220度烤70分鐘。</p> <hr><h1>6</h1><p>70分鐘後掀開錫箔紙、再烤至表皮焦黃酥脆。</p> <hr><h1>7</h1><p>表皮均勻上色也增加了香氣。</p> <hr><h1>8</h1><p>馬鈴薯吸收了湯汁、非常鬆軟、口感不輸雞翅。</p> <hr>', '支、顆、克、克、cc、cc、適量、適量、顆、顆'),
(165, '巧克力豆棉花糖餅乾', '牛奶巧克力、無鹽奶油、三溫糖、蛋、低筋麵粉、無鋁泡打粉、棉花糖、高融點巧克力豆', '100、100、45、50、160、2、50、30', '165.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>烤箱先以上下火160℃預熱。牛奶巧克力隔水加熱融化(不超過50℃)後、放涼備用。</p> <hr><h1>2</h1><p>無鹽奶油在室溫軟化後、加入三溫糖打勻。接著將蛋液分2次下、完全吸收後再加下一次。</p> <hr><h1>3</h1><p>放入過篩的低筋麵粉和無鋁泡打粉、用切拌的方式混合成團。</p> <hr><h1>4</h1><p>將棉花糖放入放涼的牛奶巧克力液拌勻、再加入麵團中混合。</p> <hr><h1>5</h1><p>最後加入巧克力豆拌勻。</p> <hr><h1>6</h1><p>麵團分為25公克/個、塑成圓扁狀、餅乾與餅乾間需留間隔。以上下火160℃烤20-25分鐘即完成。</p> <hr><h1>7</h1><p>此份量約可做16-18片餅乾。</p> <hr>', '公克、公克、公克、公克、公克、公克、公克、公克'),
(166, '生酮版花生醬餅乾', '無糖花生醬、白芝麻粉、羅漢果糖、赤藻醣醇、酪梨油', '160、160、30、20、60', '166.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>無糖花生醬、顆粒或細滑口感的都可以</p> <hr><h1>2</h1><p>粉末混合均勻。注意、本食譜使用的白芝麻粉不可以用杏仁粉替代。</p> <hr><h1>3</h1><p>加入酪梨油攪拌均勻。如果購買的白芝麻粉含油量不足、請自行以素材是否能黏著成團、斟酌增加酪梨油量、以每次10cc添加。</p> <hr><h1>4</h1><p>稱重、每顆重50-55克</p> <hr><h1>5</h1><p>烤盤鋪上烘培紙、麵團揉成球狀、用平底器具稍微壓扁</p> <hr><h1>6</h1><p>再用叉子按壓表面做出花紋</p> <hr><h1>7</h1><p>150度烤箱預熱、烤30分鐘。小烤箱請調溫按鈕至180度。</p> <hr><h1>8</h1><p>完成</p> <hr><h1>9</h1><p>放涼後再拿取餅乾、否則易碎。</p> <hr>', '克、克、克、克、ml'),
(167, '水牛城辣雞翅', '3節雞翅、檸檬、鹽、黑胡椒粉、紅椒粉、優質橄欖油、蒜頭、優質橄欖油、無鹽奶油、Tabasco 辣醬、市售辣椒醬（像蕃茄醬那種）、市售美式烤肉醬（可有可無）、蔬果白醋、鹽、棕櫚糖或二砂、黑胡椒粉', '10、0.5、1、、1、、4、、5、、4、1、2、0.5、2、', '167.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>雞翅洗淨瀝乾、蒜頭切末；\\n市售辣椒醬是像蕃茄醬那種喔～</p> <hr><h1>2</h1><p>三節翅切成二節翅和小雞腿；</p> <hr><h1>3</h1><p>在二節翅和小雞腿背部劃刀、幫助醃漬入味和熟成；</p> <hr><h1>4</h1><p>用醃料將雞翅和小雞腿抓醃後靜置15分鐘。</p> <hr><h1>5</h1><p>醃漬時先煮辣醬；小鍋中倒入優質鮮榨橄欖油、</p> <hr><h1>6</h1><p>放入蒜末與無鹽奶油炒香；</p> <hr><h1>7</h1><p>加入其它調味料拌勻煮滾、請記得試味道調整出自己喜歡的酸辣度喔～</p> <hr><h1>8</h1><p>平底鍋放入比炒菜再多一點的優質鮮榨橄欖油、小火將油燒熱；</p> <hr><h1>9</h1><p>雞翅正面朝下小火先煎上色；</p> <hr><h1>10</h1><p>翻面再續煎到另一面也都上色、約10幾分鐘就都熟了。</p> <hr><h1>11</h1><p>小雞腿也同樣的煎上色和煎熟；</p> <hr><h1>12</h1><p>起鍋瀝油；並將醬汁再次煮滾；</p> <hr><h1>13</h1><p>取一大鍋放入所有煎好的雞翅、倒入辣醬、均勻拌勻、即可。</p> <hr><h1>14</h1><p>擺盤後放上檸檬、在上頭撒點檸檬皮增香去膩；倒上小酒、請享用。</p> <hr>', '組、顆、茶匙、少許、茶匙、少許、瓣、適量、g、適量、湯匙、湯匙、湯匙、茶匙、茶匙、少許'),
(168, '美式烤豬肋排', '豬肋排、塔巴斯科辣椒醬、匈牙利紅椒粉、黑胡椒粉、白糖、鹽巴、番茄醬、蜂蜜、芥末、沙拉油、烏醋、醬油、蒜泥', '850、1、1、0.5、1、1、3、2、1、2、1、1、2', '168.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p></p> <hr><h1>2</h1><p>所有的材料全部放一起、讓豬肋排均勻沾上調料、放冰箱冷藏6小時以上</p> <hr><h1>3</h1><p>拿出醃製好的豬肋排、用鋁箔紙包著、成信封??形狀放烤箱進行烘烤\\n\\n烤箱溫度（全程旋風模式）\\n烤箱預熱溫度160/160</p> <hr><h1>4</h1><p>160/160 120分鐘後拿出、把鋁箔紙的肉汁倒出來、豬肋排均勻地刷上前面醃製剩下的醬料、這時候不需要再包鋁箔紙、繼續放進200/200 30分鐘烤箱.時間一到、拿出來、再刷一次前面倒出來的醬汁的油脂部分（烤肉汁上面會有一層油）繼續放進去烤箱溫度為230/230 烤20分鐘、時間到即可裝盤上桌.</p> <hr><h1>5</h1><p>用簡單的萵苣包著肉就很好吃啦</p> <hr>', '克、大匙、大匙、小匙、大匙、小匙、大匙、大匙、小匙、大匙、小匙、小匙、瓣'),
(169, '蕃茄起司烤布樂Cobbler', '牛蕃茄、大蒜片、百里香、起司粉或碎起司、橄欖油或食用油、蜂蜜、鹽和黑胡椒、麵粉、起司粉或碎起司、義式綜合香料、泡打粉、鹽、雞蛋、融化的奶油', '2~3、2、1、1、1、1、、50、1、1、0.25、1/8、1、20', '169.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>下層蕃茄內餡：\\n?烤箱預熱200度\\n?蕃茄切小塊、大蒜切片、和百里香一起放入烤盤、用鹽和黑胡椒調味、淋上橄欖油混合均勻。</p> <hr><h1>2</h1><p>撒上起司粉或任何你喜歡的起司</p> <hr><h1>3</h1><p>用預熱到200度的烤箱烤15分鐘。</p> <hr><h1>4</h1><p>烤蕃茄的時後來做上層酥餅：\\n取小碗混合雞蛋以外所有材料</p> <hr><h1>5</h1><p>中間挖一個洞加入打散的蛋液、融化的奶油（留一點點進爐前刷表面）、混合成不太黏手的麵團。\\n（因為蛋的大小不一、請視實際狀況調整液體份量、太濕就多加點麵粉、太乾就加點水或牛奶、總之讓他能成團就行）</p> <hr><h1>6</h1><p>用模具或刀子切成薄餅狀（薄一點口感比較好）、當然用手捏成小碎團、像麵疙撘那樣也是可以的～</p> <hr><h1>7</h1><p>鋪在出爐的蕃茄上、刷上剛剛剩下的融化奶油。</p> <hr><h1>8</h1><p>200度的烤箱再烤15~20分鐘左右或直到麵團熟透。</p> <hr><h1>9</h1><p>成品圖～</p> <hr>', '顆、瓣份、小匙、大匙、大匙、大匙、適量、g、大匙、小匙、小匙、小匙、顆、g'),
(170, '藍莓瑪芬蛋糕', '低筋麵粉、無鋁泡打粉、蛋、細砂糖、沙拉醬、水、冷凍野生藍莓', '110、0.5、1、50、40、50、40', '170.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 0, 0, 2, '<hr><h1>1</h1><p>盆中打入蛋、加入細砂糖拌勻</p> <hr><h1>2</h1><p>加入沙拉醬及水、拌勻後再篩入低粉及泡打粉拌勻</p> <hr><h1>3</h1><p>再加入約3/4的藍莓拌勻</p> <hr><h1>4</h1><p>將油紙杯放入杯模中、再裝入麵糊約6~7分滿、表面放上剩下的藍莓</p> <hr><h1>5</h1><p>放入預熱好的烤箱中、180度烤約25分鐘</p> <hr><h1>6</h1><p></p> <hr>', 'g、小匙多一些、個、g、g、cc、g'),
(171, '美式香濃奶油司康', '中筋麵粉、糖、泡打粉、鹽、有鹽奶油、無糖鮮奶油（未打發）、香草精（可略）、糖粉、無糖鮮奶油（抹麵團用）', '250、50、2、0.25、113、0.5、0.25、、', '171.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 2, '<hr><h1>1</h1><p>將麵粉、糖、泡打粉跟鹽加到大碗公內攪拌均勻。</p> <hr><h1>2</h1><p>將奶油融化、加入大碗公。\\n\\n技術夠好的話、建議直接用冰奶油來捏麵糰、因為越冰的奶油、比較不會與麵粉「結合」、所以可以保持濕度避免過乾。我目前練到用室溫奶油做...</p> <hr><h1>3</h1><p>將鮮奶油和香草精攪拌均勻、倒入大碗公。鮮奶油加太多也會讓司康變硬。</p> <hr><h1>4</h1><p>用攪拌棒翻、變成一團一團的碎狀麵團。注意。。。是用翻的不是用攪的！用攪的會過度筋化。。。過度筋化烤的時候就會變又乾又硬喔。</p> <hr><h1>5</h1><p>將碎麵團取出放在鋪有麵粉軟墊上、慢慢的、輕輕的翻折壓扁。重複進行大約十次、不要過度揉捏、因為要避免筋化。將麵團塑形成一寸厚、直徑六寸的麵團、靜置20分鐘讓麵團休息。\\n\\n要能考出外酥內軟的關鍵在於不能過度揉捏麵糰、還讓麵團保有一點鬆鬆的、一團一團的感覺。</p> <hr><h1>6</h1><p>將麵糰切八塊、放在鋪好烤紙的烤盤上（或像我ㄧ樣用矽膠墊）、麵團之間要有兩寸的間隔。輕輕塗上無糖鮮奶油並灑上糖粉。\\n\\n烤箱遇熱到375度Ｆ（190度Ｃ）烤15分鐘左右、直到司康的邊界變金黃色。不要烤太久、不然會乾掉不好吃。</p> <hr><h1>7</h1><p>上桌、趁熱吃！</p> <hr>', 'g、g、tsp、tsp、g、cup、tsp、少許、少許'),
(172, '超好吃漢堡排！', '牛絞肉、豬絞肉、洋蔥、麵包粉、牛奶、鹽、黑胡椒、蘑：、洋蔥碎、水、清酒、日式伍斯特醬、番茄醬、糖：、奶油、太白粉水', '250、100、0.5、2、3、1、、4、0.5、3、2、3、1、2、15、', '172.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>將整顆洋蔥切成碎末、煎鍋內下油並倒入一半的洋蔥碎、炒至洋蔥縮水並呈現核黃色後起鍋放涼</p> <hr><h1>2</h1><p>將牛絞肉、豬絞肉放進圓碗內、倒入剛炒好的洋蔥、麵包粉、牛奶、鹽和黑胡椒混合均勻、分成三等份</p> <hr><h1>3</h1><p>在手上抹上油並將絞肉整成丸子狀、接著從一手投到另一手、摔打排出裡頭空氣、並整成肉餅狀（摔的次數和力道要練習一下、約十數次、次數太多漢堡排會過於扎實、太少易散）</p> <hr><h1>4</h1><p>整理好的漢堡排如圖、這裏有一個很重要的步驟、由於漢堡排下鍋後會膨脹、為了避免裂開、請在漢堡排中心用拇指壓出一個坑洞、煎的過程中它會慢慢的澎起、最後變成漂亮的圓形喔！</p> <hr><h1>5</h1><p>起油鍋、將漢堡排下鍋兩面煎香</p> <hr><h1>6</h1><p>當兩面上色後蓋上鍋蓋（可加入少許的水）、以半蒸煎的方式轉小火慢慢蒸熟、過程約十分鐘</p> <hr><h1>7</h1><p>判斷是否熟透有一個簡單的方式、將筷子插入中心最厚的地方、若流出的肉汁是透明褐色就是熟囉！若是帶粉紅色就還沒熟（看看圖中流出的大量肉汁！）</p> <hr><h1>8</h1><p>起鍋擺盤就完成囉！（醬汁做法請參考網誌^^）</p> <hr>', 'g、g、顆、大匙、大匙、小匙、少許、顆、顆、匙、匙、匙、大匙、小匙、g、適量'),
(173, '水牛城炸雞', '雞翅、小棒腿、低筋麵粉、紅椒粉、甜辣醬、奶油、細砂糖、鹽巴、紅椒粉、黑胡椒', '、、、100、50、、、、', '173.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>將低筋麵粉與紅椒粉放入碗中混合均勻備用。</p> <hr><h1>2</h1><p>將雞肉表面裹上薄薄的一層粉。</p> <hr><h1>3</h1><p>取鍋將油加熱、雞肉炸的時間因大小、溫度略有差異、原則上大概15分鐘上下、表面焦黃、香味提出即可取出。</p> <hr><h1>4</h1><p>將炸好的雞肉放在烤架上靜置、準備醬汁。</p> <hr><h1>5</h1><p>喜歡甜一點的可以用甜辣醬、辣一點的建議辣椒醬。辣椒醬與奶油的比例2:1、搭配胡椒、鹽巴、糖等做調味、煮至奶油融化即可。</p> <hr><h1>6</h1><p>本食譜的醬料配方約可沾6-8支小腿。</p> <hr><h1>7</h1><p>將雞肉放置碗中、倒入醬料翻拌、完整沾滿雞翅即完成。</p> <hr>', '適量、少許、少許、g、g、少許、少許、少許、少許'),
(174, '超濕潤美式巧克力蛋糕-免磅秤', '中筋麵粉、無糖可可粉、糖、無鋁泡打粉、小蘇打粉、鹽、大顆的蛋、植物油、牛奶、白醋或檸檬汁、熱的黑咖啡、香草精、黑巧克力塊、鮮奶油、糖、莓果、中筋麵粉、無糖可可粉、糖、無鋁泡打粉、小蘇打粉、鹽、大顆蛋、植物油、牛奶、醋或檸檬汁、熱咖啡、香草精', '1又3/4、1、1又1/2、3、1、1/5、2、0.5、210、30、1、2、100、3/4、1、0.5、225、130、150、15、5、1、2、107、210、30、240、10', '174.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 2, '<hr><h1>1</h1><p>材料都準備好時、烤箱開始預熱175度C、因為這蛋糕很簡單、面糊很快就會做好。\\n\\n註:為方便讀者、材料欄同時提供量杯食譜及磅秤食譜。請依照所需、選取一個製作蛋糕體。</p> <hr><h1>2</h1><p>先將所有粉類、麵粉、糖、可可粉、泡打粉、蘇打粉、鹽在盆中混合均勻、確認無小結塊。泡打粉及蘇打粉如有結塊、加入前需用手指壓成粉狀、或用篩子過篩。\\n\\n註:如果要做給小孩吃、可可粉加3/4杯即可。</p> <hr><h1>3</h1><p>把白醋與牛奶混合。</p> <hr><h1>4</h1><p>把油、蛋、香草先打勻。在粉類中間挖一井、加入打好的油蛋液。</p> <hr><h1>5</h1><p>加入酸牛奶。</p> <hr><h1>6</h1><p>用攪拌器把酸奶與油蛋液體混合再與粉類一起攪拌均勻、糖粒沒完全溶解沒關係、等一下加入熱咖啡很快就會溶化。</p> <hr><h1>7</h1><p>最後加入滾燙的咖啡、用攪拌器打勻。\\n\\n註:如果蛋糕是給小孩吃、可將黑咖啡以一杯熱開水代替。黑咖啡可以用無糖無奶精咖啡粉泡、或用咖啡機煮。</p> <hr><h1>8</h1><p>麵糊變得很稀、這是正常的、別擔心。</p> <hr><h1>9</h1><p>將拌好的麵糊放入墊了烤盤紙的9X13烤盤中、175度烤30-35分。因為這個蛋糕很軟且易碎、如果不用烤盤紙、則需仔細的在烤盤上抹油及撒上可可粉。\\n註:此處使用9X13烤模、因為麵糊水份很多、烤模太小則麵糊高度變厚、中心容易不膨發。如果烤箱小或沒這麼大的烤模、可將份量減半。烤箱夠大也可分盤同時烤。</p> <hr><h1>10</h1><p>用筷子叉入中心檢查、如有生麵糊沾黏、再加烤幾分鐘。烤好之後移出烤箱、如果沒有要做霜飾、可以直接熱熱的切來吃、超級Q軟濕潤。\\n如果想做霜飾、冷卻十分鐘後再連烤盤紙一起移到架上散熱。冷卻後剝除烤盤紙、倒扣到盤上做裝飾。\\n用你喜歡的任何霜飾抹在蛋糕上。可用鮮奶油、巧克力甘那許、奶油糖霜等等。</p> <hr><h1>11</h1><p>製做巧克力捲裝飾:\\n將黑巧克力塊剝成你要的寬度、微波20秒稍微軟化、這樣刨時才不易斷裂破碎、但不可融化。如果太軟、則稍等一下讓它凝固再刨。用削皮刀沿表面刨下巧克力、它會自然捲曲。\\n如果你使用牛奶巧克力、因為它比較軟、不需微波。</p> <hr><h1>12</h1><p>鮮奶油加糖打發、塗在蛋糕表面、再放上巧克力捲及莓果裝飾。\\n因為巧克力蛋糕已經很甜、鮮奶油的糖可以省略。</p> <hr><h1>13</h1><p>Hersheys的原配方:\\nhttps://www.hersheys.com/kitchens/en_us/recipes/hersheys-perfectly-chocolate-chocolate-cake.html\\n裡面有瑪芬模、中空模、圓形蛋糕模等、不同烤模的烘焙時間。</p> <hr>', '杯、杯、杯、茶匙、茶匙、茶匙、顆、杯、ml、ml、杯、茶匙、公克、杯、大匙、杯、公克、公克、公克、公克、公克、公克、顆、公克、公克、公克、公克、公克'),
(175, '紐約起司蛋糕', '消化餅、奶油、奶油起司、原味優格、細砂糖、檸檬、蛋', '45、15、125、25、30、1、1', '175.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 1, 0, 0, 2, '<hr><h1>1</h1><p>所有食材。</p> <hr><h1>2</h1><p>將消化餅裝夾鏈袋碾碎、倒出後加入已融化奶油拌勻。接著鋪於模具底部扎實的壓平、厚度盡可能一樣高、放一邊備用、接著削檸檬皮屑備用。</p> <hr><h1>3</h1><p>把奶油起司、優格、蛋、糖、倒入盒中用攪拌器打勻至無顆粒、最後放入檸檬皮屑拌勻即可。</p> <hr><h1>4</h1><p>倒入模具中、並將麵糊裡的空氣震出。</p> <hr><h1>5</h1><p>烤至蛋糕凝固、晃動無水狀就可。</p> <hr><h1>6</h1><p>好吃的紐約起司蛋糕完成、下午茶的好選擇！</p> <hr>', 'g、g、g、g、g、個、個'),
(176, '美式漢堡手打漢堡排', '牛絞肉、海鹽1匙、黑胡椒2匙', '800、約2、依喜好', '176.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>捏成等量大小（約100g上下）</p> <hr><h1>2</h1><p>取一深碗、將捏好的肉球以雙手拍打+摔出筋性</p> <hr><h1>3</h1><p>肉質好只需灑上?巴胡椒調味即可、少許油熱鍋兩面煎上色後轉小火 100g大小的漢堡排大約煎3-5分鐘熟成 （?? 記得絞肉一定要全熟喔??）</p> <hr><h1>4</h1><p>一次做好放冷凍、做成漢堡當早餐或是搭配小孩最愛的咖哩都很合適喔\\r\\n</p> <hr><h1>5</h1><p>搭配手做麵包 超過癮搭\\r\\n?麵包基底可參考：\\r\\nhttps://icook.tw/recipes/105413</p> <hr>', 'g、克、依喜好'),
(177, '水牛城辣雞', '小雞腿、蒜泥、黑胡椒、鹽巴、紅椒粉、白酒醋、奶油、美式辣椒醬、蕃茄醬、ANKOMN 無耗電真空保鮮盒、OXO好好握矽膠餐夾', '10、10、2、2、20、15、60、70、40、1、1', '177.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>將小雞腿、蒜泥、黑胡椒、鹽巴、匈牙利紅椒粉、白酒醋全部拌勻後抽真空、利用真空保鮮盒讓醃製效果更好。</p> <hr><h1>2</h1><p>醃製1小時後將小雞腿放到烤盤上、200度C烤30分鐘（依每台烤箱火力可能有所不同）。</p> <hr><h1>3</h1><p>等待烤箱期間剛好可以做醬汁、將奶油加熱至溶化、再與美式辣椒醬、番茄醬全部拌勻即可。\\r\\n＊此篇食譜使用較少的配方調製醬汁、可依個人口味再加入蒜粉、洋蔥粉、黑胡椒、鹽、檸檬汁...等、風味都不一樣喔。</p> <hr><h1>4</h1><p>小雞腿烤好後搭配醬汁食用～</p> <hr>', '隻、克、克、克、克、毫升、克、克、克、個、個'),
(178, '超簡單美式酸黃瓜', '小黃瓜、水、白醋、糖、鹽、蒔蘿子', '3、700、295、15、15、15', '178.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 1, 2, '<hr><h1>1</h1><p>小黃瓜切片</p> <hr><h1>2</h1><p>將水煮開後放下白醋、糖、鹽及蒔蘿子、煮約兩分鐘即可</p> <hr><h1>3</h1><p>等水放涼後再放入切好的小黃瓜到玻璃罐裡就完成囉。</p> <hr>', '條、ml、ml、g、g、g'),
(179, '比美式餐廳還好吃', '豬肋排、蒙特婁牛排粉、BBQ醬、紅椒粉', '5-8、2、10、1', '179.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 1, 2, '<hr><h1>1</h1><p>豬肋排表層切紋路、幫助入味。</p> <hr><h1>2</h1><p>先在桌上鋪好2層鋁箔紙（我怕1層不夠厚會被豬骨頭戳破）、把豬肋排放在鋁箔紙上面再開始調味、豬肋排二面撒上蒙特婁牛排粉、紅椒粉（適量就好、不用太多怕太鹹）、用手直接幫肋排按摩、把調味料按進去、肋排二面都要淋上BBQ醬（適量就好）、抹均勻。抹好後的樣子可參考照片。</p> <hr><h1>3</h1><p>用的調味料就是這三種。</p> <hr><h1>4</h1><p>冷藏：用鋁箔紙把豬肋排包好包滿、肉多的那面朝上（進烤箱的時候就是要把肉多的那面朝上再烤）、外層用塑膠袋包起來再進冰箱冷藏（至少醃2-3天）。\\n\\n要烤的時候：取出整包豬肋排（當然不用把鋁箔紙撕開）放在室溫回溫約1小時、烤箱先預熱、整包豬肋排進烤箱160度C / 烤3小時。</p> <hr><h1>5</h1><p>取出烤好的肋排、將上層的鋁箔紙剪開、取走、讓肋排上層肉多的那面整面都露出來、不要被鋁箔紙蓋到、因為要再塗醬幫肋排上色、淋上BBQ醬（份量可以比醃肉的時候多一些、大約0.5量米杯）、再烤10-20分鐘（160度C ）、每5分鐘開烤箱看一下肋排的上色程度、注意不要烤焦了、顏色滿意就取出烤箱。</p> <hr><h1>6</h1><p>※烤好的肋排會流出一些肉汁、千萬不要浪費、另外取一個小碗來裝這些肉汁、再加BBQ醬、大約是1比1的份量、用湯匙拌勻這碗醬汁備用。\\n\\n將烤好的肋排裝盤、我故意把剛剛在烤箱內朝上（肉多的那面）肋排朝盤底放、就是將肋排上下翻轉了一面、肉少的那面變成朝上了、再把剛才※調好的醬汁淋在（肉少的那面）肋排上。</p> <hr><h1>7</h1><p>豬肋排一切就斷、超入味、肉好嫩又多汁！</p> <hr>', '根、大匙、大匙、大匙'),
(180, '古巴三明治', '軟法麵包、洋蔥、蕃茄、小黃瓜、酸黃瓜、培根肉、起司片、黃芥末漿、桂冠拉醬小條裝、蜂蜜、奶油', '1、0.25、0.5、0.5、、4、2、、0.5、、', '180.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 0, 0, 2, '<hr><h1>1</h1><p>酸黃瓜 小黃瓜 洋蔥 番茄 全部洗淨切片</p> <hr><h1>2</h1><p>培根煎熟備用\\n沙拉醬芥末醬蜂蜜拌勻備用</p> <hr><h1>3</h1><p>將所有材料夾入麵包裡面\\n接下來的步驟很重要\\n平底鍋抹上些許奶油 將已經夾好料的整顆麵包放上去中火慢慢煎 一邊煎一邊用平鍋鏟把麵包往下壓 然後翻面換另外一邊 也是一樣一邊煎一邊用鏟子將麵包往下壓。 要注意不要煎太久以免焦掉 這樣就大功告成了!!</p> <hr>', '條、顆、顆、條、適量、片、片、適量、條、少許、少許'),
(181, '美式巧克豆餅乾', '無鹽奶油、砂糖／冰糖（質地需如砂糖）、紅糖、雞蛋、低筋麵粉、小蘇打粉、鹽、巧克力豆、香草精', '56、20、15、0.5、95、0.25、0.25、（依個人喜好）、數滴（我加 5 滴）', '181.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>準備所需的材料</p> <hr><h1>2</h1><p>我用的是 Hersheys 的苦甜巧克力豆</p> <hr><h1>3</h1><p>先將烤箱預熱（約 10 分鐘）至上下火皆 170 °C\\n將奶油放入可微波的玻璃碗後以中高火加熱 40 秒使其稍微融化</p> <hr><h1>4</h1><p>用打蛋器以畫圓的方式將奶油完全融化</p> <hr><h1>5</h1><p>接著加入砂／冰糖和淺／暗紅糖、也以畫圓的方式快速將糖油攪拌至稍微出現濃稠感</p> <hr><h1>6</h1><p>加入雞蛋、拌勻即可</p> <hr><h1>7</h1><p>將低筋麵粉過篩、倒入拌好的糖油蛋糊中</p> <hr><h1>8</h1><p>用刮刀以壓拌的方式（麵粉較不易出筋）把麵粉和糖油蛋糊拌勻\\n</p> <hr><h1>9</h1><p>拌好後的餅乾團比麵團還濕、可是絕對不黏手或碗\\n</p> <hr><h1>10</h1><p>接著倒入巧克力豆、和勻即可\\n</p> <hr><h1>11</h1><p>將每個餅乾麵團平分成適量大小、搓圓、擺上烤盤（每個之間留適當間距、因為餅乾在烘烤時會因奶油融化而擴散）</p> <hr><h1>12</h1><p>烤 9—11 分鐘至餅乾蓬鬆、表面呈現乾燥狀、且稍微上色即可\\n</p> <hr><h1>13</h1><p>餅乾外層鬆脆、撥開卻濕潤無比、中間口感類似蛋糕的質地\\n想吃之前再放入微波以中高火加熱約 15 秒就能品嘗到新鮮出爐的好滋味</p> <hr><h1>14</h1><p>保存方式：將放涼的餅乾放入密封罐中、常溫三天都能保有濕潤的口感。冷凍也可、要吃之前用烤箱加熱一下就很美味囉！\\n</p> <hr>', 'g、g、g、個、g、茶匙、茶匙、適量（依個人喜好）、數滴（我加 5 滴）'),
(182, '美式巧克力軟餅乾', '杏仁粉、椰子粉、小蘇打粉、鹽、香草莢、蛋、奶油、赤藻糖醇、100%鈕扣巧克力', '150、3、0.5、0.5、1/3、1、30、60、', '182.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>預熱烤箱約175°C</p> <hr><h1>2</h1><p>先混和杏仁粉、椰子粉、小蘇打粉、鹽</p> <hr><h1>3</h1><p>在另一個大碗中用攪拌器混合奶油、赤藻糖醇、蛋跟香草籽直到均勻\\n(奶油隔水加熱成液狀較好混合)</p> <hr><h1>4</h1><p>將粉狀混和物(步驟2)加入大碗中直到攪拌均勻</p> <hr><h1>5</h1><p>加入鈕扣巧克力用手拌勻</p> <hr><h1>6</h1><p>以約1~2大匙份量的麵團壓平入烤箱</p> <hr><h1>7</h1><p>烤約12~15分鐘直到表面呈現微焦黃色即完成</p> <hr>', 'g、大匙、茶匙、茶匙、條、顆、g、g、適量'),
(183, '水牛城辣雞翅', '雞二節翅、地瓜粉、大蒜粉、黑胡椒、白胡椒、鹽、紅椒粉、泰國是拉差辣醬、奶油、蜂蜜、檸檬汁、洋蔥末、Tabasco', '20、2、1、1、1、2/1、1、大量、30、2、0.5、8/1、（可調整）', '183.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 1, 2, '<hr><h1>1</h1><p>食材準備好後、將雞翅裝入碗或塑膠袋中\\n倒入食材頁面所打的調味料比例開始拌勻</p> <hr><h1>2</h1><p>調味料拌勻後、靜置約10分鐘\\n烤箱先調200度預熱準備</p> <hr><h1>3</h1><p>烤箱熱後雞翅放入烤20分鐘</p> <hr><h1>4</h1><p>準備辣醬汁材料、洋蔥切成末預備</p> <hr><h1>5</h1><p>將平底鍋預熱加入奶油、融化後再加泰國是拉差辣醬、蜂蜜、檸檬汁、洋蔥末、小火攪拌煮至稠狀關火預備\\n（愛吃辣的朋友可加入適量Tabasco調味）</p> <hr><h1>6</h1><p>將烤好雞翅取出放入辣醬中、開小火小心拌炒、盡量讓每支雞翅都能吸收辣醬\\n</p> <hr><h1>7</h1><p>辣醬煮至收乾後、起鍋擺盤即完成</p> <hr>', '支、大匙、大匙、匙、匙、匙、大匙（可調整）、大量、克、大匙、顆、顆、適量（可調整）'),
(184, '美式鬆厚披薩餅皮', '水、鹽、糖、酵母、高筋麵粉、低筋麵粉、橄欖油、美乃滋、水', '130、2、10、6、160、40、1、、10', '184.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 2, '<hr><h1>1</h1><p>室溫水、鹽、糖、酵母通通倒進大盆裡</p> <hr><h1>2</h1><p>高筋麵粉160g、低筋麵粉40g分次過篩進大盆裡</p> <hr><h1>3</h1><p>先用道具攪攪攪</p> <hr><h1>4</h1><p>加入一大匙橄欖油（慢慢一點點不要太爽一次倒全部你會後悔不要怪我沒說）</p> <hr><h1>5</h1><p>繼續攪攪攪、看差不多換用手揉一揉（覺得很黏就加點橄欖油、繼續變回史萊姆觸感）</p> <hr><h1>6</h1><p>揉到光滑後、包保鮮膜讓他睡個40分鐘</p> <hr><h1>7</h1><p>桿成想要的形狀、手粉可以先烤過、最後披薩吃起來味道是欺騙自己的石窯味</p> <hr><h1>8</h1><p>製作美乃滋醬、美乃滋＋水不要太稀就好了</p> <hr><h1>9</h1><p>放自己想吃的料、多放一點對自己好一點、還有起司不要忘記</p> <hr><h1>10</h1><p>220度烤10分鐘、每台烤箱不一樣、不要跑去看韓劇忘記操未搭</p> <hr>', 'ml、g、g、g、g、g、大匙、適量、ml'),
(185, '水牛城雞翅', '二節翅、紅椒粉、香蒜粒、鹽、黑胡椒、白酒、麵粉、奶油、蒜末、Tabasco、蕃茄醬、蜂蜜、黑胡椒粗粒、白酒', '12、1、1、1、1、1、40、40、1、2、2、1、1、1', '185.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>將雞翅放入一大型密封袋(或密封盒)、倒入醃料中除了麵粉以外的所有材料。</p> <hr><h1>2</h1><p>將密封袋封口、拿起來搖晃混合均勻、醃約半小時。</p> <hr><h1>3</h1><p>放入麵粉後、一樣將密封袋封口、拿起來搖晃混合均勻。</p> <hr><h1>4</h1><p>放入烤箱以180℃烤半小時。</p> <hr><h1>5</h1><p>將辣醬中的奶油放入鍋中加熱融化、再放入辣醬中其它所有的材料、混合均勻。</p> <hr><h1>6</h1><p>將烤好的雞翅均勻地沾裹辣醬即完成。</p> <hr>', '個、大匙、大匙、小匙、小匙、大匙、公克、公克、小匙、大匙、大匙、小匙、小匙、小匙'),
(186, '美式蔓越梅餅乾', '無鹽奶油、細砂糖、全蛋（室溫）、低筋麵粉、泡打粉、鹽巴、蔓越梅乾（依個人口味增減）', '130、50、1、200、2、1、60～80', '186.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>1）將軟化的無鹽奶油加入細砂糖及鹽巴、打發至微白的乳霜質地</p> <hr><h1>2</h1><p>2）將蛋液分兩次拌至奶油完全吸收</p> <hr><h1>3</h1><p>3）將過篩後的低筋麵粉及泡打粉分兩次以切拌的方式加入拌勻</p> <hr><h1>4</h1><p>4）將蔓越梅乾加入拌勻（不要太過攪拌）\\n5）烤盤鋪上烘焙紙、用湯匙挖等量、壓平塑形（需間距1cm）</p> <hr><h1>5</h1><p>6）烤箱180/160預熱10分鐘、烤15至20分鐘即可！（視烤箱溫度做調整）</p> <hr>', 'g、g、顆、g、g、g、g'),
(187, '碳烤豬肋排+美式BBQ烤肉醬', '洋蔥末、蒜片、黑糖、白醋、牛排醬、醬油、番茄醬、糖、迷迭香', '1、2-3、4、4、4、4、200、2、2', '187.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 2, '<hr><h1>1</h1><p>豬肋排用壓力鍋煮熟(也可用電鍋蒸、內鍋放水肋排放進去煮、外鍋約2杯水)。平底鍋熱鍋、放入煮好的豬肋排、兩面煎到金黃。</p> <hr><h1>2</h1><p>(煮肋排時、來弄烤肉醬)\\n洋蔥末炒到金黃、加一點鹽和黑胡椒、倒入蒜片、迷迭香、四大匙黑糖、略為炒一下、倒入白醋、煮個2分鐘讓醋味蒸發、接著倒入醬油、A1牛排醬和番茄醬、煮個2分鐘、撈起迷迭香、將烤肉醬倒進調理機打細末、完成!</p> <hr><h1>3</h1><p>倒入BBQ醬、如果太黏稠可以加一點豬肋排水、煮一下就好了!</p> <hr>', '顆、片、大匙、大匙、大匙、大匙、CC、大匙、小串'),
(188, '重乳酪條', 'cream cheese、細砂糖、雞蛋（小）、動物性鮮奶油', '375、60、3、25', '188.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>動物性鮮奶油先打至可以畫出紋路、先放置冰箱冷藏備用。</p> <hr><h1>2</h1><p>室溫軟化的Cream Cheese 先打柔順、加入細砂糖打至無糖顆粒。</p> <hr><h1>3</h1><p>分次加入蛋打勻、一顆完全融合後再加入另一顆。</p> <hr><h1>4</h1><p>加入打發的動物性鮮奶油、用切拌方式混合。</p> <hr><h1>5</h1><p>倒入模具中、輕震模具將空氣震出。放在裝有冷水的深烤盤中（水約1/3）、送入預熱好的烤箱。</p> <hr><h1>6</h1><p>第一階段： 200/130 度 30mins 。 第二階段：130/130 度 20-30mins。第三階段：悶5mins。中間如覺得上色過重、可用鋁箔紙遮蓋。如蛋糕有裂開傾向、中間可再加入冷水。</p> <hr>', 'g、g、顆、ml'),
(189, '美式烤肋排', '豬肋排、美式烤肉醬、鹽、蒜粉、黑胡椒粒、百里香葉', '4、200、、、、', '189.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>將肋排洗淨用紙巾擦乾、依序抹上鹽巴、黑胡椒粒、蒜粉、百里香、記得不要先抹美式烤肉醬、然後放入冰箱冷藏約6小時再拿出</p> <hr><h1>2</h1><p>將鋁箔紙把肋排上下左右都包好、放入烤箱、上下溫度用120～150烤2.5小時、拿出把肉汁倒掉</p> <hr><h1>3</h1><p>將烤盤鋪上鋁箔紙、肋排放上刷烤肉醬、兩面刷均勻、放入烤箱、上下溫度為200～250、烤到有點焦焦的感覺、再拿出刷上烤肉醬就可以大快朵頤一番</p> <hr>', '大塊、cc、適量、適量、適量、適量'),
(190, '紐奧良烤雞翅', '雞翅、蒜末、匈牙利紅椒粉、黑胡椒、番茄醬、Tobasco、糖、鹽巴、蒜末、匈牙利紅椒粉、黑胡椒粒、鹽巴、Tobasco、番茄醬、糖', '6、6、、、4、、3、1、6、、、1、、4、3', '190.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 2, '<hr><h1>1</h1><p> \\n醃製好後進烤箱 上下火 200 十分鐘（記得預熱十分鐘 ）\\n出烤箱、熱鍋炒醬汁雞翅入鍋拌炒上色完、最近烤箱烤五分鐘。\\n即可上菜。\\n</p> <hr>', '隻、顆、適量、適量、大茶匙、適量、茶匙、茶匙、顆、適量、適量、茶匙、適量、大茶匙、茶匙'),
(191, '美式巧克力豆軟餅乾', '無鹽奶油、黑糖、砂糖、中筋麵粉、雞蛋、蘇打粉、鹽、香草精、烘培用黑巧克力豆', '110、100、90、200、1、4、6、1、200', '191.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 0, 1, 0, 2, '<hr><h1>1</h1><p>奶油放到室溫軟化、用攪拌器攪打至顏色稍微泛白的絨毛狀\\r\\n(大概要一兩分鐘)\\r\\n\\r\\n</p> <hr><h1>2</h1><p> 加入香草精、砂糖與黑糖、繼續攪打約一分鐘、讓奶油鬆散輕盈\\r\\n\\r\\n</p> <hr><h1>3</h1><p>加入雞蛋、打勻</p> <hr><h1>4</h1><p>加入巧克力豆、拌勻</p> <hr><h1>5</h1><p>所有粉類過篩、倒入麵糊中\\r\\n</p> <hr><h1>6</h1><p>混合均勻、餅乾麵糰就完成了</p> <hr><h1>7</h1><p>用挖冰淇淋勺、一次一杓很方便</p> <hr><h1>8</h1><p>鋪上烤盤紙或烤盤墊、餅乾麵糊之間距離要兩倍大(不然會通通黏成一片)\\r\\n\\r\\n烤箱預熱：180*C/360*F\\r\\n烤12~15分鐘、端看你的餅乾有多大片\\r\\n(烤盤墊比較厚我放烤箱下層、中間再交換、最後五分鐘最好是盯著看、餅乾顏色一變深就趕快拿出來、不然超容易烤焦)</p> <hr><h1>9</h1><p>看看烤之前跟之後、是不是要保持距離？我第一次烤就是變成一大片、跟烤盤一樣大、我老公都以為自己到了天堂呢。(白眼)</p> <hr><h1>10</h1><p>剛烤好的時候很軟、先不要動它、五到十分鐘定型之後再移到架上放涼\\r\\n\\r\\n</p> <hr><h1>11</h1><p>吃習慣了、這種餅乾其實還蠻好吃的、奶油香氣、軟柔甜蜜、還有巧克力咬感、跟牛奶真的很搭。</p> <hr><h1>12</h1><p>吃不完的餅乾放密封容器室溫保存、可以放一週到十天(在我家當然是留不了這麼久)、也可以一次做一大碗麵糊、要吃多少烤多少、剩下的麵糊密封保存放冰庫、可以擺一個月沒問題、要用之前再退冰就好。\\r\\n\\r\\n</p> <hr>', 'g、g、g、g、顆、g、g、茶匙、g'),
(192, '美式巧克力豆餅乾', '低筋麵粉、細砂糖、可可粉、無鹽奶油、鹽、水滴型巧克力、雞蛋', '170、40、5、80、0.25、100、1', '192.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>奶油在室溫下放到軟 (用手指輕壓可以留下壓痕)、低筋麵粉過篩、細砂糖、鹽、可可粉先均勻混合 </p> <hr><h1>2</h1><p>無鹽奶油用自動打蛋器打成乳霜狀、加入混合均勻的糖粉用低速打發、打發的奶油會呈微泛白蓬鬆狀、全程約 1-2 分鐘 (自動)、手動約 3-4 分鐘！</p> <hr><h1>3</h1><p>將蛋液分 3-4 次加入打發的奶油中、用打蛋器混合均勻、切記不要一次倒入太多、以免造成油水分離失敗喔！</p> <hr><h1>4</h1><p>加入蛋液混合均勻後、整體感覺如圖</p> <hr><h1>5</h1><p>分 2 次加入過篩低筋麵粉、用刮刀以按壓的方式、由下往上將麵粉混合均勻、切記不要過度攪拌、以免麵團產生筋性( 導致餅乾變脆)\\r\\n\\r\\n混合好的感覺如圖、可以拿起搓成團、因為在製作過程可能比列會有誤差、如果麵團過濕 (則麵粉增量) 、過乾 (則麵粉減量)、大家可以斟酌</p> <hr><h1>6</h1><p>加入水滴型巧克力、均勻混合</p> <hr><h1>7</h1><p>烤箱以 170 度上下火預熱、將攪拌好的麵團捏小塊搓揉成圓球狀、間格放入烤盤中以手掌心按壓、厚度大約在 0.5 公分、即可放入烤箱中烘烤囉~</p> <hr><h1>8</h1><p>以 170 度烘烤約 15 分鐘、喜歡吃中間軟芯的可以縮短烘烤時間、喜歡吃酥脆一點則可增加烘烤時間、烤完出爐後放涼、即可收入密封罐中保存~</p> <hr><h1>9</h1><p>香噴噴的餅乾、配上一杯鮮甜的鮮奶茶、一起享受美味的下午茶吧 :)</p> <hr>', 'g、g、g、g、茶匙、g、顆'),
(193, '美式巧克力軟餅乾', '70%苦甜巧克力、無鹽奶油、砂糖、高筋麵粉、巧克力粉、泡打粉、全蛋、巧克力豆、核桃', '220、30、110、45、1、0.5、2、、', '193.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 0, 1, 2, '<hr><h1>1</h1><p>黑巧克力和無鹽奶油加熱融化\\n（90%都融化就可以離火了、加熱太久會油水分離</p> <hr><h1>2</h1><p>把泡打粉、高筋麵粉、巧克力粉混合均勻</p> <hr><h1>3</h1><p>全蛋和細砂糖打到發泡\\n（很綿密的那種）</p> <hr><h1>4</h1><p>加入調溫好的巧克力\\n（要降溫到可以用手摸才能加哦！）\\n烤箱預熱180度</p> <hr><h1>5</h1><p>加入粉類材料\\n巧克力豆核桃也可以加了\\n（不用攪太用力 會消泡）</p> <hr><h1>6</h1><p>入模????\\n（入模前我有再拿到冰箱放一陣子）\\n烤箱180度烤10～15分鐘</p> <hr>', 'g、g、g、g、匙、匙、顆、適量、適量'),
(194, '楓糖可頌美式Brunch', '鑫鑫腸、培根、楓糖可頌、蛋、起司片、水果、馬鈴薯玉米濃湯、洋蔥、杏鮑菇、馬鈴薯、玉米粒、奶粉、熱水', '0.5、1、8、4、1、奇異果.芒果.蕃茄、、0.5、5、2、1、3、1200', '194.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>馬鈴薯炒一下.起鍋.備用 杏鮑菇炒一下.起鍋.備用 (如果鍋子有點髒.加水.邊煮邊清乾淨.把水倒掉) 炒洋蔥到透明.熄火.鍋裡放3大湯瓢奶粉.加熱水.攪拌均勻.再開火 倒入馬鈴薯.杏鮑菇.煮熟(約15分鐘)(這步驟很重要.沒煮熟.打出來的濃湯會有澀味) 玉米粒是最後加.我覺得這樣比較甜</p> <hr><h1>2</h1><p>玉米粒攪拌均勻後.關火.用調理棒打成濃湯.我會把杏鮑菇挑出一些 </p> <hr><h1>3</h1><p>我喜歡有點顆粒</p> <hr><h1>4</h1><p>把杏鮑菇倒回鍋裡.滾一下.加些許鹽調味.下手輕一點.太鹹會不好喝.若有似無的鹹味即可</p> <hr><h1>5</h1><p>鑫鑫腸加水.蒸20分鐘</p> <hr><h1>6</h1><p>煎一下上色.用剪刀剪開</p> <hr><h1>7</h1><p>培根乾煎.留幾片剪小.煎酥</p> <hr><h1>8</h1><p>四顆蛋加一大匙水.少許鹽.拌勻</p> <hr><h1>9</h1><p>鍋熱.倒油.蛋液入鍋.一直拌.趁蛋液還沒全凝固.將起司片掰小.加入.拌一下.發現變稠之後.關火.繼續拌到起司全融</p> <hr><h1>10</h1><p>先擺楓糖可頌</p> <hr><h1>11</h1><p>芒果.奇異果.蕃茄都切丁.擺進杯子裡.慢慢疊.??彩虹水果杯</p> <hr><h1>12</h1><p>蛋小心地擺個圓.撒蔥花</p> <hr><h1>13</h1><p>鑫鑫腸疊個塔</p> <hr><h1>14</h1><p>培根交錯疊放.磨點黑胡椒</p> <hr><h1>15</h1><p>裝一杯馬鈴薯玉米濃湯.上面妝點煎酥的培根碎.手邊還剩下一些蔥花.也撒上~哇!吃完有點飽??</p> <hr>', '盒、包、個、顆、片、奇異果.芒果.蕃茄、適量、顆.切丁、朵.切小塊、顆.切丁、罐、大湯瓢、ml'),
(195, '美式可可豆杏仁酥', '純植物奶油、黑糖粉（先過篩）、低筋麵粉、鈕扣苦甜巧克力（切碎）、杏仁片', '160、70、290、60、30', '195.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>植物奶油放室溫軟化後、攪拌成奶霜狀</p> <hr><h1>2</h1><p>篩入黑糖粉、攪拌至混合</p> <hr><h1>3</h1><p>篩入低筋麵粉至奶油攪拌均勻</p> <hr><h1>4</h1><p>再加入巧克力丁及杏仁片、混入麵團中拌勻</p> <hr><h1>5</h1><p></p> <hr><h1>6</h1><p>以冰淇淋杓挖取適當份量至烤盤上</p> <hr><h1>7</h1><p>再用叉子壓平麵團</p> <hr><h1>8</h1><p>放入預熱過的烤箱以180度C烤約15~20分鐘（微焦色即可）</p> <hr>', 'g、g、g、g、g'),
(196, '水牛城辣雞翅', '雞中翅、麵粉、鹽、黑胡椒、奶油、tabasco、蒜末、黑胡椒、蜂蜜', '15、、、、100、200、、、10', '196.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>將麵粉、鹽、黑胡椒裝在塑膠袋中均勻混合</p> <hr><h1>2</h1><p>將雞翅分批放入塑膠袋均勻裹上麵粉</p> <hr><h1>3</h1><p>將裹好粉的雞翅放在烤盤上靜置10分鐘、放入烤箱前可以再灑一些麵粉、\\n烤箱預熱200度、將雞翅放入烤箱中約烤15分鐘</p> <hr><h1>4</h1><p>熱鍋放入奶油、tabasco、蒜末、黑胡椒、煮至奶油融化、再加入蜂蜜\\n</p> <hr><h1>5</h1><p>將煮好的醬汁淋在雞翅上、再進烤箱烤10分鐘</p> <hr><h1>6</h1><p>烤好後排盤就可以享用美味的雞翅囉</p> <hr>', '隻、適量、少許、少許、g、g、適量、適量、g'),
(197, '簡單炸薯條', '馬鈴薯、鹽、胡椒粉、橄欖油', '2、、、', '197.png', 'https://icook.tw/recipes/', 1, 1, 0, 0, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>1.將馬鈴薯去皮切條狀、泡水約五分鐘去除澱粉、瀝乾、\\n2.起油鍋放入鍋轉小火、均勻翻動</p> <hr><h1>2</h1><p>至金黃色撈起瀝乾油、灑入鹽和胡椒粉即完成</p> <hr>', '顆、少許、少許、適量'),
(198, '紐奧良烤雞翅', '雞翅棒腿、檸檬、蕃茄醬、香蒜粒（或蒜末）、粗粒黑胡椒、Tabasco辣椒水、匈牙利紅椒粉、迷迭香、橄欖油、鹽、洋香菜葉', '9、0.5、2、、、、（多1些）、、1、（視情況）、', '198.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>雞翅（棒腿）洗淨、可用刀將較厚處稍微劃開、醃肉時比較容易入味。</p> <hr><h1>2</h1><p>將雞翅放入袋中、加入2大匙蕃茄醬、香蒜粒、粗粒黑胡椒、匈牙利紅椒粉（不太有辣感、所以放多一些、上色更美）、迷迭香、橄欖油1小匙、鹽適量。（以上未寫量者可依個人喜好）用手於袋外搓揉2分鐘以上、將雞翅與醬料混合均勻並幫助入味。</p> <hr><h1>3</h1><p>倒出雞翅和醬料於耐酸容器中、加入半個檸檬擠出的檸檬汁、用手抓勻。之後以保鮮膜封口、醃製一夜。</p> <hr><h1>4</h1><p>醃製完成後、取出雞翅、撥去醃料、平放在烤盤上、雞翅底下鋪一層鋁箔紙（大張些）。此時烤箱先以200度預熱。</p> <hr><h1>5</h1><p>將四周鋁箔紙往上翻、蓋住雞翅、如果發現鋁箔紙不夠大張、可以另外再撕一張鋁箔紙蓋於其上。（盡量讓雞翅處於密封狀態、等一會兒要用悶烤的方式）</p> <hr><h1>6</h1><p>雞翅送入烤箱、先以200度烤約12分鐘後取出。</p> <hr><h1>7</h1><p>取出雞翅後、打開鋁箔紙、裡面會有一些雞汁、可以取一些出來放在碗裡、加入多一些匈牙利紅椒粉、攪拌均勻、用食物刷沾取醬料、刷在雞翅上、讓它上色更漂亮、並平均淋上約1小匙tabasco辣椒水（不用太多）。之後直接送進烤箱（不用包鋁箔紙、因為要烤上色）、一樣用200度烤約12分鐘、悶2分鐘之後即可取出享用。</p> <hr><h1>8</h1><p>灑上洋香菜葉看起來更美味。</p> <hr>', '小隻、個、大匙、適量、適量、少許、適量（多一些）、適量、小匙、適量（視情況）、適量'),
(199, '紐奧良辣雞翅', '三節翅、新鮮巴西利、墨西哥香料粉、蕃茄醬、Tabasco紅椒汁、蒜蓉、果醋、橄欖油、鹽、糖', '10、、1、4、1、1、1、1、0.25、1', '199.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 1, 0, 2, '<hr><h1>1</h1><p>醬料材料混合均勻、加入雞翅於醬料中稍加按摩、置於冰箱冷藏醃漬ㄧ晚。</p> <hr><h1>2</h1><p>將醃好的雞翅放至烤盤中、烤箱200度預熱後烘烤10分鐘。</p> <hr><h1>3</h1><p>取出步驟2刷上剩餘醬料、續烘烤10分鐘。</p> <hr><h1>4</h1><p>取出後撒上巴西利、擠上檸檬汁（材料外）即可享用。</p> <hr><h1>5</h1><p>喜歡肉感的朋友也可以改用二節翅喔！</p> <hr>', '支、少許、大匙、大匙、大匙、大匙、茶匙、大匙、小匙、茶匙'),
(200, '嫩美式炒蛋', '蛋、鮮奶、奶油、黑胡椒、羅勒葉粉', '2、0.5、1、、', '200.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>蛋兩顆加上鮮奶、打散備用</p> <hr><h1>2</h1><p>1.熱鍋、放入無鹽奶油\\n2.蛋液倒入後先不去攪拌\\n3.蛋液半凝固後、慢慢炒蛋\\n4.蛋炒至喜歡的軟硬度後即可熄火</p> <hr><h1>3</h1><p>撒上些許黑胡椒及羅勒香料、就完成囉！</p> <hr>', '顆、杯、小塊、少許、少許'),
(201, '美式杯子蛋糕', '鐵塔牌發酵無鹽奶油、細砂糖、食鹽、常溫中型雞蛋、無鋁泡打粉、低筋麵粉、鮮奶、鐵塔牌動物性鮮奶油、細砂糖、裝飾糖銀珠、彩色砂糖（糖花）、冬之戀甜甜圈巧克力', '110、80、2、2、1、170、150、200、20、、、12', '201.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>先製作杯子蛋糕體\\r\\n \\r\\n烤箱先預熱上下火180度\\r\\n鐵塔牌發酵無鹽奶油先置於室溫軟化、加入細砂糖用電動打蛋器打發至奶油顏色偏淡色蓬鬆乳霜狀</p> <hr><h1>2</h1><p>雞蛋打散之後、分次加入攪拌均勻</p> <hr><h1>3</h1><p>過篩的低筋麵粉和泡打粉加入、與鮮奶可以分次交叉加入攪拌</p> <hr><h1>4</h1><p>到此步驟就完成基本的原味杯子蛋糕麵糊\\r\\n</p> <hr><h1>5</h1><p>依序平均倒入原先準備好的杯子蛋糕模、用湯匙將麵糊加入約烤模8-9分滿即可</p> <hr><h1>6</h1><p>稍微敲一下烤模、送進烤箱中層上下火180度烤20-25分鐘（依照個人烤箱烤溫狀況而定）</p> <hr><h1>7</h1><p>出爐之後、將杯子蛋糕取出待涼備用</p> <hr><h1>8</h1><p>使用鐵塔牌動物性鮮奶油和細砂糖直接用電動打蛋器打發</p> <hr><h1>9</h1><p>打發的程度倒鮮奶油不易流動的狀態（大約8－９分發）</p> <hr><h1>10</h1><p>將打發的鮮奶油裝進擠花袋內、使用圓形擠花嘴、再冷卻的杯子蛋糕表面裝飾成一顆一顆珍珠狀</p> <hr><h1>11</h1><p>最後放置喜愛的造型巧克力和撒些銀珠和糖花做裝飾\\r\\n</p> <hr><h1>12</h1><p>就像珍珠珠寶盒般、微微閃閃發光</p> <hr>', 'g、g、g、顆、小匙、g、ml、g、g、適量、適量、枚'),
(202, '美式醃烤豬肋排佐蘋果燒烤醬', '豬肋排、鹽、砂糖、紅椒粉、巴西里、迷佚香、百里香、奧力岡、醬油露、蕃茄醬、蘋果、柳橙、洋蔥、蒜頭、青椒、紅椒、黃椒、馬鈴薯、青花菜、剩餘的醃製醬汁、月桂葉', '6、1、4、4、1、1、1、1、1、３、2、1、1、4、１、１、１、１、１、1、1', '202.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>食材大集合1-醃料。</p> <hr><h1>2</h1><p>食材大集合2-豬肋排。</p> <hr><h1>3</h1><p>將豬肋排一根一根切開(亦可不切開、視擺盤需求)。</p> <hr><h1>4</h1><p>製作乾式醃料：將調味料(鹽、砂糖)及調味香料(紅椒粉、巴西里、迷佚香、百里香、奧力岡)混合均勻。</p> <hr><h1>5</h1><p>製作醃醬１：將蘋果及柳橙切片後打成果泥。</p> <hr><h1>6</h1><p>製作醃醬2：將蒜頭切末、洋?切丁後、加入醬油露、蕃茄醬、蘋果果泥、柳橙果泥。</p> <hr><h1>7</h1><p>製作醃醬3：拌合均勻。</p> <hr><h1>8</h1><p>將乾式醃料塗抹至豬肋排。</p> <hr><h1>9</h1><p>再倒入醃醬。</p> <hr><h1>10</h1><p>使豬肋排完全覆蓋於醃醬下。</p> <hr><h1>11</h1><p>封包鮮膜後放冰箱冷藏、隔天再烤。</p> <hr><h1>12</h1><p>將烤箱預熱上下火皆250度C、並開啟烤箱迴風。\\n於烤盤上舖好錫箔紙、再擺上醃好的豬肋排。</p> <hr><h1>13</h1><p>蓋上另一張錫箔紙、放入烤箱、烤第一個30分鐘。</p> <hr><h1>14</h1><p>此時可先切蔬菜、將青椒、紅椒、黃椒、馬鈴薯、青花菜切成１口大小。馬?薯可泡水以免褐化。</p> <hr><h1>15</h1><p>水滾後加1小匙鹽、川燙青花菜２分鐘起鍋放涼備用。</p> <hr><h1>16</h1><p>製作蘋果燒烤醬：將醃過豬肋排剩餘的醃製醬汁加入月桂葉(可去除殘留的肉腥味)、以小火熬煮約15分鐘至濃稠。之後每隔30分以蘋果燒烤醬塗抹至豬肋排、重覆2次。</p> <hr><h1>17</h1><p>以蘋果燒烤醬塗抹至豬肋排、蓋上錫箔紙、烤第２個30分鐘。</p> <hr><h1>18</h1><p>將蔬菜放入烤盤、以蘋果燒烤醬塗抹至豬肋排、蓋上錫箔紙、烤第3個30分鐘。</p> <hr><h1>19</h1><p>挑肉最厚的地方、用筷子測試、若能輕鬆穿刺過去就就是熟了；若沒熟、則先將蔬菜拿起來、再繼續將豬肋排烤到熟。</p> <hr><h1>20<h1><p>美式醃烤豬肋排成品。</p> <hr>', '根、小匙、大匙、大匙、大匙、大匙、大匙、大匙、大匙、大匙、顆、顆、顆、顆、顆、顆、顆、顆、顆、份、片'),
(203, 'Pancake美式鬆餅早午餐', '鬆餅粉、牛奶、雞蛋、奶油、砂糖、草莓、蜂蜜', '1、4/1、2、、、幾顆、', '203.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 2, '<hr><h1>1</h1><p>準備好材料</p> <hr><h1>2</h1><p>將麵粉牛奶雞蛋在鐵盆攪勻、不要太濕、可以加鬆餅粉調整、加少許糖</p> <hr><h1>3</h1><p>熱鍋、煎的時侯可以微微抬高平底鍋讓鬆餅圓圓的、約煎到小氣泡出現再翻、約五六片、最後疊好裝飾即可</p> <hr>', '碗、碗、顆、少許、少許、幾顆、少許'),
(204, '美式鬆餅', '全蛋、砂糖、融化的無鹽奶油、牛奶、低筋麵粉、泡打粉', '1、2、2、130、200、1', '204.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 1, 0, 2, '<hr><h1>1</h1><p>將全蛋和砂糖拌勻</p> <hr><h1>2</h1><p>再加入牛奶和融化的無鹽奶油攪拌均勻</p> <hr><h1>3</h1><p>麵粉過篩、加入泡打粉、和前面的材料一起攪拌至無結粒後、靜置20分鐘。</p> <hr><h1>4</h1><p>使用不沾黏的平底鍋用小火預熱、將麵糊置入平底鍋煎、當麵糊膨脹出現小孔後、翻面再煎約一分鐘、便可起鍋。</p> <hr>', '顆、大匙(30CC)、大匙(30CC)、ML、ML、小匙(5CC)'),
(205, '水牛城雞翼BuffaloWings', '雞中翼、麵粉、冰水、牛油、墨西哥辣椒粉、辣椒仔、茄汁、蒜蓉、鹽、糖、?汁、沙律醬、芥末、蜂蜜、檸檬汁、胡椒粉', '6、、、1、1、2、2、1、2、1、1、2 、2 、1、1、1', '205.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 1, 1, 0, 2, '<hr><h1>1</h1><p>雞中翼解凍洗淨抹乾備用\\n\\n</p> <hr><h1>2</h1><p>調味料全部拌勻</p> <hr><h1>3</h1><p>把雞中翼加入調味料拌勻、最少醃2小時、最好醃過夜\\n</p> <hr><h1>4</h1><p>把醃好的雞中翼拿出來、 先沾第一層麵粉、調味料留用\\n</p> <hr><h1>5</h1><p>把沾好麵粉的雞中賢拿出來、先浸一浸冰水、再重新沾第二次麵粉 \\n（這個步驟會令雞中翼有脆皮的！）\\n</p> <hr><h1>6</h1><p>鍋中加入油、燒至插入木筷子起泡泡、就可以把雞中翼加入\\n</p> <hr><h1>7</h1><p>小火把雞中翼炸至金黃色、大概8-10分鐘、撈起備用\\n\\n</p> <hr><h1>8</h1><p>之前留用的調味料下小鍋、加上牛油煮溶、淋上炸好的雞翼拌勻即可\\n</p> <hr>', '隻、適量、適量、小片、大匙、大匙、大匙、小匙、大匙、小匙、大匙、大匙、小匙、大匙、大匙、小匙'),
(206, '紐奧良風味烤翅腿', '雞翅腿、水、番茄醬、蜂蜜、辣椒粉、鹽、匈牙利紅椒粉、黑胡椒粒、蒜粉', '6、1、2、1、0.5、0.5、0.25、0.25、0.25', '206.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>將水及所有調味料拌勻成醃料</p> <hr><h1>2</h1><p>將翅腿放入密封盒中、均勻抹上醃料後、蓋上盒子醃至少2小時</p> <hr><h1>3</h1><p>將醃好的翅腿連同醃料、排放在鋪好鋁箔紙的烤盤上</p> <hr><h1>4</h1><p>放入預熱好的烤箱中、以180度烤15~20分鐘至熟</p> <hr>', '支、大匙、小匙、小匙、小匙、小匙'),
(207, '香煎薯塊', '馬鈴薯、橄欖油、鹽、胡椒、奶油（可無）', '1、、、', '207.png', 'https://icook.tw/recipes/', 1, 1, 0, 0, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>將馬鈴薯切塊。\\r\\n放入「冷水鍋」中、撒入一大把鹽。\\r\\n中火上蓋、煮10分鐘。</p> <hr><h1>2</h1><p>＊先檢查馬鈴薯有沒有熟（可以用小刀插入薯塊中、如果會自動滑～下來就表示熟摟）\\r\\n橄欖油熱鍋、將薯塊放入鍋中煎至上色。</p> <hr><h1>3</h1><p>大致焦脆後就可以起鍋摟～\\r\\n（起鍋前也可以切一塊奶油、在鍋中滑一滑、裹上薯塊、會更香噢！）</p> <hr><h1>4</h1><p>將薯塊撒上鹽、胡椒、或是綜合香料、就完成啦！\\r\\n有時間的話、可以順便炒個歐姆蛋、煎兩片牛小排、炒點洋菇、美式大早餐總是愈豐盛愈好。</p> <hr>', '顆、適量、適量、適量'),
(208, '美式鬆餅', '低筋麵粉、泡打粉、細砂糖、牛奶、奶油、蛋', '80、1、15、80、15、1', '208.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>將奶油和細砂糖隔水加熱至溶化、加入蛋、牛奶、低筋麵粉、泡打粉拌勻</p> <hr><h1>2</h1><p>把麵糊倒入模具中煎、煎至上面冒很多泡泡</p> <hr><h1>3</h1><p>翻面煎至金黃色即可</p> <hr>', 'g、小匙、g、g、g、顆'),
(209, '美式鬆餅', '鮮奶、蛋、鬆餅粉、喜愛的水果、蜂蜜', '45、1、1、、', '209.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>1.打入雞蛋加鮮奶、先打散。\\r\\n</p> <hr><h1>2</h1><p>2.再加鬆餅粉攪拌均勻至沒有粉的顆粒。\\r\\n</p> <hr><h1>3</h1><p>3.平底鍋用紙巾擦一層薄油、開小火熱鍋後、用大湯匙每個舀一湯匙下鍋\\r\\n  (使其自然由上往下滴入鍋中、不要搖動鍋具、這樣就可煎出漂亮的圓)。\\r\\n</p> <hr><h1>4</h1><p>4.待麵糊起大量的泡泡時(底部呈金黃色)即可翻面、煎至雙面金黃色即可。\\r\\n</p> <hr><h1>5</h1><p>5.起鍋放在腳架上待涼、逐一完成每一片。（此份量可做直徑約8-8.5cm 8-10片）\\r\\n</p> <hr><h1>6</h1><p>6.擺盤、放上自己喜愛的水果(本次用橙蜜香與牛奶蕃茄)、再淋上蜂蜜即完成。\\r\\n</p> <hr>', 'cc、顆、米杯、適量、適量'),
(210, '特濃美式軟曲奇', '中筋麵粉、可可粉、梳打粉、奶油（室溫放軟）、白砂糖、黃糖、鹽、雲呢拿香精、雞蛋、苦甜巧克力', '160、25、0.25、130、30、100、0.5、1、1、180', '210.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>準備工作\\r\\n奶油室溫下放軟\\r\\n巧克力切成粒狀（不要太碎）</p> <hr><h1>2</h1><p>奶油加入白砂糖和黃糖打發</p> <hr><h1>3</h1><p>奶油和糖打至蓬鬆後加入雞蛋\\r\\n打至均勻即可\\r\\n切忌過於打發</p> <hr><h1>4</h1><p>先將中筋麵粉、可可粉、梳打粉拌勻</p> <hr><h1>5</h1><p>過篩至奶油中 \\r\\n再加入鹽和雲呢拿香精\\r\\n拌勻成麵團\\r\\n切忌過份攪拌</p> <hr><h1>6</h1><p>將切碎的巧克力加入麵團拌勻</p> <hr><h1>7</h1><p>用匙羹或雪糕挖 \\r\\n挖成一個個小圓球\\r\\n麵團之間需要留有空位\\r\\n因為它們會發大</p> <hr><h1>8</h1><p>預熱焗爐至175度\\r\\n烤大概10分鐘\\r\\n出爐的時候曲奇很軟\\r\\n有點像未熟的樣子\\r\\n但放涼後就會成為軟曲奇</p> <hr>', 'g、g、tsp、g、g、g、tsp、tsp、隻、g'),
(211, '豐盛早午餐自己來！超簡單柔軟滑嫩美式炒蛋', '蛋、鮮奶油、鹽巴、黑胡椒', '4、30、、', '211.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>把蛋液攪拌均勻、不用太均勻可以讓口感更有層次</p> <hr><h1>2</h1><p>將蛋液倒入預熱的平底鍋中先靜置加熱</p> <hr><h1>3</h1><p>底部有點凝固就開始將鍋鏟由外向內推</p> <hr><h1>4</h1><p>重複一樣的動作、繼續向中間集中</p> <hr><h1>5</h1><p>將將、美式炒蛋開始成形了、可依個人喜好熟度決定加熱程度、我喜歡表面有一點點滑嫩的口感大概8分熟起鍋</p> <hr><h1>6</h1><p>在盛盤時小心翼翼輕輕將蛋移至盤中就能保持炒蛋的美麗、撒一點鹽、黑胡椒或義香料就大功告成囉~</p> <hr>', '顆、ml、少許、少許'),
(212, '美式美式經典布朗尼', '巧克力、無鹽奶油、常溫蛋、白砂糖、蜂蜜OR楓糖、低筋麵粉、香草精、無糖可可粉、蘭姆酒', '150、130、3、80、50、70、1、15、15', '212.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 2, '<hr><h1>1</h1><p>量好烘培紙放進烤盤裡</p> <hr><h1>2</h1><p>把巧克力+奶油隔水加熱\\n可可粉和麵粉混合過過篩\\n\\n蛋和糖攪拌再依序加入以變溫的巧克力 蜂蜜 香草精及蘭姆酒\\n最後再加可可麵粉拌勻即可</p> <hr><h1>3</h1><p>可以自己加一些核桃堅果再表面\\n還有把巧克力(B)放在表面 用竹籤畫過\\n讓空氣排出\\n\\n</p> <hr><h1>4</h1><p>再以180度預熱10分鐘\\n放入中層\\n烤個22～25分鐘即可\\n用竹籤插入 如果不沾黏麵糊 代表熟了喔</p> <hr>', 'g、g、顆、g、g、g、匙、g、g、g'),
(213, '小烤箱做棉花糖美式軟餅乾', '無鹽奶油、細砂糖、黑糖、全蛋、牛奶、香草精、中筋麵粉、鹽、小蘇打粉、巧克力豆', '120、15、70、1、15、1、180、0.5、1、75', '213.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>融化奶油。</p> <hr><h1>2</h1><p>加細砂糖、黑糖拌勻。</p> <hr><h1>3</h1><p>加蛋拌勻。</p> <hr><h1>4</h1><p>加牛奶、香草精拌勻。</p> <hr><h1>5</h1><p>加中筋麵粉、小蘇打粉、鹽拌勻。</p> <hr><h1>6</h1><p>最後加入巧克力豆拌勻、冷藏30分鐘讓麵糰變硬。</p> <hr><h1>7</h1><p>麵團分15g/each、壓扁、放上一塊棉花糖、再蓋上一個麵糰、壓緊包起來。</p> <hr><h1>8</h1><p>小烤箱烤8-10分鐘就完成啦。</p> <hr>', 'g、g、g、顆、g、小匙、g、小匙、小匙、g'),
(214, '美式早餐奶油溫泉蛋馬鈴薯泥', '馬鈴薯、牛奶、奶油、雞蛋、鹽、黑胡椒', '1、50、1、2、、', '214.png', 'https://icook.tw/recipes/', 0, 1, 0, 0, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>水煮開了、加入馬鈴薯煮透（手掌大、大概煮30分鐘）\\r\\n</p> <hr><h1>2</h1><p>把馬鈴薯壓成蓉、加入奶油跟牛奶拌勻（記得要還熱的時候拌、不然奶油不能溶化）</p> <hr><h1>3</h1><p>加入鹽跟黑胡椒、也可以按喜好加入喜歡的香料</p> <hr><h1>4</h1><p>馬鈴薯泥放在容器上壓平、打上雞蛋、用保鮮紙蓋上、蒸5-7分鐘（看容器的受熱程度）</p> <hr><h1>5</h1><p>最後灑上一點鹽跟香草裝飾、配上新鮮烤的法國麵包以及蔬菜、美味又好看的早餐就完成囉！\\xa0</p> <hr>', '個、cc、湯匙、個、適量、適量'),
(215, '美式漢堡', '絞肉、洋蔥丁、雞蛋、麵包粉或低筋麵粉、牛奶、鹽、黑胡椒、味增、洋蔥絲、蕃茄片、生菜或其他蔬菜、起司片', '300、0.25、1、30g、50、2、、5、數根、2、、1', '215.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>將所有材料放入調理盆中抓捏均勻（用手不斷抓捏至少2分鐘）。將絞肉分成4~6份、用雙手整捏成圓形、然後在雙手間用力丟來丟去至少五次</p> <hr><h1>2</h1><p>中小火熱油鍋、將漢堡肉放入鍋中、壓平成想要的大小 （可放入蔬菜煎一起煎）</p> <hr><h1>3</h1><p>煎至有點出油、底部有點褐色、即可翻面續煎至熟</p> <hr><h1>4</h1><p>將麵包切開、放上洋蔥、起司、熱騰騰的漢堡、蕃茄、蔬菜（亦可先塗上芥末醬或番茄醬再開始堆疊的工作）</p> <hr><h1>5</h1><p>蓋上另一片麵包、即完成一份可口的自家製美式漢堡了！</p> <hr><h1>6</h1><p>歡樂漢堡套餐、開動！</p> <hr>', 'g、顆、顆、g、g、g、少許、g、數根、片、隨意、片'),
(216, '美式酸甜雞', '雞胸肉、太白粉、鹽、黑胡椒粉、蛋、植物油、黑醋、醬油、糖、蕃茄醬、大蒜、彩椒', '1、0.5、1、1、2、約200、1、二、0.25、0.5、1、1', '216.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 0, 0, 2, '<hr><h1>1</h1><p>雞胸肉切塊放進碗裡(不要太溼)、加入黑胡椒、鹽、太白粉、然後把碗裡的料抓一抓混合好(太白粉應該還能保持粉狀、不能糊掉)。  把蛋打好。 油鍋熱好(沒把握可以先開小火)。</p> <hr><h1>2</h1><p>把裹好粉的雞肉塊、用夾子放進蛋汁裡面、使其均勻裹上蛋汁之後、立刻放進熱好油的平底鍋裡炸。(裹蛋汁的動作用夾子應該很容易、放進去換個面就好)  直到所有的雞肉塊都丟下去為止。 通通下鍋之後、就可以把火開到中火讓油慢慢熱到足夠的溫度。</p> <hr><h1>3</h1><p>怎麼樣叫夠熱？ 目視雞塊的顏色變深就可以、這個時候關火把炸好的雞塊通通拿起來。 熱油鍋建議就放在爐子上讓他涼、不然熱油很難處理。</p> <hr><h1>4</h1><p>取第二個平底鍋開中火、放油、放蒜末。 炒出味道之後放彩椒下去炒。 炒個半分鐘。 剩下還沒用到的調味料通通放在一起碗裡面混合好、直接倒下去拌炒。</p> <hr><h1>5</h1><p>因為糖的關係、所以炒出來的顏色會很漂亮。 非常不容易失敗的一道料理。 不過、你很有可能會剩很多料下來(像是蛋汁用不完、太白粉也用不完)、那就直接倒掉吧。 你的目標是先做成功、成功了一次之後、再來考慮怎麼增加自己的效率。 祝一切順利。</p> <hr>', '幅、碗、搓、搓、顆、cc、匙、匙、碗、碗、瓣、顆(視個人喜好)'),
(217, '烤豬肋排', '豬肋排、黑胡椒、醬油、紹興酒、砂糖、蜂蜜、麥芽糖、番茄醬、豆腐乳', '4、1、2、2、1、1、40、2、1', '217.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 0, 0, 2, '<hr><h1>1</h1><p>排骨先過水川燙後、放入滷汁中。可以用手按摩肋排、讓滷汁充分沾滿肋排、放入冰箱醃漬隔夜。中間有時可以翻翻面。</p> <hr><h1>2</h1><p>蒸籠大火水滾後、將醃好的肋排放入蒸籠蒸30分鐘。肉類滷完再蒸、可使醬汁在蒸的過程中滲入肉內、讓肉質軟嫩入味多汁。怕麻煩也可用電鍋蒸、只是電鍋蒸較易有太多水分滴到肉排上。</p> <hr><h1>3</h1><p>用原來的滷汁、塗抹蒸好的肋排、放入預熱好的烤箱、以220℃烤10-15分鐘、烤至表面金黃焦色。中間可以翻面塗抹滷汁。</p> <hr><h1>4</h1><p>擺上配菜、就可擺盤上桌。先蒸後烤、肋排肉質汁多而柔軟、醃料的味道滲透到最裡面、每一口都非常入味、而且骨肉很容易分離很好啃。擠上一點檸檬汁風味會更佳、也會解膩。</p> <hr>', '根、小匙、大匙、大匙、大匙、大匙、G、大匙、塊'),
(218, '美式餅乾MM巧克力口味&棉花糖口味', '無鹽奶油、二號砂糖（紅、黑糖）、白糖、蛋（打散）、香草精（可有可無）、低筋麵粉、鹽、小蘇打粉、可可粉、MM牛奶巧克力、棉花糖', '120、75、25、1、1、160、1點點、4分之1、15、2、5', '218.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>準備好所有食材、\\n室溫下放軟奶油切小塊、\\n蛋打散備用、\\n麵粉、小蘇打粉、鹽過篩備用</p> <hr><h1>2</h1><p>奶油加入二砂及白糖後打成乳霜狀</p> <hr><h1>3</h1><p>奶油呈現乳霜狀時加入香草精以及蛋、\\n蛋可以分兩~三次加入、一定要扮勻~</p> <hr><h1>4</h1><p>加入麵粉、這個步驟開始不能用機器攪拌囉、\\n要用刮刀慢慢拌切均勻~</p> <hr><h1>5</h1><p>把麵糊分成兩份、一份加入過篩好的可可粉、\\n如果沒有要做兩種口味這個步驟可以省略~</p> <hr><h1>6</h1><p>把原味麵糊用湯匙挖成一顆一顆的、\\n然後放上MM巧克力、\\n也可以直接把巧克力放進去攪拌、\\n只是我怕分配不均 OAQ</p> <hr><h1>7</h1><p>可可棉花糖的部分我則是直接攪拌進去、\\n因為棉花糖是加熱會融化黏黏的食材、\\n我怕烤的時候沾黏在一起。\\n\\n我個人是直接放進去烤沒有分成一塊一塊、\\n烤出來就是一個大~平~台~（？）\\n等涼之後再切塊就好囉！</p> <hr><h1>8</h1><p>烤箱設定160度、烤大約20~25分鐘、\\n每個人家裡烤箱不太一樣、\\n記得要常常檢查烘烤情形唷！</p> <hr>', '克、克、克、顆、匙、克、一點點、匙、克、包、顆'),
(219, '巧克力豆燕麥軟餅乾', '無鹽奶油、紅糖、雞蛋、蘇打粉、中筋麵粉、燕麥片、巧克力豆豆', '120、75、1、4、130、25、160', '219.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>先將燕麥片放入攪拌品內打至幼細、然後與麵粉和蘇打粉拌勻、備用</p> <hr><h1>2</h1><p>用電動打蛋器打發奶油和紅糖 （也可用白砂糖代替）</p> <hr><h1>3</h1><p>然後下雞蛋拌勻、再加入步驟一的材料、拌勻 （拌勻便可、不要過份攪拌）</p> <hr><h1>4</h1><p>最後加入巧克力豆豆拌勻</p> <hr><h1>5</h1><p>拿出一份麵糰、搓圓、放在烘焙紙上、然後放入冰箱約一至兩小時</p> <hr><h1>6</h1><p>放入已預熱180度烤箱、烤約13-14分鐘、拿出烤盤後、讓餅乾直接在放在烤盤上待涼便可</p> <hr><h1>7</h1><p>將冰箱內的餅乾麵糰放入密封袋內、然後放入冰凍庫存放、每次烤前直接將麵糰放在烘焙紙上、放入烤箱便可、不用退冰、烤的時間需增加2-3分鐘</p> <hr>', '克、克、個、克、克、克、克'),
(220, '美式甜麵包', '高粉、低粉、奶粉、s-5000(改良劑)、鹽、糖、酵母、水、全蛋、奶油', '528、132、26、8、7、119、8、304、66、66', '220.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 2, '<hr><h1>1</h1><p>除油以外所有材料入攪拌鋼、用1速拌勻2速打成團</p> <hr><h1>2</h1><p>打至擴展階段（麵團稍微光滑時）加入油、繼續用二速攪拌</p> <hr><h1>3</h1><p>這時麵團看起來會較溼、會黏鋼是正常的、用塑膠刮刀把黏在底部、旁邊那些沒有拌到的麵團刮上來</p> <hr><h1>4</h1><p>繼續攪拌、直到麵團成光滑狀不黏手、拿一小塊麵團起來拉 看是否有一層薄膜、即完成。\\r\\n拿起麵團整形置光滑後進發酵箱(28度、一小時)</p> <hr><h1>5</h1><p>發酵完、分割麵團每個60g滾圓、鬆弛15分鐘</p> <hr><h1>6</h1><p></p> <hr><h1>7</h1><p>若要包餡要於鬆弛15分後包入、餡約30g、依個人口味添加餡料。\\r\\n若不要包餡、後發38度 50分、即可入烤爐\\r\\n200/180度、烤約15分鐘\\r\\n（後發經40分時預爐）\\r\\n包餡:光面朝上、壓扁、底部那面包餡</p> <hr><h1>8</h1><p>用朝下的那面包入餡</p> <hr><h1>9</h1><p></p> <hr><h1>10</h1><p></p> <hr><h1>11</h1><p></p> <hr><h1>12</h1><p></p> <hr><h1>13</h1><p></p> <hr><h1>14</h1><p>捏合完的底部</p> <hr><h1>15</h1><p>烤焙約15分鐘、出爐後放置於涼架上冷卻\\r\\n</p> <hr>', 'g、g、g、g、g、g、g、g、g、g'),
(221, '美式辣雞翅', '雞翅、白酒、Tabasco、紅椒粉、辣椒粉、辣椒、白胡椒粉、鹽、番茄醬、白醋、Tabasco、砂糖、紅椒粉、辣椒粉', '5、、、、、、、、2、2、0.5、0.5、1、2', '221.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 2, '<hr><h1>1</h1><p>先把雞翅的小雞腿跟雞翅分開\\n在內側劃幾刀</p> <hr><h1>2</h1><p>加入白酒 紅椒粉 辣椒粉 白胡椒粉 鹽 辣椒末 Tabasco 進去醃</p> <hr><h1>3</h1><p>把醃料抓一抓混勻送進冰箱冰一天\\n半天時再去攪拌一下</p> <hr><h1>4</h1><p>隔天再起來炸過</p> <hr><h1>5</h1><p>先把醬料調好</p> <hr><h1>6</h1><p>入鍋跟雞翅拌一拌</p> <hr><h1>7</h1><p>好好吃喔??</p> <hr>', '支、適量、適量、適量、適量、適量、適量、適量、大匙、大匙、大匙、大匙、小匙、小匙'),
(222, '美式爆漿起司厚切豬排堡', '漢堡麵包、酸黃瓜、荷包蛋、黃芥末醬、美乃滋、番茄醬、切達乾酪、豬絞肉、魚漿、番薯粉、麵包粉、雞蛋、鮮奶、黃、紅甜椒、洋蔥', '1、數片、1、、、、1、600、100、3、100、1、100、各0.5顆、0.5', '222.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>甜椒、洋蔥用攪拌機切碎備用</p> <hr><h1>2</h1><p>鮮奶</p> <hr><h1>3</h1><p>麵包粉與鮮奶拌勻</p> <hr><h1>4</h1><p>將雞蛋、切碎的甜椒們、豬絞肉加入麵包粉中\\n喜歡Q彈口感的話可以再加入魚漿\\n接著使用萬能的雙手開始拍打攪拌均勻！\\n</p> <hr><h1>5</h1><p>加入鹽巴、白胡椒粉、五香粉調味\\n最後加入地瓜粉調整緊實度！</p> <hr><h1>6</h1><p>捏成圓餅狀入油鍋、先以中大火煎到定型、再轉小火煎熟\\n不要太快翻面、也不要用鍋鏟壓他、不然會變形喔！</p> <hr><h1>7</h1><p>起鍋前鋪上一片起司片、讓起司緊緊擁抱厚切豬排、營造爆漿的絕美畫面！</p> <hr><h1>8</h1><p>最後、煎顆蛋、放上漢堡排、夾入酸黃瓜、洋蔥絲、擠上美乃滋、番茄醬、黃芥末醬...美式漢堡就完成了！</p> <hr>', '個、數片、顆、少許、少許、少許、片、G、G、大匙、G、顆、CC、各半顆、顆'),
(223, '巧克力豆可可餅乾', '無鹽發酵奶油、三溫糖、蛋、低筋麵粉、無糖可可粉、巧克力豆', '90、45、1、180、15、50', '223.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>無鹽發酵奶油在室溫下軟化之後用電動打蛋器打至膨鬆。</p> <hr><h1>2</h1><p>加入糖之後攪打均勻。</p> <hr><h1>3</h1><p>加入蛋、攪打至蛋汁與奶油糊充分混合。</p> <hr><h1>4</h1><p>低筋麵粉與可可粉過篩後加入奶油糊、換成攪拌刮刀、慢慢切拌混合讓粉料完全被奶油糊吸收進去。</p> <hr><h1>5</h1><p>加入巧克力豆、稍微攪拌讓巧克力豆均勻混入麵團即可。</p> <hr><h1>6</h1><p>將麵團用手壓成厚塊、以保鮮膜保覆好、放入冰箱冷藏鬆弛30分鐘。烤箱以170℃預熱、鬆弛好的麵團分25公克一個塑成圓扁型、排入烤盤中、以170℃烤25分鐘、再燜10分鐘即完成。</p> <hr>', '公克、公克、個、公克、公克、公克'),
(224, '美式焦糖蘋果派', '蘋果、糖、肉桂粉、熱水、冰水、中筋麵粉、無鹽奶油、水、糖、鹽、蛋液', '6、130、5、20、50、375、240、113、12、4、', '224.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 2, '<hr><h1>1</h1><p>中粉過篩加入軟化的奶油、用刮板將奶油切細與麵粉融合（全程用切的）\\r\\n</p> <hr><h1>2</h1><p>切入奶油的麵粉中間挖一個洞倒入（水+糖+鹽）後用刮板壓至成團、封上保鮮膜冰冷藏鬆弛1小時\\r\\n*全程不能揉麵團、要用刮板剷起麵團在用手壓</p> <hr><h1>3</h1><p>熱水+糖煮至淡淡的焦糖色、再加入冰水煮滾</p> <hr><h1>4</h1><p>加入肉桂粉至焦糖液裡後放入蘋果煮軟</p> <hr><h1>5</h1><p>派皮麵團分成三大等份、再每一大等份切3/1小等份備用</p> <hr><h1>6</h1><p>鬆弛後的麵團桿平整放至派模上</p> <hr><h1>7</h1><p>用叉子戳洞</p> <hr><h1>8</h1><p>放入煮軟且瀝乾水份的蘋果</p> <hr><h1>9</h1><p>將三小等份的麵團取一份桿平用刀切出0.5～1cm的長條狀</p> <hr><h1>10</h1><p>交錯擺放長條派皮</p> <hr><h1>11</h1><p>表面抹上蛋液再撒上白砂糖少許（為增加色澤）</p> <hr><h1>12</h1><p>上下火200度烤10分鐘後調頭改180度在烤15分鐘</p> <hr><h1>13</h1><p>熱熱的吃跟冰過再吃口感不一樣喔??</p> <hr>', '顆、g、g、g、g、g、g、g、g、g、少許'),
(225, '懶人食譜迷你美式熱狗', '小熱狗、鬆餅粉、牛奶、蛋', '依人數、100、50、2', '225.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>鬆餅粉跟鮮奶依照2：1的比例加兩顆蛋調勻\\n</p> <hr><h1>2</h1><p>接著將小熱狗切對半、並串上牙籤\\n這邊用的小熱狗是早餐店熱狗的大小、如果懶的切、也可以試看看用鑫鑫腸XDDD</p> <hr><h1>3</h1><p>丟入油鍋炸到金黃色即可起鍋</p> <hr>', '依人數、g、ml、顆'),
(226, '美式烤豬肋骨～附美式燒烤醬做法', '豬肋骨、蜂蜜、蕃茄醬、水、醬油、蜂蜜、黃糖、紅椒粉、洋蔥末細切、大蒜末、白醋/紅酒醋/蘋果醋、蒜粉、紅椒粉、鹽、黑胡椒粉', '1、塗面、4、3、2、2、1、1、3、2、1、1、1、2、1', '226.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>先反面 在骨頭與骨頭之間輕輕切一刀\\r\\n（幫助醃料入味）\\r\\n醃料混合均勻 兩面都塗上醃料 醃15分鐘以上</p> <hr><h1>2</h1><p>用錫箔紙蓋緊 放進烤箱 130度焗2小時\\r\\n（骨頭的一面向上）</p> <hr><h1>3</h1><p>醬料混合均勻\\r\\n下1匙檻欖油 炒香洋蔥和蒜末\\r\\n再下醬料拌炒 小火煮至沸騰 關火</p> <hr><h1>4</h1><p>2小時後取出 BBQ醬均勻塗滿兩面</p> <hr><h1>5</h1><p>錫箔紙這樣包就好～\\r\\n180度焗10分鐘 拿出來塗醬 再焗10分鐘 \\r\\n再拿出黎塗蜂蜜 再蓋一層BBQ醬 再焗10分鐘\\r\\n（前後總共30分鐘）</p> <hr><h1>6</h1><p>取出後再塗上一層BBQ醬 撒適量香茜末 完成～</p> <hr>', '條、適量塗面、匙、匙、匙、匙、匙、匙、匙、瓣、匙、匙、匙、匙、匙'),
(227, '炸薯條', '馬鈴薯、雞蛋、鹽巴、低筋麵粉、麵包粉', '1、1、、、', '227.png', 'https://icook.tw/recipes/', 0, 1, 0, 0, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>將材料準備好、雞蛋攪拌成蛋液備用。建議將粉類與蛋液分別裝入盤中、方便後續馬鈴薯沾黏。</p> <hr><h1>2</h1><p>將馬鈴薯清洗乾淨、切成長條狀、取個容器、撒入適量的鹽巴、翻動馬鈴薯做調味的動作。</p> <hr><h1>3</h1><p>將步驟2的馬鈴薯條取出、先沾一層低筋麵粉（左上圖）、接著將沾有低筋麵粉的馬鈴薯條沾上蛋液（右上圖）最後裹上麵包粉即可（下圖）\\n\\n順序：低筋麵粉—蛋液—麵包粉</p> <hr><h1>4</h1><p>起個油鍋、待油溫穩定上升、放入裹好的馬鈴薯條、炸至表面上色後、稍微轉大火逼油、即可取出。\\n</p> <hr><h1>5</h1><p>可灑上一點海苔粉、胡椒鹽、番茄醬等做調味。趁熱吃最對味??</p> <hr>', '顆、顆、適量、適量、適量'),
(228, '美式烘肉餅', '牛絞肉、麵包糠、牛奶、洋蔥、雞蛋、鹽、黑胡椒、蕃茄醬、燒烤醬', '500、40、50、1、1、1、1、3、依喜好', '228.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>洋蔥切碎、麵包糠、牛奶、洋蔥、雞蛋和所有調味料加入牛絞肉、用力攪拌均勻至有粘性</p> <hr><h1>2</h1><p>肉餡慢慢塑形至腳的形狀</p> <hr><h1>3</h1><p>洋蔥切小塊弄成腳甲</p> <hr><h1>4</h1><p>洋蔥片切成1cm厚弄成骨頭、燒烤醬和番茄醬拌勻、塗抹在骨頭周圍</p> <hr><h1>5</h1><p>烤模鋪上一層錫紙方便脫膜、烤箱預熱到180度、放入烤箱烘烤15分鐘、配上薯泥即可開動</p> <hr>', '克、克、毫升、顆、顆、湯匙、湯匙、湯匙、依喜好'),
(229, '美式檸檬派', '消化餅、紅糖、無鹽奶油、檸檬汁、煉乳、全蛋', '300、50、70、150、500、2', '229.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>步驟一：將消化餅乾裝進夾鏈袋中、以?麵棍壓碎。或是直接以果汁機、食物調理機打成粉末狀。\\n直接用果汁機打速度比較快、顆粒也會比較細、打好後、可以直接加入紅糖、再以果汁機混勻。</p> <hr><h1>2</h1><p>步驟二：將融化奶油加入餅乾粉末中、均勻攪拌。\\n加入奶油並攪拌好的餅乾必須呈現一種有辦法結塊的狀態、可以試著用手捏捏看、把餅乾粉末捏起來再鬆手、看是否可以變成塊狀、成形烤好後才不會太容易崩解。\\n無法成形的話可以在酌量加些奶油、直到餅乾不會輕易崩開~~~~~</p> <hr><h1>3</h1><p>步驟三：將混好奶油的餅乾鋪進派皮烤模、壓緊、注意派皮的厚薄度。成形的派皮進預熱好的烤箱、180度烤10分鐘。烤好後放涼待檸檬蛋黃醬完成後可以填裝。</p> <hr><h1>4</h1><p>檸檬蛋黃醬做法！\\n</p> <hr><h1>5</h1><p>步驟一：檸檬洗淨後、把皮磨成細屑、檸檬榨汁。</p> <hr><h1>6</h1><p>皮磨好後、對切、開始榨汁~~~~~榨乾它們吧~~~~~~~~~~~~~~~~~~~~</p> <hr><h1>7</h1><p>步驟二：煉乳放在攪拌盆中、加入檸檬汁(去籽)、均勻攪拌。</p> <hr><h1>8</h1><p>步驟三：攪拌好的檸檬煉乳加入蛋(事先打散)、蛋可分次加、比較好拌勻、最後加入檸檬皮。</p> <hr><h1>9</h1><p>步驟四：把完成的檸檬蛋黃醬小心倒進已經烤好放涼的派皮、進烤箱繼續烤、180度15分鐘。\\n還沒烤過的檸檬派醬看起來非常液狀、蛋也還沒經過加熱殺菌、這時候千萬別急著食用啊~</p> <hr><h1>10</h1><p>烤好的檸檬派明顯醬已經固化了、加一片檸檬或是一些檸檬皮增加賣相：P 看起來是不是很好吃呀~~~~~~~~~\\n剛烤出來的檸檬派還熱熱的、檸檬蛋黃醬也還沒完全凝固、最好要放涼後再冷藏一下、至少4小時再拿出來切片、口感跟味道才會比較好唷~~~~~~~</p> <hr><h1>11</h1><p>切片後裝飾一下就跟外面賣的檸檬派一樣、兼具賣相和美味唷～～～～～\\n快點一起動手做～超級入門款檸檬派吧！！！！！\\n</p> <hr>', 'g、g、g、cc、g、顆'),
(230, '英式馬芬', '高筋麵粉、酵母、糖、鹽、雞蛋、牛奶、室溫奶油、玉米麵粉', '300、6、15、6、1、150、15、', '230.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 2, '<hr><h1>1</h1><p>先將麵粉、鹽、糖和酵母放入大碗內（不要把鹽和酵母放在一起）、拌勻。然後下牛奶、雞蛋和奶油、拌勻</p> <hr><h1>2</h1><p>放在灑有麵粉的?上、大力搓10分鐘、或至麵團表面平滑和有彈性。然後在大碗內塗一層油、將麵團放入碗內、用保鮮膜包好、靜置約一個小時作發酵、麵團會脹大一倍</p> <hr><h1>3</h1><p>拿出麵團、分成6等份、然後搓圓。放在灑有玉米粉的烤盤上、用保鮮膜包好、再待一個小時作第二次發酵、麵團會稍為脹大</p> <hr><h1>4</h1><p>將麵糰輕輕按扁、然後放在平底鍋內、用小火烘每面約6分鐘即成～</p> <hr><h1>5</h1><p></p> <hr>', '克、克、克、克、個、毫升、克、適量'),
(231, '美式烤豬肋排', '豬肋排、糖、鹽、白胡椒粉、黑胡椒粉、百里香、迷迭香、香蒜粉、洋蔥粉、蒜末、洋蔥、番茄醬、黃芥末醬、蜂蜜、可樂、醬油、糖、水', '3、1、1、1、1、1、1、1、1、1、1、2、1、1、0.5、1、1、酌量', '231.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 2, '<hr><h1>1</h1><p>將所有醃料全部調勻</p> <hr><h1>2</h1><p>豬肋排洗淨後、將醃料塗滿豬肉、醃漬一晚</p> <hr><h1>3</h1><p>醃漬後的豬排</p> <hr><h1>4</h1><p>在豬肋排表面塗上黃芥末醬、先烤約10分鐘．(烤時可架在鐵網上)\\n</p> <hr><h1>5</h1><p>繼續烤1.5小時</p> <hr><h1>6</h1><p>等待烤的時候先製作烤肉醬</p> <hr><h1>7</h1><p>塗抹上烤肉醬、蓋上錫箔紙、烤1小後、在抹一次烤肉醬再烤半小時</p> <hr><h1>8</h1><p>完成</p> <hr>', '支、T、t、t、t、t、t、T、T、t、T、T、T、T、碗、T、T、酌量'),
(232, '手製漢堡', '新鮮絞肉、鹽巴、胡椒粉、雞蛋、培根、起士片、生菜、洋蔥、牛番茄、奶油、蒜末、砂糖、番茄醬、白醋、醬油、胡椒粉', '500、3、些許、1、1~2、1、些許、1、1、15、1、1、2、0.5、1、些許', '232.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>先做調味料、將奶油下鍋融化與蒜末拌炒均勻、再將其他調味料下鍋煮至濃稠狀即可\\nTips：奶油易燒焦、記得開小火即可</p> <hr><h1>2</h1><p>將絞肉、鹽巴、胡椒粉放入鍋中攪拌均勻、稍微將絞肉捏緊實、勿過度攪拌\\nTips：過度攪拌會使漢堡排過於緊實、導致口感不佳</p> <hr><h1>3</h1><p>將攪拌好的絞肉分成3~4個( 依各人喜好漢堡排的大小)、壓扁後放置盤子上備用</p> <hr><h1>4</h1><p>熱鍋後、先將漢堡麵包稍微加熱、烤至酥脆即可\\nTips：烤單面就好</p> <hr><h1>5</h1><p> 將塑好型的漢堡排下鍋煎、以中火煎即可\\n\\nTips：以筷子插入漢堡排中、若是血水流出則尚未完成、清肉汁流出則為熟成</p> <hr><h1>6</h1><p>漢堡排快熟成、即可開始準備配料部分、將起士片放在漢堡排上使其融化</p> <hr><h1>7</h1><p>漢堡麵包上放上生菜、漢堡排、煎蛋、再淋上步驟1做好的醬料蓋上麵包就完成了</p> <hr>', 'g、小匙、些許、個、片、片、些許、片、片、g、大匙、大匙、大匙、大匙、大匙、些許'),
(233, '美式甜點GooeyButterCake', 'Yellow Cake Mix、蛋、無鹽奶油、香草精、奶油乳酪、無鹽奶油、白砂糖、玉米糖漿、蛋、香草精、鹽、檸檬汁', '1、1、100、0.5、250、100、60、20、2、1、0.25、1', '233.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>開始製作前、先把奶油乳酪及無鹽奶油置於室溫放至軟身。於蛋糕模具中掃上食譜外之油份備用。把焗爐預熱至攝氏 170 度。</p> <hr><h1>2</h1><p>餅底做法：把無鹽奶油以明火或微波爐加熱溶化成奶油溶液。</p> <hr><h1>3</h1><p>餅底做法：把所有餅底材料拌勻。</p> <hr><h1>4</h1><p>餅底做法：把餅底材料平均分成 12 份。</p> <hr><h1>5</h1><p>餅底做法：把餅底材料壓於蛋糕模具中。不用太完美、厚度相約即可。</p> <hr><h1>6</h1><p>餡料做法：把所有餡料材料拌勻至幼滑。</p> <hr><h1>7</h1><p>把拌好的餡料平均倒入已壓有餅底的蛋糕模具中。</p> <hr><h1>8</h1><p>放入已預熱至攝氏 170 度預熱至的焗爐下層、焗約 18 分鐘。</p> <hr><h1>9</h1><p>轉到焗爐的上層、多焗約 3 分鐘或至蛋糕表面金黃色。</p> <hr><h1>10</h1><p>關掉焗爐、把焗爐的門打開一點點、把蛋糕留在焗爐內至完全放涼取出脫膜即成。這款蛋糕是會必定塌下來的、不用在意。</p> <hr><h1>11</h1><p>食譜用的是 Betty Crocker Yellow Cake Mix\\r\\n1 盒 （15.25 oz/ 432 g）</p> <hr>', '盒、隻、克、茶匙、克、克、克、克、隻、茶匙、茶匙、茶匙'),
(234, '超簡單美式比斯吉Biscuits', '低筋麵粉、全麥麵粉、無鋁泡打粉、原色砂糖、鹽、無鹽奶油、牛奶', '140、140、20、10～40、3、80、200', '234.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 2, '<hr><h1>1</h1><p>烤箱預熱230°C、除了牛奶、將所有食材放進盆裡用手拌勻、用手指揉捏成細粉狀、目的是不要讓奶油成坨即可。</p> <hr><h1>2</h1><p>加入牛奶、用叉子或筷子攪拌至無液體狀、取出麵糰放在檯面上準備整形。</p> <hr><h1>3</h1><p>用桿麵棍將麵糰攤平成高度約1.5公分厚的長方形、然後三折、攤平、再三折、反覆二次、最後再攤平成長方形、利用手邊有的器具將麵糰切割成喜歡的形狀。</p> <hr><h1>4</h1><p>入烤箱230°C / 10分鐘～完成。</p> <hr>', 'g、g、g、g、g、g、ml');
INSERT INTO `allrec` (`ID`, `name`, `ing`, `num`, `img`, `link`, `heartattack`, `pneumonia`, `diabetes`, `Lower_respiratory_tract`, `hypertension`, `Nephritis`, `Liver`, `total`, `type`, `step`, `unit`) VALUES
(235, '美式半熟軟芯巧克力布朗尼', '八吋方形烤盤、防沾烤紙、溫開水、即溶黑咖啡粉 Espresso、室溫無鹽奶油、70% 苦甜巧克力、砂糖、香草精 Vanilla Ext、鹽、無糖可可粉、蛋、中筋麵粉 AP flour', '1、30 x 30、2、1、5、7、2/3、2、0.25、1、2、2/3', '235.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>先將烤箱預熱至350度華氏/177度攝氏、這布朗尼麵糊很快就調好了、所以先預熱烤箱。準備好八吋烤模並將烤紙平鋪在烤盤上、若烤紙有點捲無法鋪平、可在烤盤四周點上一點食用油、烤紙就會乖乖黏在烤盤上了。</p> <hr><h1>2</h1><p>A. 拿一個小碗、倒入溫開水和咖啡粉攪拌均勻、放旁邊備用。\\nB. 將苦甜巧克力隔水加熱或微波至溶化。</p> <hr><h1>3</h1><p>拿一個大碗、將糖和室溫奶油攪拌均勻。加入蛋、香草精和咖啡水、全部攪拌均勻後、再加入融化後的苦甜巧克力、攪拌均勻。</p> <hr><h1>4</h1><p>加入剩餘的乾性材料：麵粉、鹽和無糖可可粉、全部材料輕輕混合均勻。這個步驟切記不可過度攪拌、否則麵糊會出筋、烤出來就不鬆軟囉。</p> <hr><h1>5</h1><p>將麵糊倒入備用的烤盤和烤紙上、稍微用刮刀刮平表面、送進烤箱烤40-45分鐘、或直到牙籤戳進去、拔出來後沒有濕麵糊跟著一起出來（有些許屑屑是正常的）、就完成囉！</p> <hr><h1>6</h1><p>出爐後等五分鐘、把烤好的布朗尼連同烤紙一起移出烤盤至散熱架冷卻。等到冷卻得差不多再切成方形。若不夠冷就切的話、邊邊容易跟著刀凹下去、不是很好切。建議等涼一點再切。（我知道、等待的時間很難熬 XD）</p> <hr><h1>7</h1><p>美味的半熟軟芯布朗尼見客囉！</p> <hr>', '個、cm、2、1、oz、oz、杯、茶匙、茶匙、大匙、大顆、杯'),
(236, '美式漢堡包', '漢堡麵包、番茄、洋蔥、萵苣葉、培根、黃芥末、番茄醬、起司、海鹽、黑胡椒、麵包粉、全蛋、牛奶、洋蔥、紅蘿蔔、牛絞肉、豬絞肉', '4、2、0.5、數片、4、、、4、、、0.5、0.5、0.5、0.5、3、200、100', '236.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>用少許油小火炒洋蔥、炒軟後再加入紅蘿蔔。\\n炒好後就將漢堡肉的材料全部混在一起、然後摔它、摔到肉末都能巴在一起的程度\\n\\n然後就抓一坨、在手掌上互擲成球狀就行了</p> <hr><h1>2</h1><p>麵包放進烤箱烤個5分鐘後取出切對半後放上生菜（可以在麵包鋪上一層錫箔紙避免烤焦）</p> <hr><h1>3</h1><p>熱鍋不放油煎培根、煎熟後放在生菜上（煎培根會爆出許多油、不要倒掉、拿來煎肉排）</p> <hr><h1>4</h1><p>然後依序放上洋蔥圈、番茄片、在上面擠上適量的蕃茄醬、黃芥末</p> <hr><h1>5</h1><p>再來就是用剛剛煎培根的油拿了煎肉排、在起鍋前放上一片起司、利用肉排的熱度將它融化</p> <hr><h1>6</h1><p></p> <hr><h1>7</h1><p>最後撒上黑胡椒、麵包蓋上大功告成</p> <hr>', '個、顆、顆、數片、條、適量、適量、片、少許、少許、量米杯、顆、量米杯、顆、片、g、g'),
(237, '美式藍莓BBQ醬烤小羔羊排', '湯瑪仕肉舖紐西蘭小羔羊排、藍莓、巴薩米醋、大蒜切末、番茄醬、法式芥茉、紅糖', '4、60、30、1、2、0.5、1', '237.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>製作烤肉醬：藍莓放深碗、以電動攪拌器或果汁機打成泥、加入巴薩米醋、蒜末、番茄醬、法式芥茉、紅糖拌勻即可</p> <hr><h1>2</h1><p>醃肉：羊排與烤肉醬同放密封袋、按摩羊排讓整片裹上醬料及幫助入味。醃4個小時、最好過夜</p> <hr><h1>3</h1><p>烤肉：鑄鐵烤盤抹油加熱、羊排稍稍抹去表面藍莓醬料以避免果泥烤焦、放烤盤烤至兩面及側面焦黃後取出</p> <hr><h1>4</h1><p>每一塊羊排分別包在鋁箔紙裡靜置5分鐘後、讓肉汁再被吸回肉裡、此時羊肉便會呈現均勻粉紅色、即可享用</p> <hr>', '片、克、ml、瓣、湯匙、茶匙、湯匙'),
(238, '美式燕麥果乾巧克力豆軟餅', '無鹽奶油、燕麥片、低筋或中筋麵粉、二砂糖、黑糖粉、鹽、蔓越莓乾、泡蔓越莓的水、室溫雞蛋、耐烤水滴型巧克力豆', '80、90、170、30、30、0.25、40、0.5、1、40', '238.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>蔓越莓乾泡水、泡軟後取出瀝乾水份並剁碎、泡過蔓越莓的水先留著、不要丟掉、講究一點的話可以用萊姆酒做浸泡。</p> <hr><h1>2</h1><p>把糖和鹽放在一起、混合均勻備用。</p> <hr><h1>3</h1><p>低筋麵粉過篩後、把燕麥片放進去、混合均勻。</p> <hr><h1>4</h1><p>無鹽奶油室溫放軟(手指壓下有凹痕即可)、用電動打蛋器高速攪打到變成乳霜狀。</p> <hr><h1>5</h1><p>接著加入混合好的糖及鹽、用電動打蛋器高速打發、因為我沒有添加泡打粉之類的膨脹劑、所以一定要確實把奶油糖打發、餅乾口感才會好。</p> <hr><h1>6</h1><p>把雞蛋打散後、蛋液分數次加入、這時泡過蔓越莓乾的水也可以一起加入、然後用打蛋器低速攪拌均勻。</p> <hr><h1>7</h1><p>攪拌好的狀態。</p> <hr><h1>8</h1><p>接著分二次把麵粉燕麥片加入。</p> <hr><h1>9</h1><p>用橡皮刮刀或是手掌、以按壓方式把這些材料混合均勻、要避免搓揉或過度用力攪拌、以免麵粉出筋、影響口感。</p> <hr><h1>10</h1><p>粉類快混合好的時候、就把剁碎的蔓越莓乾倒入、然後混合至完全均勻即可。</p> <hr><h1>11</h1><p>分成二份、其中一份加入耐烤巧克力豆並混合均勻。我這裡用的是耐烤巧克力豆、烤的時候才不會因為溶化、到處都是巧克力漿。</p> <hr><h1>12</h1><p>這些材料共可以做12個餅乾、有巧克力的6個、沒有巧克力的也是6個。我先用手把它們都搓成球狀、放在舖了烘焙布的烤盤上、還有一種較隨興的做法、是用冰淇淋勺挖成一球一球、我沒有冰淇淋勺、所以用手搓。</p> <hr><h1>13</h1><p>然後全部壓扁、每片大小約7公分左右、不需要壓得太扁、有點厚度比較好吃、餅和餅之間要有間距、以免膨脹後相連在一起。</p> <hr><h1>14</h1><p>烤箱預熱170度/10分鐘、預熱完畢後就可以放進去烤15分鐘。</p> <hr><h1>15</h1><p>烤好後就可以立即取出放涼、也可以先不管它、讓它在烤箱裡慢慢冷卻變成溫溫的再取出放涼、在烤箱慢慢冷卻、質地會比較酥一點。拿出來放涼的時候、最好放在通風的網架上、底部才會乾爽。</p> <hr><h1>16</h1><p>全部放在一起、拿出來請人吃、看起來很豐盛的感覺。</p> <hr><h1>17</h1><p>如果想吃到像剛出爐那種溫熱軟心的感覺、拿去微波加熱、用600w/10秒即可。其實放涼吃、也是蠻好吃的。</p> <hr>', 'g、g、g、g、g、小匙、g、大匙、個、g'),
(239, '耆盛鬆餅粉麥當勞的美式鬆餅銅鑼燒', '耆盛鬆餅粉、雞蛋、水', '300、1、1', '239.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 1, 1, 0, 2, '<hr><h1>1</h1><p>準備的材料有耆盛鬆餅粉一盒、蛋一顆、水一碗(也可換成牛奶)</p> <hr><h1>2</h1><p>首先將鬆餅粉過篩、再加入蛋及水並均勻攪拌後備用。</p> <hr><h1>3</h1><p>平底鍋燒熱後、倒入油、用衛生紙擦均勻、之後倒入麵糊。我用湯勺來舀、如果家裡有稍微新一點的不沾鍋就連油都不用加、就會煎出漂亮的淺咖啡色 </p> <hr><h1>4</h1><p>用中小火煎至表面有80%氣泡出現、然後翻面</p> <hr><h1>5</h1><p>繼續煎一分鐘左右</p> <hr><h1>6</h1><p>完成!</p> <hr><h1>7</h1><p>加上蜂蜜跟一些葡萄乾、果乾</p> <hr>', 'g、顆、碗'),
(240, '美式鬆餅', '低筋麵粉、水或牛奶、泡打粉、蛋、糖粉、香蕉、水、砂糖', '150、130、5、1、、0.5、0.5、0.5', '240.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 1, 0, 2, '<hr><h1>1</h1><p>準備好材料。</p> <hr><h1>2</h1><p>將水或牛奶、蛋、泡打粉裝入大碗後攪拌均勻。</p> <hr><h1>3</h1><p>不沾平底鍋不需加油開小火加熱、舀一大湯匙麵糊入鍋、不需要要故意劃開成圓、麵糊自己會散開成圓。</p> <hr><h1>4</h1><p>等待表面全都出現小泡洞後、可用鍋鏟從鬆餅邊緣先慢慢鏟起一圈後翻面、再等待約1分鐘即可起鍋。</p> <hr><h1>5</h1><p>偽楓糖漿做法：將水及砂糖用中火煮過、要不停攪拌、全都融化後即可。注意冷掉後會變硬唷。</p> <hr><h1>6</h1><p>依照自己喜好將水果、配菜擺盤即可。</p> <hr>', '克、ml、克、顆、少許、根、杯、杯'),
(241, '美式西雅圖海鮮', '對蝦、扇貝、美式一口煙燻熱狗、魷魚切片、玉米、花椰菜、美式海鮮辣醬、蛤蜊、洋蔥、辣椒、檸檬、番茄泥、白酒、月桂葉、香料、大蒜、奶油、各類高湯凍', '12、2、12、1、1、1、1、15、0.5、1、0.5、2、1、1-2、、6、2、50', '241.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 1, 0, 0, 2, '<hr><h1>1</h1><p>洗刷海鮮、備菜</p> <hr><h1>2</h1><p>海鮮+青花菜醃自己喜愛的調味料10分鐘後放入蒸鍋裡整幾乎全熟取出。</p> <hr><h1>3</h1><p>蒸的過程同時把海鮮以外的調味料煮成一鍋。玉米、熱狗在醬汁完成時放入一起煮。</p> <hr><h1>4</h1><p>蒸完的海鮮放入一個鋼盆中、把湯汁留下來、加入醬汁中熬稠。同時將蔬菜放入蒸鍋中</p> <hr><h1>5</h1><p>最後將所有物品放入鋼盆中甩鍋混合、上桌前切半顆檸檬、加上適量的調味。</p> <hr>', '隻、顆、根、隻、根、顆、份、顆、顆、根、顆、Tbsp、Tbsp、片、適量、瓣、Tbsp、ml'),
(242, '烤美式鄉村玉米麵包', '無鹽奶油、中筋麵粉、黃玉米粉、糖、鹽、泡打粉、牛奶、雞蛋', '1、1、1、1、2、2、1、2', '242.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 2, '<hr><h1>1</h1><p>先將烤箱預熱到425°F。同時將8吋的模型裡面塗滿奶油（好脫模）</p> <hr><h1>2</h1><p>在一個中型攪拌碗裡、將麵粉、玉米粉、糖、鹽與泡打粉混在一起。</p> <hr><h1>3</h1><p>同時準備一個小型攪拌碗、將牛奶與雞蛋拌勻。</p> <hr><h1>4</h1><p>將小型碗裡的雞蛋混牛奶到入中型碗裡、攪拌均勻（不要過度攪拌）。</p> <hr><h1>5</h1><p>將麵包糊倒入8吋模型裡、放入烤箱烤20-25分（表面金黃即可）。</p> <hr><h1>6</h1><p></p> <hr>', '匙、杯、杯、匙、茶匙、茶匙、杯、顆'),
(243, '美式炒蛋', '雞蛋、牛奶、奶油、鹽', '1、30、1、', '243.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>將雞蛋加牛奶打勻至有小泡泡。</p> <hr><h1>2</h1><p>平底鍋燒熱、放入少許奶油。</p> <hr><h1>3</h1><p>關小火將蛋液倒入、加適量鹽巴、翻炒至8分熟、用餘溫讓蛋悶至喜愛的熟度。</p> <hr><h1>4</h1><p>加入水果、鬆餅一起食用、就是經典美式早餐</p> <hr>', '顆、cc、匙、適量'),
(244, '美式蘋果派', '活動派盤、無鹽奶油、中筋麵粉、糖粉、鹽、水、白醋、蛋白、蘋果、砂糖、黑糖、無鹽奶油、鹽、水、肉桂粉、檸檬汁、蘭姆酒、蛋', '9、150、360、15、2.5、30、7.5、40、5-6、75、20、25、0.5、55、2、8、3、1', '244.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 1, 0, 2, '<hr><h1>1</h1><p>??麵粉+鹽+糖粉過篩混合.\\n??無鹽奶油用刀切成1公分大小丁狀.不用軟化\\n??將奶油混合到麵粉中.用手指搓碎.碎的程度要像奶酥那樣大小.</p> <hr><h1>2</h1><p>??以上步驟完成時再將（冰水+蛋白+醋混合）倒入.混合到水份剛好吸收.用兩手將麵糰壓成一大球.\\n</p> <hr><h1>3</h1><p>??2/3保鮮膜包住.派底\\n??1/3保鮮膜包住.派頂\\n??放到冰箱冷藏2個小時以上.冰ㄧ天更好....</p> <hr><h1>4</h1><p>??蘋果削皮.切成0.3~0.5cm薄片.（泡鹽水免得變色）\\n??中火熱鍋.放入無鹽奶油.加入蘋果及砂糖.炒到蘋果出水（黑糖也加上）</p> <hr><h1>5</h1><p>??等蘋果出的水要沸騰時.將肉桂粉+檸檬汁+水+萊姆酒混合.倒入鍋裡快速攪拌.拌煮約15分\\n   看軟度和上色決定要不要再煮一會兒....</p> <hr><h1>6</h1><p>??撈出鋪平放涼....</p> <hr><h1>7</h1><p>??取出冰箱的麵糰.先取2/3麵糰用手壓成扁圓形狀.用?麵棍由中間向外桿平.厚度約0.3cm.\\n   大小要比派盤大5cm以上.</p> <hr><h1>8</h1><p>??將派皮鋪平到派盤上.和派盤之間不要有空氣.邊緣多餘的派皮用桿麵棍橄過派盤的邊緣就掉了(再放回冰箱靜置30分鐘)\\n??派皮底部用叉子刺一些洞洞.</p> <hr><h1>9</h1><p>??將剩下的1/3派皮?成四方形切10~12條長20cm寬1.5cm的長條.厚度約0.2~0.3cm</p> <hr><h1>10</h1><p>??開始編織成網狀、也是放冷藏30分</p> <hr><h1>11</h1><p>??將蘋果內餡放入派皮中.蘋果內餡要放涼才放入喔?.</p> <hr><h1>12</h1><p>??將派頂網狀放在內餡上、將麵皮邊緣捏緊.</p> <hr><h1>13</h1><p>??用刷子在表面刷一層蛋黃液.\\n   (蛋黃液:用一顆蛋攪拌均勻) </p> <hr><h1>14</h1><p>??烤箱請先200度預熱.....</p> <hr><h1>15</h1><p>??放入烤箱中200度C烤一小時、我的烤箱是好先生200/200   上/下</p> <hr><h1>16</h1><p>??烤箱取出稍涼後.將派從派盤中取出.香噴噴好吃的美式蘋果派就完成了.</p> <hr><h1>17</h1><p>??我是放在烤箱最下層烤盤的位置.派皮烤出來比較酥喔??\\n??建議大家可以在前一晚把派皮和餡料準備好、早上把派皮弄好餡料填好就可以烤了。\\n早餐也可以吃個蘋果派啊??(*^o^*)</p> <hr><h1>18</h1><p>??派皮酥香脆....蘋果內餡軟嫩多汁....好棒\\n報告完畢啦！\\n☆*:.?. o(≧▽≦)o .?.:*☆\\n紫麻麻的創意手作</p> <hr>', '吋、g、g、g、g、cc、cc、g、顆、g、g、g、匙、cc、g、g、大匙、顆'),
(245, '美式蘋果派簡易法', '家樂福法國千層派皮、蘋果、砂糖、無鹽奶油、檸檬、肉桂粉、肉豆蔻粉、8吋活動派盤、麵棍、烤箱、刷子、篩子、蛋汁、糖粉', '1、4、25、15、1、、、1、1、1、1、1、、', '245.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 1, 1, 0, 2, '<hr><h1>1</h1><p>準備一盆水、將4顆蘋果削皮去籽後切小塊、邊切邊拿去泡在水中備用、切塊時請記得每塊大小差異不要過大。然後秤好砂糖25g、無鹽奶油15g、肉桂粉1匙、檸檬一顆擠汁備用。</p> <hr><h1>2</h1><p>將蘋果塊瀝乾、丟進鍋內和砂糖、無鹽奶油小火拌炒、煮時記得不停攪拌、接著加檸檬汁、小火煮至蘋果軟化湯汁快收乾時、最後才加入肉桂粉、肉豆蔻粉(此樣可省略)攪勻、這時你可以試一下味道、看是否合自己口味、由於每次買的蘋果甜度不會一樣、所以務必依狀況調整甜度。然後關火放涼。烤箱開始用200度C預熱20分鐘</p> <hr><h1>3</h1><p>放涼內餡後、打開進口的家樂福法國千層派皮包裝、攤平派皮在8吋活動派盤上(如果派盤非不沾派盤、請在派盤內刷上一層油、以方便烤好脫模)、用手整理一下派皮、將它緊貼到派盤內側、並將多餘的部分切除。</p> <hr><h1>4</h1><p>把煮好放涼的肉桂蘋果餡放到派皮上、擺到裝滿為止。</p> <hr><h1>5</h1><p>接著把剩餘的派皮切成約1.2~1.5cm寬的長條(厚度別?太薄、至少2mm、不然烤完容易斷掉)、交錯擺上去、作成格子狀、擺的時候不要拉太緊、拉太緊的話、派皮條烘烤完會內縮碰不到外圈、這樣就不漂亮了；用手整理一下派皮邊吧、按掉多餘的部分、送進烤箱前把所有派皮條都刷上蛋汁。</p> <hr><h1>6</h1><p>將派放到預熱好的烤箱中、以200度C烤20分鐘、再用180度C烤25分鐘、烤好後略微放涼脫模、最後用篩子篩些糖粉上去做裝飾、一塊漂亮又美味的美式蘋果派就誕生囉!</p> <hr><h1>7</h1><p>方便派皮 家樂福法國千層派皮 長這樣、這東西挺冷門的很少人知道、所以拍外包裝給大家看一下方便尋找囉!</p> <hr>', '包、顆、g、g、顆、適量、少許、個、根、台、支、把、少許、適量'),
(246, '水牛城雞翅-', '雞翅、洋蔥粉、蒜末、匈牙利紅椒粉、鹽巴、黑胡椒、白酒、中筋麵粉、無鹽奶油、美式辣醬、番茄醬、白酒醋、蒜末、黑胡椒、鹽巴', '9、1.5、1、1.5、、、1、3、60、5、3、1.5、1、、', '246.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>首先將雞翅切好、擦乾後、與麵粉以外的調味料均勻混合醃製至少45分鐘。</p> <hr><h1>2</h1><p>接著取一個袋子、將雞翅與麵粉倒入袋中、搖晃袋子讓雞翅均勻沾裹麵粉、再來將雞翅放入烤箱用200度烤約30分鐘。</p> <hr><h1>3</h1><p>取一醬汁鍋、先將奶油下鍋融化後、將醬汁其餘的材料下鍋煮均勻後備用。</p> <hr><h1>4</h1><p>最後等雞翅烤好後和步驟3的醬汁均勻混合後就完成了。</p> <hr>', '隻、小匙、小匙、大匙、少許、少許、大匙、大匙、g、大匙、大匙、大匙、小匙、少許、少許'),
(247, '迷迭香雞佐美式炒蛋三明治', '雞腿、鹽、迷迭香罐（小磨坊）、奶油、白酒、蛋、酸奶油、（全麥）吐司、牛奶', '2、1/3、1/3、10、蓋過雞肉即可、4、（各人喜好）、4、15', '247.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 1, 0, 0, 0, 2, '<hr><h1>1</h1><p>雞腿加鹽、加迷迭香以及白酒抓醃、10分鐘</p> <hr><h1>2</h1><p>熱鍋雞腿皮朝下煎上色（不用加油）、兩面煎熟且煎上色後、取出放涼、切斜片備用</p> <hr><h1>3</h1><p>吐司一面塗上薄薄的奶油、烤箱上下130度、烤2~3分鐘備用</p> <hr><h1>4</h1><p>蛋液加鹽、加牛奶、蛋液加入鍋後不斷翻炒、等蛋液開始有凝固狀態時、就可以熄火利用餘溫讓炒蛋熟、有嫩嫩的樣子即可</p> <hr>', '隻、茶匙、茶匙、克、蓋過雞肉即可、顆、適量（各人喜好）、片、cc'),
(248, '夏日清爽料理～泰式椒麻雞', '去骨雞腿、高麗菜絲、蒜末、香菜末、辣椒、烏醋、醬油、水、魚露、檸檬汁、糖', '2、、5、1、1、1、1.5、、、0.5、1', '248.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 0, 0, 3, '<hr><h1>1</h1><p>準備好所有食材\\n雞腿可先醃漬過、更有風味\\n（加米酒、胡椒粉）</p> <hr><h1>2</h1><p>醃漬好的雞腿灑上地瓜粉</p> <hr><h1>3</h1><p>反潮後放入氣炸鍋200度15分鐘</p> <hr><h1>4</h1><p>等待雞腿的過程、調製醬料\\n把所有醬汁材料充分攪拌均勻</p> <hr><h1>5</h1><p>最後擺盤～高麗菜絲舖底、放上氣炸好的雞腿肉、最後淋上醬汁就可以上菜囉</p> <hr>', '支、適量、瓣、支、支、匙、匙、適量、適量、顆、小匙'),
(249, '泰式綠咖哩雞腿', '去骨雞腿、馬鈴薯、紅蘿蔔、蒜頭、辣椒、綠咖哩高、乾香茅、薑、米酒、鹽巴、奶油、鮮奶油、橄欖油、水', '100、20、20、12、2、7、10、2、10、0.6、2、4、8、8', '249.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 1, 1, 0, 0, 3, '<hr><h1>1</h1><p>蒜頭切片、蔥切段、將雞肉洗淨用滾水川燙5分鐘、撈起後沖冷水、備用。</p> <hr><h1>2</h1><p>馬鈴薯切大丁、紅蘿蔔切大丁備用。</p> <hr><h1>3</h1><p>熱鍋加入橄欖油、放入蒜頭、辣椒、薑片、甘香茅、川燙好的雞肉、爆香拌炒。</p> <hr><h1>4</h1><p>倒入米酒和咖哩醬拌炒後、加入鮮奶油煮滾稍微收乾。</p> <hr><h1>5</h1><p>加入馬鈴薯和紅蘿蔔稍微拌炒</p> <hr><h1>6</h1><p>加入水後燉煮30分鐘、使醬汁收乾有濃稠感、完成盛盤。</p> <hr>', '公克、公克、公克、公克、公克、公克、公克、公克、公克、0公克、公克、公克、公克、公克'),
(250, '泰式蠔油芥藍', '芥藍、蠔油、醬油、砂糖、開水、太白粉水、蒜頭、植物油/豬油', '1、1、1、1、、、、', '250.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 0, 0, 3, '<hr><h1>1</h1><p>炸蒜酥、炸蒜酥的方法請參看我的食譜</p> <hr><h1>2</h1><p>把芥藍的枝葉挑掉、留下粗梗</p> <hr><h1>3</h1><p>用刀子把老皮削掉</p> <hr><h1>4</h1><p>分出來的枝葉、把老葉去掉、只留下嫩的部分</p> <hr><h1>5</h1><p>蠔油、醬油、砂糖、開水、入鍋煮滾、邊煮邊嚐味道、加適量開水</p> <hr><h1>6</h1><p>用少許太白粉水勾芡、勾芡一定要在煮滾的時候下</p> <hr><h1>7</h1><p>醬汁完成</p> <hr><h1>8</h1><p>嫩葉和處理好的莖入鍋汆燙3~5分鐘</p> <hr><h1>9</h1><p>燙好的芥藍擺盤、淋上醬汁、蒜油、撒上蒜酥</p> <hr>', '把、大匙、茶匙、茶匙、適量、少許、適量、適量'),
(251, '泰式酸辣蝦湯', '草蝦、香茅、檸檬葉、南薑、番茄、草菇、紅辣椒、魚露、檸檬汁、糖、泰式辣醬、大蝦膏、冬蔭醬、清水', '4、2、、、3、8、3、25、25、10、25、25、25、650', '251.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1</h1><p>先將所有食材和調味料準備好、蝦洗淨並剪掉鬚和蝦腳、番茄洗淨切塊、草菇洗淨切半、香茅切成段、檸檬葉去掉中間的梗 (這樣比較容易釋出香氣)、以及將南薑切成小塊.\\xa0</p> <hr><h1>2</h1><p>我用的醬料 \\n左邊: 辣醬 (Thai Chili Paste)、辣辣甜甜的味道\\n中間: 藍象牌的酸辣湯醬(Tom Yam Soup)、主要是香茅、檸檬葉等醬料、加在湯中會讓湯味道更香\\n右邊:大蝦膏\\xa0(Shrimp Paste with Soybean oil)、保留了蝦的鮮香味.\\xa0</p> <hr><h1>3</h1><p>鍋中加清水、大火煮開、同時將南薑和香茅、辣椒加到鍋中同煮.(不喜太辣者可以減量辣椒).\\xa0</p> <hr><h1>4</h1><p>接著將番茄和草菇放入鍋中一起煮.</p> <hr><h1>5</h1><p>撇去表面上的泡沫</p> <hr><h1>6</h1><p>水滾了再加入草蝦.\\xa0</p> <hr><h1>7</h1><p>待蝦煮熟、加入檸檬葉煮一下即可關火.關火後加入檸檬汁.\\xa0\\xa0</p> <hr><h1>8</h1><p>盛入碗中、現煮現吃、最是美味.也可以加一些椰奶、就是泰式椰奶酸辣蝦湯.\\xa0</p> <hr>', '隻、支、適量、適量、顆、朵、支、克、克、克、克、克、克、克'),
(252, '泰式甜辣蝦', '蝦、橄欖油、泰式甜辣醬、水', '、、、', '252.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 1, 3, '<hr><h1>1</h1><p>準備好所有食材</p> <hr><h1>2</h1><p>中火熱油</p> <hr><h1>3</h1><p>洗乾淨的蝦放下去輕炒</p> <hr><h1>4</h1><p>炒至半熟後加泰式甜辣醬、愛吃多少加多少XD\\n然後加一大匙的開水一起拌炒至蝦每一隻都捲起來成C狀</p> <hr><h1>5</h1><p>這就是超隨意超放縱的泰式甜辣蝦、甜甜辣辣超好吃</p> <hr>', '隨意、適量、隨意、適量'),
(253, '泰式檸檬豬', '芥藍菜、香菜、辣椒、蒜頭、檸檬汁、砂糖、魚露、豬五花/豬里肌、米酒', '1、、1、2、1、2、2、200、', '253.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 3, '<hr><h1>1</h1><p>芥藍洗淨、把嫩枝撥下、切除上面的老葉</p> <hr><h1>2</h1><p>用刀子削除粗莖的老皮、直至剩下嫩莖</p> <hr><h1>3</h1><p>用刀子削除粗莖的老皮、直至剩下嫩莖</p> <hr><h1>4</h1><p>水滾加入米酒、豬五花/豬里肌汆燙</p> <hr><h1>5</h1><p>蒜末、辣椒末、檸檬汁、魚露、砂糖調成醬汁；可依個人喜好調整比例</p> <hr><h1>6</h1><p>豬肉片、芥藍菜(冰鎮)擺盤、淋上醬汁、香菜碎點綴</p> <hr>', '把、適量、根、瓣、顆、茶匙、茶匙、g、適量'),
(254, '芒果椰汁西米糕', '西米、椰汁、芒果、糖、鹽、生粉、水、熱水', '50、150、1、30、1、25、125、125', '254.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 1, 3, '<hr><h1>1</h1><p>先把西米露煮至透明\\n再放入冰水中 （備用）</p> <hr><h1>2</h1><p>生粉和清水攪拌均勻 （備用）</p> <hr><h1>3</h1><p>在鍋中加入椰漿、熱水、糖和鹽</p> <hr><h1>4</h1><p>椰汁煮滾後、加入生粉水並攪拌均勻（小火）\\n直到開始變稠</p> <hr><h1>5</h1><p>先把西米放入盒子中、再放入椰漿\\n在表面上加上芒果粒\\n放進雪櫃兩小時</p> <hr><h1>6</h1><p>大功告成??</p> <hr>', 'g、mL、個、g、小撮、g、mL、mL'),
(255, '泰式椒麻雞byranku210', '美國雞腿骨、高麗菜、地瓜粉、沙拉油、魚露、糖、冷開水、蒜末、辣椒末、檸檬汁、酒、醬油、五香粉、胡椒粉、糖', '2、0.25、0.5、、3、0.5、3、1、1、3、2、4、1、1、0.5', '255.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 0, 0, 3, '<hr><h1>1</h1><p>骨腿去骨、加入醃料拌醃2小時入味。</p> <hr><h1>2</h1><p>高麗菜切細絲、浸泡冰水10分鐘、瀝乾水份鋪於盤底。</p> <hr><h1>3</h1><p>取醃漬的骨腿沾上一層地瓜粉、置放反潮。</p> <hr><h1>4</h1><p>油鍋燒至7分熱、放入雞腿肉炸至金黃、撈起油溫續加熱至180℃\\n、將雞腿肉回炸10秒鐘立刻取出。</p> <hr><h1>5</h1><p>取利刀、用拍刀法將雞腿切成長條狀、置於高麗菜上。</p> <hr><h1>6</h1><p>淋上調味料即可趁熱食用。</p> <hr>', '支、顆、碗、適量、大匙、大匙、大匙、大匙、大匙、大匙、大匙、大匙、小匙、小匙、大匙'),
(256, '泰式麻辣椰奶麵', '麻辣麵、牛肉絲、丸子、豆腐、雞蛋、九層塔、檸檬汁', '1、300、1、0.25、1、、', '256.png', 'https://icook.tw/recipes/', 0, 1, 0, 0, 1, 1, 1, 0, 3, '<hr><h1>1</h1><p>食材如上圖</p> <hr><h1>2</h1><p>250cc冷水下丸子、水煮滾、打一顆蛋、下豆腐、下醬料包、1/3椰奶</p> <hr><h1>3</h1><p>蛋 快煮熟時下牛肉絲、牛肉絲快熟時可熄火下麵、放入九層塔、兩分鐘後盛起完成、再滴點檸檬汁即可享用</p> <hr>', '包、g、顆、包、顆、少許、少許'),
(257, '泰式香辣丁', '去骨雞腿肉、蒜末、洋?、魚露、白胡椒、糖、米酒、咖哩粉、玉米粉、泰式甜辣醬、糖、水', '2、适量、适量、1、、0.5、1、1、、3、1、', '257.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 3, '<hr><h1>1</h1><p>雞腿肉切丁、用醃料醃製2小時後、裹上玉米粉炸至金黃色撈起備用</p> <hr><h1>2</h1><p>另下油鍋爆香蒜末、洋蔥</p> <hr><h1>3</h1><p>加入醬汁煮滾至濃稠、倒入炸好的雞腿肉快速拌炒至裹上醬汁即可</p> <hr>', '隻、适量、适量、湯匙、少許、湯匙、湯匙、湯匙、適量、湯匙、湯匙、適量'),
(258, '泰式椰汁雞', '椰子、雞胸肉、椰子水、椰子肉、蘑菇、椰奶、辣椒、南薑、香茅、香菜葉、香菜根、檸檬葉、檸檬汁、砂糖、魚露、辣椒', '1顆、1盒、、、1包、200ml、、1大塊、1支、、3株、6片、、、、', '258.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1</h1><p>雞胸肉以鹽水醃漬</p> <hr><h1>2</h1><p>椰子水盛出、椰子頂端用鐵鎚敲開、以湯匙挖出椰肉</p> <hr><h1>3</h1><p>適量清水煮滾、加入椰子水、椰奶、南薑、香茅、香菜根、檸檬葉、辣椒煮滾</p> <hr><h1>4</h1><p>加入秀珍菇、雞胸肉、椰肉</p> <hr><h1>5</h1><p>以砂糖、魚露調味、熄火加入少許檸檬汁</p> <hr><h1>6</h1><p>燉好的湯盛入椰子中、辣椒、香菜葉點綴</p> <hr>', '顆、盒、適量、適量、包、ml、適量、大塊、支、適量、株、片、適量、適量、適量、適量'),
(259, '泰式雞肉綠咖哩', '薑黃粉、芫荽籽粉、白胡椒粉、鹽、開水、有心綠咖哩醬、南薑、檸檬葉、香茅、蒜末、紅蔥頭末、辣椒、九層塔、KARA 濃椰漿、雞棒腿切塊、泰國圓茄、魚露、棕櫚糖', '1、1、、、5、2~3、1、6、2、1、1、1~2、、100、1、1、、', '259.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1</h1><p>薑黃粉、芫荽籽粉、白胡椒粉少許、鹽少許、加5匙開水調成醃料、將洗淨的雞肉抓醃後冷藏。\\n我用的是印尼蝴蝶牌ketumbar bubuk。買不到芫荽籽粉、可以買芫荽籽、用乾鍋烘出香氣後、入調理機打碎。</p> <hr><h1>2</h1><p>圓茄洗淨、去蒂後剖半、泡入鹽水中</p> <hr><h1>3</h1><p>南薑去皮切片、香茅剝去外殼、切段後拍扁、檸檬葉摺疊後把葉柄撕除</p> <hr><h1>4</h1><p>蒜頭、紅蔥頭切末、辣椒切片</p> <hr><h1>5</h1><p>濃椰漿加適量開水調勻。我用的是KARA牌濃椰漿。</p> <hr><h1>6</h1><p>蒜末、紅蔥頭末爆香、加入香茅、南薑、檸檬葉炒香</p> <hr><h1>7</h1><p>加入綠咖哩醬、少許椰漿、炒至椰漿濃稠。我用的是泰國NAM JAI綠咖哩醬。</p> <hr><h1>8</h1><p>加入雞腿炒至逼出油脂</p> <hr><h1>9</h1><p>加入清水/雞高湯、椰漿煮滾</p> <hr><h1>10</h1><p>加入圓茄、蓋鍋燉煮15分鐘</p> <hr><h1>11</h1><p>魚露、棕櫚糖調味</p> <hr><h1>12</h1><p>撒上辣椒片、九層塔(只取葉子)</p> <hr>', '茶匙、茶匙、少許、少許、大匙、大匙、塊、片、支、茶匙、大匙、支、適量、ml、盒、袋、適量、適量'),
(260, '泰式打拋豬肉飯', '豬絞肉、蒜頭、辣椒、牛番茄、九層塔、米酒、醬油、砂糖、泰式魚露、檸檬', '0.5、3、、1、1、、2、2、3、1', '260.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 3, '<hr><h1>1</h1><p>備好食材：\\n1.蒜頭切末\\n2.牛番茄切小丁(若是小番茄大概5-6顆對切)\\n3.九層塔去硬梗\\n4.檸檬擠汁去籽</p> <hr><h1>2</h1><p>到入少許油、放入豬絞肉、淋一點米酒在肉上去腥、炒至半熟放入蒜末、辣椒(我不太吃辣所以省略)\\n\\n註1.油不必多、絞肉會再逼出一點油\\n註2.也可以放入半顆洋蔥丁與蒜末拌炒</p> <hr><h1>3</h1><p>1.絞肉差不多熟後放入番茄丁\\n2.再放入醬油2匙、糖2小匙、魚露3匙、繼續煨煮至番茄軟化</p> <hr><h1>4</h1><p>1.加入一把的九層塔\\n2.最後才淋上檸檬汁(檸檬汁煮久會苦)\\n3.嚐試味道、喜歡魚露味稍重的可以再加一點\\n\\n註：檸檬要去籽、吃的時候才不會咬到籽會苦 也會影響口感</p> <hr><h1>5</h1><p>盛飯淋上剛煮好的打拋豬即可享用</p> <hr>', '斤、顆、適量、顆、把、少許、匙、小匙、匙、顆'),
(261, '椰奶芒果飯', 'COCO FRESCO有機椰奶、COCO FRESCO有機椰蜜、白米、鹽巴、COCO FRESCO有機椰奶、COCO FRESCO有機椰蜜、鹽巴、玉米澱粉、芒果、芝麻', '200、4、2、0.25、200、2、0.5、1、2、', '261.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 3, '<hr><h1>1</h1><p>將22%椰奶、椰蜜及鹽巴混合備用</p> <hr><h1>2</h1><p>將醬汁加入剛煮好的白米中、用切拌方式拌勻</p> <hr><h1>3</h1><p>把飯放回蒸鍋小火蒸5分鐘(或電鍋1/4杯水)、接著悶20分鐘</p> <hr><h1>4</h1><p>依序將22%椰奶、椰蜜、鹽巴及玉米澱粉加入鍋中攪拌均勻\\n??先用淋醬溶化玉米澱粉再倒回去攪拌會比較均勻</p> <hr><h1>5</h1><p>將椰奶淋醬用小火煮滾</p> <hr><h1>6</h1><p>用小碗盛裝椰奶飯後倒扣至盤子上</p> <hr><h1>7</h1><p>將芒果切片後做成芒果花(切片後揮開並調整形狀、詳見影片)、完成後移至盤子上\\n??選擇較熟的芒果會比較好剝皮、不要太軟的芒果會比較好做成芒果花</p> <hr><h1>8</h1><p>在椰奶飯上淋椰奶淋醬</p> <hr><h1>9</h1><p>灑一些白芝麻在椰奶飯上</p> <hr><h1>10</h1><p>好吃椰奶芒果飯完成了????</p> <hr>', 'g、湯匙、杯、茶匙、g、湯匙、茶匙、湯匙、顆、適量'),
(262, '蔥蒜泰國蝦', '蔥、蒜、米酒、辣椒、泰國蝦', '8-10、10、1.5、1、12', '262.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 3, '<hr><h1>1</h1><p>備料大約300s(秒)\\n剁蔥蒜時、同步把海泰蝦從冷凍庫拿出來\\n沖水到隻隻分離**記住**\\n海泰蝦是活蝦急速抽真空冷凍\\n海水混養、產地直送\\n品質穩定又新鮮</p> <hr><h1>2</h1><p>真的不用退冰、只要潑水3-4次\\n每隻蝦子分離就可直接下鍋\\n保持最!新!鮮!!!鮮鮮鮮的狀態</p> <hr><h1>3</h1><p>仔細看、會發現蝦子身上有黑點白斑、就是鹽分的象徵\\n我還用剪刀從蝦背開殼、等等蔥蒜爆香的醬汁比較入味\\n接著修剪海泰蝦尖銳的螯腳\\n這樣吃的時候才不會被螯腳刺口!\\n瞧!肥美的海泰蝦螯腳好長、看起來就好新鮮</p> <hr><h1>4</h1><p>Step1.蒜頭和蔥白快炒爆香-30s\\nStep2.加入海泰蝦大火快炒-90s\\nStep3.倒入1.5碗米酒拌炒一下、蓋鍋悶煮-60s</p> <hr><h1>5</h1><p>Step4.蔥爆蝦看起來快好了、再炒一下收汁就好-20s\\n看著海泰蝦炒得啵啵作響、好療癒喔</p> <hr><h1>6</h1><p>Step5.加入蔥綠.鹽巴.辣椒和少許椒鹽快炒-30s\\n海泰蝦完全變紅色、米酒收汁就可上桌了</p> <hr><h1>7</h1><p>鮮紅的海泰蝦加上綠色蔥末、\\n食物原形的顏色、就是最美的調色\\n健康又美味的辦桌菜上桌囉!!</p> <hr><h1>8</h1><p>中型海泰蝦、每隻都胖胖肥肥好可愛\\n擺在食指旁邊、我的甜不辣短指都變得纖細啦</p> <hr><h1>9</h1><p>我喜歡親親海泰蝦吃起來的口感\\n又Q又彈、就像龍蝦肉\\n因為它們是海水混養的養殖場生長\\n海水鹽分比淡水高、促使海泰蝦肉質Q彈\\n彰顯料理後的蝦香氣</p> <hr><h1>10</h1><p>海泰蝦超好剝殼、代表蝦子很新鮮~~\\n肉質真的非常Q彈、不輸龍蝦肉</p> <hr><h1>11</h1><p>改天還想再試試看清蒸海泰蝦\\n嘗嘗純粹蝦的鮮甜</p> <hr>', '根、顆、碗、根、隻'),
(263, '夏日清爽料理～泰式椒麻雞', '去骨雞腿、高麗菜絲、蒜末、香菜末、辣椒、烏醋、醬油、水、魚露、檸檬汁、糖', '2、、5、1、1、1、1.5、、、0.5、1', '263.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 0, 0, 3, '<hr><h1>1</h1><p>準備好所有食材\\n雞腿可先醃漬過、更有風味\\n（加米酒、胡椒粉）</p> <hr><h1>2</h1><p>醃漬好的雞腿灑上地瓜粉</p> <hr><h1>3</h1><p>反潮後放入氣炸鍋200度15分鐘</p> <hr><h1>4</h1><p>等待雞腿的過程、調製醬料\\n把所有醬汁材料充分攪拌均勻</p> <hr><h1>5</h1><p>最後擺盤～高麗菜絲舖底、放上氣炸好的雞腿肉、最後淋上醬汁就可以上菜囉</p> <hr>', '支、適量、瓣、支、支、匙、匙、適量、適量、顆、小匙'),
(264, '泰式香茅炸蝦棒', '豬絞肉、蛋白、蒜頭、香菜根、芫荽籽、白胡椒/黑胡椒、醬油、鹽、糖、太白粉、香茅、辣椒、蒜頭、開水、白醋、砂糖、鹽、香菜、檸檬汁、牛番茄、小黃瓜、生菜', '300、1、4、4、1、1、1、1、1、1、4、5、3、8、2、3、、、、、、', '264.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 1, 0, 3, '<hr><h1>1</h1><p>白醋、砂糖、清水、鹽、入鍋煮滾</p> <hr><h1>2</h1><p>煮大約5分鐘會漸漸濃稠</p> <hr><h1>3</h1><p>加入辣椒片、蒜末、放涼冷藏數小時、上桌前以香菜葉點綴</p> <hr><h1>4</h1><p>搗香料時、左手蓋住缽、右手持杵</p> <hr><h1>5</h1><p>白胡椒/黑胡椒、芫荽籽、蒜頭、香菜根搗碎、胡椒依個人喜好擇一。</p> <hr><h1>6</h1><p>豬絞肉、(蝦絞肉)、香料泥、砂糖、醬油、(鹽、糖)、攪拌均勻</p> <hr><h1>7</h1><p>加入蛋白</p> <hr><h1>8</h1><p>加入太白粉、攪至產生黏性</p> <hr><h1>9</h1><p>香茅剝殼、洗淨</p> <hr><h1>10</h1><p>拍扁、拍到裂開(如圖中下方)會很難裹上肉餡喔</p> <hr><h1>11</h1><p>肉餡裹在香茅上、捏成雞腿狀</p> <hr><h1>12</h1><p>入氣炸鍋以180℃炸10分鐘</p> <hr><h1>13</h1><p>炸10分鐘後的樣子</p> <hr><h1>14</h1><p>再以200℃炸5分鐘</p> <hr><h1>15</h1><p>再炸5分鐘後的樣子</p> <hr><h1>16</h1><p>小黃瓜切條/切片、抹上檸檬汁</p> <hr><h1>17</h1><p>炸肉、生菜、沾醬擺盤</p> <hr><h1>18</h1><p>小支的我是180℃炸9分鐘、再以200℃炸2分鐘</p> <hr>', 'g、顆、瓣、株、茶匙、茶匙、茶匙、茶匙、茶匙、茶匙、支、支、瓣、大匙、大匙、大匙、少許、少許、適量、適量、適量、適量'),
(265, '泰式涼拌海鮮', '西洋芹、中卷、鮮蝦、小番茄、薑、香菜、辣椒、冰水、檸檬汁、魚露、細砂糖、辣椒', '100、160、160、100、10、10、1、、3.5、1.5、1.5、1', '265.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1</h1><p>準備好所有的食材、西洋芹削掉表面較粗的纖維、中卷洗淨去除內臟與表面的膜、鮮蝦去殼、小番茄洗淨去除蒂頭、薑切片、香菜切粗末、辣椒切圈</p> <hr><h1>2</h1><p>將中卷切成圈</p> <hr><h1>3</h1><p>將鮮蝦開背、去除腸泥</p> <hr><h1>4</h1><p>將西洋芹切小塊</p> <hr><h1>5</h1><p>將小番茄切成 1/3 大小或 1/2 大小、視小番茄大小而定</p> <hr><h1>6</h1><p>將所有調味料與香菜、辣椒混和均勻備用</p> <hr><h1>7</h1><p>準備一鍋水、冷水放入薑片開始煮、水燒開後撈去薑片</p> <hr><h1>8</h1><p>鍋中放入西洋芹燙 1.5 分鐘</p> <hr><h1>9</h1><p>撈起西洋芹放入冰水中冰鎮</p> <hr><h1>10</h1><p>再放入中卷、鮮蝦、燙 1.5 分鐘</p> <hr><h1>11</h1><p>撈起中卷與鮮蝦放入冰水中冰鎮</p> <hr><h1>12</h1><p>將冰鎮好的西洋芹、中卷、鮮蝦撈起瀝乾、再放入切好的小番茄、與調味料拌勻即可食用</p> <hr><h1>13</h1><p>好吃的泰式涼拌海鮮就可以上桌囉</p> <hr>', '克、克、克、克、克、克、根、適量、大匙、大匙、大匙、大匙'),
(266, '泰式涼拌海鮮二世', '蝦子（開背）、小卷（片）、九層塔（末）、蒜（末）、辣椒（末）、小黃瓜（片）、醬油、味霖、魚露、檸檬汁、糖', '6、0.5、1、3、1、0.5、1、1、1、0.5、1', '266.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1</h1><p>備料</p> <hr><h1>2</h1><p>川燙海鮮1分鐘、可放榨過汁的檸檬</p> <hr><h1>3</h1><p>放入冰水裡冰鎮、加入調味料</p> <hr>', '隻、隻、株、瓣、根、根、匙、匙、匙、個、匙'),
(267, '日式馬鈴薯燉肉', '馬鈴薯、紅蘿蔔、洋蔥、梅花火鍋肉片、水、鰹魚醬油、米酒、味霖、砂糖', '約200、約50、0.25、約150、、2、、1、1', '267.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 0, 0, 0, 0, 4, '<hr><h1>1</h1><p>備料、馬鈴薯切塊削去尖角、紅蘿蔔切塊、洋蔥切一公分厚條狀、肉片視情況切適口大小。</p> <hr><h1>2</h1><p>將肉一片一片置入鍋中煎至半熟、加入洋蔥拌炒直到出現香氣。</p> <hr><h1>3</h1><p>倒入紅蘿蔔與馬鈴薯稍微拌炒。</p> <hr><h1>4</h1><p>倒入調好的醬汁、加水至半淹過食材攪拌後即可關蓋小火悶煮。</p> <hr><h1>5</h1><p>約10分鐘後開蓋檢查馬鈴薯熟度、直到馬鈴薯可用叉子穿透、再蓋上蓋子用鑄鐵鍋餘溫靜置入味、上桌前再加熱一下。</p> <hr><h1>6</h1><p>加上青蔥絲裝飾、美味下飯的馬鈴薯燉肉完成!</p> <hr>', '克、克、顆、克、適量、大匙、大匙、大匙、小匙'),
(268, '日式唐揚炸雞', '去骨雞腿肉、白蘿蔔泥、蔥花、太白粉、檸檬、醬油、水、蒜末、白砂糖、醬油、香油、米酒、白胡椒粉', '2、1、、、、1、1、2~3、2、1、1、0.5、', '268.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 0, 0, 4, '<hr><h1>1</h1><p>去骨雞腿洗淨用廚房紙巾擦乾、切成一口大小塊狀放入碗中、加所有醃肉材料醃10~15分鐘</p> <hr><h1>2</h1><p>醃好的雞腿塊均勻裏上太白粉</p> <hr><h1>3</h1><p>靜置10分鐘反潮</p> <hr><h1>4</h1><p>所有淋醬材料放入小鍋中、小火煮至稍濃稠倒出備用</p> <hr><h1>5</h1><p>鍋中放油至可淹到雞塊的一半、燒熱、下雞塊半煎炸至金黃翻面、續煎雞塊至兩面金黃</p> <hr><h1>6</h1><p>撈起瀝油</p> <hr><h1>7</h1><p>盛盤、炸雞塊上放上白蘿蔔泥、淋上淋醬、擺上蔥花。檸檬切小塊放旁邊 、要多酸自己擠。</p> <hr>', '整塊、大匙、適量、適量、適量、大匙、大匙、瓣、小匙、大匙、大匙、大匙、少許'),
(269, '佛蒙特咖喱飯', '咖哩塊、雞腿肉、紅蘿蔔、馬鈴薯、洋蔥、玉米筍、起司條', '0.5、1、1、2、0.5、3、', '269.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 1, 1, 4, 4, '<hr><h1>1</h1><p>所有食材先洗淨、削皮、切成塊狀、洋蔥切碎</p> <hr><h1>2</h1><p>紅蘿蔔和馬鈴薯先放到電鍋蒸熟、外鍋一杯水</p> <hr><h1>3</h1><p>同時依序把洋蔥、雞肉、小玉米炒熟</p> <hr><h1>4</h1><p>加入蒸好的紅蘿蔔和馬鈴薯、及850ml的水、約煮5～10分鐘、建議蓋上鍋蓋煮比較快</p> <hr><h1>5</h1><p>等待的時候先將咖喱塊用熱湯慢慢溶解</p> <hr><h1>6</h1><p>倒入咖喱繼續煮約5分鐘</p> <hr><h1>7</h1><p>加一點起司條溶在裡面、邊煮邊攪一攪才不會黏在鍋底、起司是增加濃稠度、不一定要加</p> <hr><h1>8</h1><p>白飯上面也可以加一點起司</p> <hr><h1>9</h1><p>最後再把咖喱淋在上面就大功告成囉！</p> <hr>', '盒、盒、根、顆、顆、根、少許'),
(270, '日式鮮蝦炒烏龍', '洋蔥、青蔥、肉絲、鮮蝦、香菇、烏龍麵、醬油、烏醋、糖、水', '1/4、1、50、4、2、1、2、0.5、0.5、3', '270.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 0, 0, 4, '<hr><h1>1</h1><p>將洋蔥切絲、青蔥切段、香菇切片鮮蝦開背去腸泥（可略）\\n\\n醬汁混合備用（可依照個人口味調整鹹淡酸甜）</p> <hr><h1>2</h1><p>中小火熱鍋熱油、下洋蔥、蔥白爆香</p> <hr><h1>3</h1><p>將鮮蝦如果半煎炒至變紅、起鍋備用</p> <hr><h1>4</h1><p>加入香菇、肉絲拌炒至半熟</p> <hr><h1>5</h1><p>放入烏龍麵與醬汁拌炒至均勻沾附</p> <hr><h1>6</h1><p>放入蝦子、蔥綠拌炒收汁即可起鍋！</p> <hr>', '顆、支、克、隻（可略）、朵、人份、大匙、匙、匙、大匙'),
(271, '和風豚肉壽喜燒', '醬油、味霖、梅花肉、牛蒡、洋蔥、昆布、清酒、水、堅魚粉、糖、蛋', '50、50、200、70、0.25、2、30、300、1、10、2', '271.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 4, '<hr><h1>1</h1><p>洋蔥切絲、牛蒡切絲</p> <hr><h1>2</h1><p>梅花肉用保鮮膜塑型冷凍、至少需20分鐘</p> <hr><h1>3</h1><p>來料理醬汁、將醬油、味霖、洋蔥絲、牛蒡絲、昆布、水、清酒、糖、堅魚粉都下鍋、鍋開中火煮滾即可關火靜置</p> <hr><h1>4</h1><p>從冷凍庫取出梅花肉、拆開保鮮膜後切薄片片</p> <hr><h1>5</h1><p>煮開一鍋水、水滾後放入切好的肉川燙去腥、肉放入後開小火、泡水5分鐘就撈出</p> <hr><h1>6</h1><p>將川燙好的肉放入醬汁鍋中、開中火煮滾、煮滾後即可關火盛盤</p> <hr><h1>7</h1><p>蛋取蛋黃當醬汁、完成～</p> <hr>', 'ml、ml、g、g、顆、中片、ml、ml、匙、g、顆'),
(272, '日式味噌山苦瓜', '山苦瓜、鹽、蒜碎、辣椒、酒、味霖、味噌、昆布柴魚高湯', '1、、1、1、1、0.5、0.5、20', '272.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1</h1><p>苦瓜對半切去蒂去瓜囊、段切灑鹽抓勻備用.</p> <hr><h1>2</h1><p>取小鍋子、放入蒜碎、辣椒、酒、味霖及味噌、攪拌溶化味噌才開火.出香氣放入步驟1裹調味料.</p> <hr><h1>3</h1><p>倒入昆布柴魚高湯、邊拌邊加熱、煮至收乾即可.</p> <hr>', '條、少許、顆分、根、小匙、小匙、小匙、cc'),
(273, '爆漿起司麻糬', '糯米粉、熱開水、黑糖、白砂糖、起司片', '200、160、、、4', '273.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 1, 1, 0, 4, '<hr><h1>1</h1><p></p> <hr><h1>2</h1><p>煮開水這段時間\\n先將起司切好一片分六塊</p> <hr><h1>3</h1><p>熱水燒開後料理盆直接放在電子秤上面歸零\\n加入160克的熱水\\n加入後用筷子攪拌至棉絮狀</p> <hr><h1>4</h1><p>比較不燙手後可以開始揉麵\\n若太乾可以再加一點水\\n（揉到感覺有一點點成型手上沾上些許食用油、不然會黏的整手都是??）\\n柔至光滑、可以在旁邊放一小碗油、覺得有黏就沾一點油。</p> <hr><h1>5</h1><p>我給的配方糯米團可分切成12個小麵團\\n一個麵團包兩小片起司我是包成長方形的</p> <hr><h1>6</h1><p>都包好後就可以拿下去煎了\\n我包的很隨性\\n小火煎\\n（原本有12個。一個沒拿好掉地上了??）</p> <hr><h1>7</h1><p>小火慢慢煎到兩面金黃就可以了\\n看要沾砂糖或黑糖漿都可以\\n\\n黑糖漿作法\\n剛剛前面燒熱開\\n加一點進去黑糖裡在用小鍋小火煮至微微濃稠就可以了</p> <hr>', '克、克、適量、適量、片'),
(274, '花枝燒', '高麗菜、紅蘿蔔、花枝/透抽/章魚、低筋麵粉、雞蛋、蔥、柴魚片', '0.5顆~1、、300、150、2~3、、', '274.png', 'https://icook.tw/recipes/', 0, 1, 0, 0, 1, 1, 1, 0, 4, '<hr><h1>1</h1><p>先將高麗菜切成絲、隨性地搭配冰箱裡既有的紅蘿蔔、青蔥、或是豆芽也可以。</p> <hr><h1>2</h1><p>接著再處理花枝 (或是章魚)、鮮蝦、培根、豬肉片等想要一起加進去享用的食材。</p> <hr><h1>3</h1><p>蔥可以適喜好添加。</p> <hr><h1>4</h1><p>接著把所有食材通通放進大鍋子裡。然後以低筋麵粉 (或是鬆餅粉) 加入雞蛋、水之後攪拌至濃稠狀麵糊、就可以準備下鍋囉！</p> <hr><h1>5</h1><p>打開瓦斯爐、開始預熱。待鑄鐵鍋至水滴滴下去會馬上冒泡跳舞的時機點。此時就可將蔥段前端剪成細條狀充當油刷來將鐵鍋上油。</p> <hr><h1>6</h1><p>小撇步：用蔥油刷的好處在於上油的同時、可以順便讓油帶有蔥的香氣、一舉二得。</p> <hr><h1>7</h1><p>上油後、即可用湯杓盛上一瓢餡料至馬芬鑄鐵煎鍋中、約等待二至三分鐘、待麵糊成形、便可以陸續翻面。</p> <hr><h1>8</h1><p>由麵糊翻面至完成約五至六分鐘、相當簡單快速。</p> <hr><h1>9</h1><p>起鍋之後再淋上日式美乃滋跟日式蔬菜醬汁 (或是大阪燒醬汁)。</p> <hr><h1>10</h1><p>然後灑上蔥花跟柴魚片(也可以灑上海苔粉增添風味)即可享用大餐囉！</p> <hr>', '顆、適量、g、g、顆、適量、適量'),
(275, '日式蒲燒醬烤飯糰', '白飯、鹽、水、蒲燒醬', '3、0.5、0.5、2', '275.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 1, 4, '<hr><h1>1</h1><p>剛煮好的白飯稍微放涼至不燙手</p> <hr><h1>2</h1><p>將雙手用開水沾濕、並抹上適量的鹽。盛約半碗飯的量至手掌心、捏製成三角形。新手要徒手捏成漂亮的三角形不太容易、也可以使用飯糰的模具</p> <hr><h1>3</h1><p>平底鍋刷上適量的油、並用中火將飯糰雙面煎至金黃、約一面5分鐘。</p> <hr><h1>4</h1><p>轉至小火、並將飯糰雙面抹上蒲燒醬、煎至金黃。約單面在煎一分鐘即可。注意抹上醬汁後很容易焦、要儘快起鍋。蒲燒醬作法: https://thefabulouslifestyles.com/unagi-sauce/</p> <hr><h1>5</h1><p>完成</p> <hr>', '碗、小匙、杯、大匙'),
(276, '豆皮烏龍麵', '高湯、烏龍麵、味付豆皮(壽司豆皮)、海帶芽、香菇、紅蘿蔔、蟹肉棒等、醬油、米霖、鹽', '400、2、2、、、1、1、3/1~1/4', '276.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 4, '<hr><h1>1</h1><p>將烏龍麵煮軟備用</p> <hr><h1>2</h1><p>小湯鍋中放入高湯、水400ml、醬汁、除了豆皮之外的所有食材、煮滾約3分鐘</p> <hr><h1>3</h1><p>將麵放入碗中、食材夾出放在麵上、舀入湯 （可隨意撒上蔥花）、即完成一碗暖胃烏龍麵。</p> <hr>', 'ml、份、片、少許、隨意、大匙、大匙、小匙'),
(277, '茄汁蛋包飯', '蛋、飯、番茄醬、絞肉、高麗菜、玉米粒', '2、2、、、、', '277.png', 'https://icook.tw/recipes/', 0, 1, 1, 0, 1, 0, 0, 1, 4, '<hr><h1>1</h1><p>（備料：高麗菜切丁、兩顆蛋打散）\\n平底鍋預熱放一點點油、轉小火倒入一半的蛋液、小火煎成蛋皮備用（蛋皮兩人份要煎兩張）</p> <hr><h1>2</h1><p>蛋皮煎好放在盤子備用。\\n在鍋中放入少許油將絞肉炒鬆、在放入高麗菜炒到熟、在放入飯炒到鬆散、最後加入少許玉米粒和番茄醬繼續炒到微乾（炒飯的概念）</p> <hr><h1>3</h1><p>將炒好的飯包入蛋皮的一半、然後對折包起來</p> <hr><h1>4</h1><p>最後擠上剩餘的番茄醬就完成啦~~（注意因炒飯有放番茄醬了所以蛋皮上別擠太多避免過鹹</p> <hr>', '顆、碗、適量、少許、少許、少許'),
(278, '玉米起司可樂餅', '馬鈴薯、菱角、洋蔥丁、玉米粒、乾燥洋香菜、海鹽、黑胡椒、乳酪絲、麵粉、雞蛋、麵包粉、炸油', '5、100、1、、1、、、、、2、、', '278.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 0, 4, '<hr><h1>1</h1><p>馬鈴薯及菱角先蒸50分鐘、熟透。</p> <hr><h1>2</h1><p>鍋中放適量橄欖油、將洋蔥丁炒軟、釋放香氣及甜味、放涼備用。</p> <hr><h1>3</h1><p>將馬鈴薯搗碎、菱角切丁、加入洋蔥.玉米粒.洋香菜.海鹽.黑胡椒拌勻、再將乳酪絲包入中心、整型。</p> <hr><h1>4</h1><p>可樂餅依序表面裹上麵粉. 打勻雞蛋.麵包粉、下鍋油炸至金黃即可。</p> <hr>', '顆、g、顆、適量、g、適量、適量、適量、適量、顆、適量、適量'),
(279, '豬肉壽喜燒丼飯', '洋蔥、雙菇、蒟蒻、梅花豬肉片、雞蛋、辣椒、白芝麻、味霖、醬油、白糖或紅糖、白開水', '1、1、0.5、1、4、1、裝飾用、50、50、15～20、50～80', '279.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1</h1><p>洋蔥切絲、洗淨備用\\n蒟蒻切開、變成條狀、不要一朵朵\\n雙菇切尾、洗淨撥開備用\\n梅花豬肉片、切成一口大小</p> <hr><h1>2</h1><p>冷鍋冷油中火、放入洋蔥拌炒約略3分鐘</p> <hr><h1>3</h1><p>放入雙菇菇、拌炒3分鐘、火太大可以關中小火</p> <hr><h1>4</h1><p>把洋蔥、雙菇移到一旁、\\n放入梅花豬肉片拌炒2分鐘、\\n倒入味霖、醬油、白糖、白開水\\n攪拌均勻</p> <hr><h1>5</h1><p>加入蒟蒻絲拌炒、開中火煮滾\\n試喝湯汁味道夠味道嗎？\\n適自己喜歡的口味添加調味料</p> <hr><h1>6</h1><p>加入辣椒、煮滾後、\\n需要小火燉煮5分鐘後關火靜置</p> <hr><h1>7</h1><p>等要吃之前再度開火煮滾\\n淋上1/2蛋液、蓋上鍋蓋20秒\\n在淋上剩餘蛋液、蓋鍋蓋關火\\n悶30秒、即可淋在飯上</p> <hr><h1>8</h1><p></p> <hr><h1>9</h1><p>第二次蛋液悶30秒後的狀態\\n第二次蛋液不用到全熟哦\\n\\n要吃之前都有餘溫會繼續加熱</p> <hr><h1>10</h1><p></p> <hr>', '顆、包、盒、盒、顆、根、裝飾用、cc、cc、克、cc'),
(280, '日式豬排丼飯', '洋蔥、蔥、玉米筍、蛋、豬排、地瓜粉或麵包粉、鹽、黑胡椒、醬油、味霖、米酒、鏗魚粉、水', '0.5、1、2、2-3、1、2、些許、些許、3、1、1、0.5、1', '280.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 0, 0, 0, 4, '<hr><h1>1</h1><p>豬排廚房紙巾擦乾、些許鹽、黑胡椒醃10分鐘</p> <hr><h1>2</h1><p>洋蔥、玉米筍與醬料先下鍋煮至洋蔥半透明狀即可備用</p> <hr><h1>3</h1><p>準備幫豬排裹粉\\n先將蛋打勻、並將豬排沾上蛋液\\n豬排裹上麵包粉或地瓜粉\\n靜置2分鐘 即可下油鍋\\n油鍋冒泡 炸至兩面焦黃</p> <hr><h1>4</h1><p>加少許醬汁將蔥白切細倒入、煮滾後將丼飯醬汁全倒入、豬排也放至鍋內\\n將蛋液稍微打一下（不用太勻）均勻下至鍋內\\n\\n稍微翻動鍋子平均受熱 小火1-2分鐘蛋液稍微成行 撒上細蔥綠 即可盛至飯上</p> <hr>', '顆、條、根、個、片、大匙、些許、些許、大匙、大湯匙、湯匙、匙、匙'),
(281, '蔬菜絞肉咖哩烏龍麵', '豬絞肉、節瓜、咖哩塊、紅蘿蔔、洋蔥、蒜頭、雞蛋、青蔥、讚岐烏龍麵', '、1、0.5、1、1/3、3、1、酌量、1', '281.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 1, 1, 1, 0, 4, '<hr><h1>1</h1><p>洋蔥、蒜、紅蘿蔔切丁丁、節瓜切片、熱鍋把洋蔥用奶油炒到透明、放入蒜、紅蘿蔔炒、再放入絞肉並灑鹽、黑胡椒調味、加入節瓜一起拌炒香、倒入水蓋過料、煮滾後加入咖喱塊（一點一點慢慢加避免鍋底結塊）。</p> <hr><h1>2</h1><p>另一鍋煮烏龍麵和水煮蛋、把煮熟的烏龍麵加入咖哩鍋中（速度要快、烏龍麵煮一下下就好）、裝碗撒上蔥花、完成了！????</p> <hr><h1>3</h1><p>用冰箱剩下的豬絞肉和蔬菜一起煮成蔬菜絞肉咖哩、咖哩我是用佛蒙特咖哩塊蘋果口味、有點點甜甜的跟蔬菜很搭！配上日本超市買了讚岐烏龍麵、就做成咖哩烏龍麵、（烏龍麵超級Q彈好吃！）</p> <hr>', '適量、條、塊、條、顆、瓣、顆、酌量、份'),
(282, '日式烤飯糰', '白米、鮭魚、鰹魚麴風味料、橄欖油', '4、1、3、', '282.png', 'https://icook.tw/recipes/', 0, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1</h1><p>準備好所有食材</p> <hr><h1>2</h1><p>米洗淨後、倒入3米杯的水、加入3匙鮮選我-鰹魚?麴風味料。飯煮熟後、放冷備用</p> <hr><h1>3</h1><p>起油鍋、倒入1大匙的橄欖油、將鮭魚煎熟</p> <hr><h1>4</h1><p>將煎好的鮭魚去除魚刺、並壓碎、做為內餡備用</p> <hr><h1>5</h1><p>拿出模具、放入一層鮮選我鰹魚風味飯和鮭魚、再放入一層飯後用模具壓實</p> <hr><h1>6</h1><p>最後、用一點點油燒熱、將飯糰稍微煎過、「恰恰」的口感最剛好！家裡有烤箱的話、也可以用上下火180度、烤至外表微乾、呈現金黃色就可以上桌囉！</p> <hr>', '米杯、片、匙、少許'),
(283, '鯖魚味噌湯', '鯖魚、嫩豆腐、味噌、鮮選我?麴風味料', '1、1、、1', '283.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 4, '<hr><h1>1</h1><p>準備好所有食材</p> <hr><h1>2</h1><p>冷水中加入鯖魚塊和洋蔥、也可以切一些洋蔥、開大火等待水煮滾</p> <hr><h1>3</h1><p>待水煮滾後、加入味噌囉！能直接放入味噌拌勻、也可以先用熱水將味噌溶解後再加入</p> <hr><h1>4</h1><p>最後一步！加入1匙的鮮選我?麴風味料</p> <hr><h1>5</h1><p>完成囉</p> <hr>', '片、塊、適量、匙'),
(284, '日式咖哩嫩雞飯', '咖哩塊、雞里肌肉、洋蔥、紅蘿蔔、馬鈴薯、水', '1、1、0.5顆-1、1、2、1400', '284.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 1, 1, 0, 4, '<hr><h1>1</h1><p>備食材：\\n1.記得先煮飯\\n2.紅蘿蔔、洋蔥、馬鈴薯切塊\\n3.咖哩塊切小塊(等等比較好溶化)\\n4.一點點咖哩粉先醃製雞肉\\n\\n沒買馬鈴薯、所以我把冰箱剩的一根杏鮑菇一起下、順便清冰箱??。</p> <hr><h1>2</h1><p>下油先炒洋蔥到半透明狀、再倒入紅蘿蔔跟馬鈴薯稍微拌炒。</p> <hr><h1>3</h1><p>接著就可以下1400cc的熱水、悶煮10分鐘讓紅蘿蔔跟馬鈴薯軟化。\\n\\n註：若有燙花椰菜或是玉米筍、可使用燙後的菜水去煮。</p> <hr><h1>4</h1><p>紅蘿蔔跟馬鈴薯軟化後、才加入里肌肉煮3-5分鐘差不多剛好熟。\\n\\n註：因為雞肉有加入一點咖哩粉、所以不適合再步驟2先拌炒、這樣會燒焦。確保雞肉是嫩的、等蔬菜類軟化再下雞肉煮3-5分鐘剛好熟的狀態、這樣才不會煮太久雞肉都柴了。</p> <hr><h1>5</h1><p>先關火、倒入咖哩塊讓它們都溶化。</p> <hr><h1>6</h1><p>咖哩塊溶化後可以開小火、煮到稠狀就完成了、注意鍋底不能燒焦。</p> <hr>', '盒、盒、顆、條、顆、cc'),
(285, '韓式辣豆腐鍋', '麻油、洋蔥、蛤蠣、蒜頭、嫩豆腐、韓式辣椒醬、高湯、雞蛋、青蔥', '、1、0.5、3~5、1、1、1、1、', '285.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 1, 1, 1, 0, 5, '<hr><h1>1</h1><p>這道辣豆腐鍋算是韓國人家裡常煮的一道家常經典湯品、我這次用最簡單的方式製作、成本超低但是滋味完全不打折扣。\\n如果要快速上菜、真的可以來煮一鍋辣豆腐湯。</p> <hr><h1>2</h1><p>加快蛤蠣吐沙的小技巧有很多種、我是用滴食用油在泡蛤蠣的水裡的這個方式 ~\\n照片中不小心失手倒太多... 油量不用那麼多、幾滴就好、在用筷子稍微攪拌一下水面把油打散。\\n※ 注意：這種方式有可以會讓蛤蠣缺氧死掉、所以用這種方式吐沙的蛤蠣建議馬上烹煮吃掉。</p> <hr><h1>3</h1><p>洋蔥切絲、蒜頭切末備用。</p> <hr><h1>4</h1><p>在熱鍋中滴幾滴麻油、下韓式辣椒醬稍微拌炒</p> <hr><h1>5</h1><p>倒入洋蔥拌炒一下、再加入蒜末拌勻。</p> <hr><h1>6</h1><p>聞到蒜頭洋蔥的香氣後、馬上倒入高湯(或是熱水+湯粉)、待煮滾</p> <hr><h1>7</h1><p>然後加入稍微切塊的嫩豆腐和吐完沙的蛤蠣、蛤蠣開口後打顆蛋進去、關火。</p> <hr><h1>8</h1><p>撒上一些青蔥末、就可以大快朵頤一番。</p> <hr>', '適量、顆、斤、瓣、盒、大匙、L、顆、適量'),
(286, '超簡易韓式湯冷麵作法', '韓國泡麵、雞肉絲(可有可無)、綠辣椒(不辣)、蔥、小黃瓜、冰塊、水、醋、醬油、泡麵調味粉', '1、、1、1、1、、190、3、2、0.5', '286.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 5, '<hr><h1>1</h1><p>準備好所有食材\\n\\n選用「安城湯麵」的原因是:\\n安城湯麵的湯頭不會太濃、適合用來做冷麵的湯\\n麵條寬度剛好、太粗做冷麵不好吃</p> <hr><h1>2</h1><p>小黃瓜切絲\\n切蔥花\\n切綠辣椒\\n\\n食材的量可以自己做調整\\n因為我很喜歡吃小黃瓜、所以放特別多的小黃瓜絲</p> <hr><h1>3</h1><p>製作冷麵湯:\\n190ml的水、3湯匙醋、1湯匙糖、2湯匙醬油、?包泡麵調味粉\\n\\n之後攪拌均勻</p> <hr><h1>4</h1><p>煮水煮麵條\\n(另外準備一大碗冰水)\\n麵煮熟後、撈到冰水裡冰鎮一下\\n麵條會變的Q彈有勁</p> <hr><h1>5</h1><p>將冰鎮過的麵條瀝掉水分、加入特製冷麵湯、冰塊、小黃瓜絲、雞肉絲、蔥花組裝在一起、就變成了好吃的韓式湯冷麵囉! ??</p> <hr>', '包、適量、根、根、條、適量、ml、湯匙、湯匙、包'),
(287, '韓式糖醋肉', '豬里肌肉、紅椒、洋蔥、蘆筍、鹽巴、胡椒粉、蛋白、太白粉、水、沙拉油、水、二砂糖、白砂糖、醬油、檸檬、太白粉水', '400、0.25、0.5、4、1、1、1、150、150、30、300、50、50、20、0.5、', '287.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 1, 5, '<hr><h1>1</h1><p>首先里肌肉去除多餘筋膜\\n切小指長條備用</p> <hr><h1>2</h1><p>加入醃料抓醃到黏稠後冷藏兩小時</p> <hr><h1>3</h1><p>麵糊的太白粉跟水攪拌均勻冷藏半小時</p> <hr><h1>4</h1><p>半小時後倒掉水份留底下太白粉糊</p> <hr><h1>5</h1><p>加入沙拉油攪拌形成半固體的麵糊</p> <hr><h1>6</h1><p>加入里肌肉抓勻</p> <hr><h1>7</h1><p>170度油溫炸五分鐘</p> <hr><h1>8</h1><p>炸至表皮脆硬即可</p> <hr><h1>9</h1><p>紅椒、洋蔥、蘆筍切塊丟入秤好的醬汁中\\n檸檬、太白粉水先不放</p> <hr><h1>10</h1><p>水滾後先勾芡至濃稠</p> <hr><h1>11</h1><p>關火擠入檸檬汁完成糖醋醬汁</p> <hr><h1>12</h1><p>淋在肉上就可以享用囉</p> <hr><h1>13</h1><p>用檸檬代替白醋多了一些果香</p> <hr>', 'g、顆、顆、支、茶匙、茶匙、顆、g、g、g、g、g、g、g、顆、適量'),
(288, '韓式醃蘿蔔', '蘿蔔、白醋、糖、開水', '1、4、2、約300', '288.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 5, '<hr><h1>1</h1><p>全食材照</p> <hr><h1>2</h1><p>製作糖醋汁：糖2匙、白醋4匙、開水一碗、煮開將糖融解</p> <hr><h1>3</h1><p>關火前再下一湯匙醋、避免醋味因燒開而揮發、接著關火放置降溫、備用</p> <hr><h1>4</h1><p>白蘿蔔削皮兩層、口感比較好</p> <hr><h1>5</h1><p>蘿蔔切成一口大小</p> <hr><h1>6</h1><p>蘿蔔加入粗鹽、稍微抓醃去青</p> <hr><h1>7</h1><p>靜置20分鐘、直到出水後、蘿蔔口感比較好。倒入冷開水洗淨、瀝乾</p> <hr><h1>8</h1><p>將醋汁加入後、冰鎮一天就完成了。</p> <hr>', '根、湯匙、湯匙、ml'),
(289, '韓式神仙雪濃湯', '牛肉、薑、米酒、牛肋條、蔥花、鹽', '1、4、1、2、、2', '289.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 1, 0, 0, 0, 5, '<hr><h1>1</h1><p>?川燙去血水、雜質?\\n煮一大鍋水（至少淹過牛肉）、水滾之後下帶骨牛肉（有加牛肋條這步也要川燙）、大約五分鐘後雜質就會飄出來、可以再翻動一下、確認雜質都被滾出來了。</p> <hr><h1>2</h1><p>?過冷水再次洗淨?\\n此步驟是去除多於雜質、這步做的越確實、之後撈浮沫就越輕鬆。</p> <hr><h1>3</h1><p>?開始熬煮?\\n起一鍋水至少淹過牛肉、水越多越好、因?長時間熬煮、水份一定會大量流失。薑、米酒也一起下、就可以開始燉煮了。\\n\\n邊燉煮的過程、如有浮沫飄出來也要撈掉、這樣湯才會乾淨清甜！\\n\\n提醒：熬煮過程都要一直不斷補水</p> <hr><h1>4</h1><p>?熬至骨肉分離、冰入冰箱?\\n這步很重要、是幫助湯清甜無負擔的關鍵！湯熬煮至骨肉分離後、我會把肉取出分開放不繼續燉煮、薑也取出。骨頭繼續放在湯內、湯底冷卻後放入冰箱至牛油結塊。</p> <hr><h1>5</h1><p>?取出結塊的牛油?\\n也可以丟棄、我都留下來炒菜超香！</p> <hr><h1>6</h1><p>?繼續燉煮牛骨湯?\\n上桌前再燉煮個 1-2 小時、我猜應該約久越好、我前後加起來應該有燉個十小時。盛盤之前再把昨天分開的牛肉放入湯裡加熱。</p> <hr><h1>7</h1><p>?上桌?\\n上桌前、加上蔥花跟依喜好加鹽就是韓國最正宗的吃法摟！</p> <hr>', 'kg以上、片、碗、條、隨意、匙'),
(290, '韓式海鮮嫩豆腐辣湯鍋', '紅綠辣椒、蒜碎、蔥白、韓國辣醬、粗細辣椒、嫩豆腐、蛤蠣、鮮蚵、蛋、蔥綠、香油、芝麻', '、4、、2、2、1、0.5、0.5、1、、、', '290.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1</h1><p>蛤蠣放鹽吐沙\\n鮮蚵也是放鹽然後流水沖洗乾淨\\n動作要輕柔不要弄破了\\n蒜碎、蔥白、蔥綠、辣椒先切一切備好</p> <hr><h1>2</h1><p>熱鍋放 蒜頭 蔥白 辣椒 爆香\\n加入適量的水 辣醬 辣粉 煮滾\\n豆腐 蛤蠣 蛋 依序放入\\n等到蛤蠣開 蛋半熟 再放入鮮蚵\\n不然很容易太老縮水變小</p> <hr><h1>3</h1><p>灑上蔥綠跟芝麻\\n一點點韓國香油 就可以開動了</p> <hr>', '適量、瓣蒜頭、適量、兩大匙、大匙、盒、0.5斤、斤、顆、適量、適量、適量'),
(291, '泡菜汁炒洋蔥肉片', '泡菜湯汁、洋蔥切絲、蔥段、蒜泥、五花肉片、香油芝麻粒', '、1、、、、', '291.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1</h1><p>肉片洋蔥絲泡菜汁還有熱開水一杯全部放到鍋子裡開火</p> <hr><h1>2</h1><p>再放入蒜泥攪拌</p> <hr><h1>3</h1><p>洋蔥軟的肉也熟了再放入蔥段跟香油稍微攪拌就可以起鍋了</p> <hr><h1>4</h1><p>芝麻粒可以隨自己的喜好要不要加</p> <hr><h1>5</h1><p>這是做泡菜 剩下的湯汁會越放越酸也可以拿來煮泡麵和煮火鍋</p> <hr>', '適量、顆、適量、適量、隨意、適量'),
(292, '韓國傳統粉紅魚腸料理', '粉紅魚腸、麻油、醬油、橄欖油、蔥末、芝麻、辣椒、粉紅魚腸、鹽、雞蛋', '0.5、0.5、1、0.5、、、2、0.5、、2', '292.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 5, '<hr><h1>1</h1><p>準備食材</p> <hr><h1>2</h1><p>先切魚腸、辣椒、蔥\\n（我使用事先切好冷凍的蔥末就沒切了）</p> <hr><h1>3</h1><p>在平底鍋倒橄欖油、醬油</p> <hr><h1>4</h1><p>倒魚腸炒燉、稍微炒成褐色後、倒入辣椒、蔥末拌炒</p> <hr><h1>5</h1><p>最後倒麻油、撒芝麻就完成了</p> <hr><h1>6</h1><p>雞蛋加一點鹽準備</p> <hr><h1>7</h1><p>將切好的魚腸放入打散的雞蛋後、拿出來放平底鍋煎至兩面金黃</p> <hr>', '條、T、T、T、少許、少許、條、條、少許、顆'),
(293, '韓式新豬肉嫩豆腐鍋', '橄欖油、蔥花、蒜末、洋蔥、新豬肉230g、醬油、砂糖、韓國辣椒粉、嫩豆腐、雞蛋、水、金針菇、櫛瓜、雪白菇', '、、、、1包、、、、0.5盒、1顆、250cc、、、', '293.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 0, 5, '<hr><h1>1</h1><p>熱鍋下油炒蔥花</p> <hr><h1>2</h1><p>等炒出蔥香下洋蔥末和蒜末拌炒</p> <hr><h1>3</h1><p>下韓式辣椒粉、醬油、糖拌抄均勻起鍋備用</p> <hr><h1>4</h1><p>另拿一個鍋裝水、裡面放入櫛瓜、金針菇、雪白菇和嫩豆腐、還有剛炒好的醬料</p> <hr><h1>5</h1><p>煮滾後打一顆雞蛋</p> <hr><h1>6</h1><p>撒上蔥花、完成！</p> <hr>', '適量、適量、適量、適量、包、適量、適量、適量、盒、顆、cc、適量、適量、適量'),
(294, '簡易韓式飯捲', '米、白芝麻(已炒香)、芝麻油、鹽、雞蛋、紅蘿蔔(切絲)、小黃瓜(切絲)、火腿(切條)、海苔、竹簾', '2、、3-4、1、1、0.5、0.25、2、4、1', '294.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1</h1><p>將米煮成熟飯、加入鹽巴、白芝麻、芝麻油拌勻、放涼備用。</p> <hr><h1>2</h1><p>紅蘿蔔炒至變軟、雞蛋(需調味)切絲備用。</p> <hr><h1>3</h1><p>竹簾上放上海苔、加上米飯、可以稍微壓一下。在米飯上再放半張海苔(做出來較美)、再舖上餡料、從自己方向向外捲。</p> <hr><h1>4</h1><p>最後在飯捲外層抹上芝麻油、即成。</p> <hr>', '人份、適量、茶匙、茶匙、個、根、概、片、片、張'),
(295, '韓式涼拌黃豆芽', '黃豆芽、蒜未、鹽、醬油、糖、紅蘿蔔(切絲)、韓國麻油、白芝麻(已炒香)、蔥花', '300、2-3、0.5、1、1、50、1-2、、10', '295.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 1, 5, '<hr><h1>1</h1><p>先清洗荳芽菜、然後放到鍋裏燜煮3-4分鐘、紅蘿蔔切絲、一同放到鍋裏煮1分鐘。\\n取出後用白開水沖洗後瀝乾、以降溫備用</p> <hr><h1>2</h1><p>?此時可以將切好的蒜末及蔥花加到黃豆芽中拌勻、並放到冰箱中冷藏。</p> <hr><h1>3</h1><p>在食用前取出、並加入其餘的調味料拌勻、緊記調味料不要過早加入、不要黃豆芽會跑出很多水喔。</p> <hr>', 'g、瓣、茶匙、湯匙、茶匙、g、湯匙、適量、g'),
(296, '韓式柚子醬涼拌海帶芽', '乾燥海帶芽、洋蔥、白芝麻、黑麻油、柚子醬、白醋、海鹽', '30、0.5、1、1、2、1、1', '296.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 0, 1, 0, 5, '<hr><h1>1</h1><p>準備好所有食材</p> <hr><h1>2</h1><p>熱水泡發海帶芽</p> <hr><h1>3</h1><p>等待海帶芽泡發時、先來調製醬料、首先將柚子醬加入白醋拌勻、並加入些許鹽調味</p> <hr><h1>4</h1><p>黑麻油加入柚子醬拌勻</p> <hr><h1>5</h1><p>海帶芽泡發後、倒掉熱水、加入冷開水和冰塊冰鎮5分鐘、再把冰水倒掉備用</p> <hr><h1>6</h1><p>洋蔥絲加入海帶芽、如果家裡有辣椒也可以切片加入</p> <hr><h1>7</h1><p>淋上醬料、可以上桌囉</p> <hr>', '克、顆、大匙、大匙、大匙、大匙、鹽匙'),
(297, '韓式牽絲蛋餅', '蛋餅皮、乳酪絲、雞蛋、廣達香肉醬', '1、、2、1', '297.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 1, 1, 0, 5, '<hr><h1>1</h1><p>首先將蛋洗淨、敲入碗中並將蛋液攪拌均勻。</p> <hr><h1>2</h1><p>依個人口感、可將餅皮放入鍋中煎至酥脆。</p> <hr><h1>3</h1><p>接著倒入蛋液待半熟後、放置餅皮充份融合在一起。</p> <hr><h1>4</h1><p>適量將廣達香肉醬放至蛋餅上、增添韓式風味。</p> <hr><h1>5</h1><p>再酌量取乳酪絲放入蛋餅上、待乳酪絲融化後對摺蛋餅、即可盛盤上桌。</p> <hr>', '張、適量、顆、罐'),
(298, '韓式芝士泡菜豚肉蟹柳蛋絲紫菜卷', '雞蛋、黑椒、鹽、糖、壽司醋、麻油、米、豚肉、泡菜、韓式辣醬、水、蟹柳、芝士', '2、、、、1、、1、4、6-7、0.5、、1、2', '298.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 5, '<hr><h1>1</h1><p>1〉2隻雞蛋打勻後加入黑椒和鹽調味\\n2〉飯加入壽司醋及麻油拌勻\\n3〉韓式辣醬加入糖和水調味\\n4〉雞漿煎成蛋皮 \\n5〉卷起切絲備用\\n6〉泡菜剪碎後落鑊炒香備用\\n7〉豚肉切片後煎到半熟\\n8〉加入韓式辣醬炒勻備用\\n9〉紫菜鋪在竹??上 \\n10〉白飯平鋪在紫菜上</p> <hr><h1>2</h1><p>11〉加入豚肉片\\n12〉加入芝士\\n13〉加入蛋絲\\n14〉加入泡菜粒\\n15〉最後加入蟹柳\\n16〉一邊捲起一邊均勻按壓呈圓形卷物\\n17〉切開飯卷即成</p> <hr>', '隻、適量、適量、適量、湯匙、適量、杯、片（剪片）、片（剪碎）、湯匙、適量、條、片'),
(299, '韓式辣炒年糕', '韓式年糕、韓式魚板、高麗菜、洋蔥、蒜頭、鵪鶉蛋、泡菜、高湯、韓式辣醬、醬油、蜂蜜、砂糖、韓式辣粉', '1、3-4、3-4、0.25、3、6、、1、2、1、1、1、', '299.png', 'https://icook.tw/recipes/', 1, 1, 0, 0, 1, 1, 0, 1, 5, '<hr><h1>1</h1><p>備食材：\\n1.洋蔥切絲\\n2.蒜末\\n3.高麗菜切適口大小\\n4.年糕泡溫水3分鐘</p> <hr><h1>2</h1><p>蒜末先爆香、再下洋蔥</p> <hr><h1>3</h1><p>洋蔥炒至半透明狀加入醬料(辣醬2匙、醬油1匙、蜂蜜1匙、砂糖1匙及少許韓式辣粉)及1碗高湯\\n\\n註1.高湯我使用1碗熱水+1小匙鰹魚粉取代。\\n註2.辣度隨個人喜好添加、我不太吃辣、這樣辣度對我剛好。\\n註3.韓式辣粉主要調色用的??</p> <hr><h1>4</h1><p>稍滾後、下高麗菜</p> <hr><h1>5</h1><p>高麗菜差不多軟一點就可以下年糕、魚板及鵪鶉蛋\\n\\n註：魚板跟鵪鶉蛋可有可無、魚板我用甜不辣取代</p> <hr><h1>6</h1><p>最後下泡菜煨3分鐘收汁就好囉！\\n\\n註：沒泡菜也行、只是泡菜可以再增添一點泡菜酸味更好吃</p> <hr>', '包、片、片、顆、顆、顆、適量、碗、匙、匙、匙、匙、少許'),
(300, '韓式辣炒豬肉', '豬肉片、韓式辣椒醬、韓式辣椒粉、蒜仁、洋蔥、米酒、蠔油、白砂糖、芝麻油、蔥、黑胡椒、白芝麻、花生', '120、30、10、10、0.5、20、10、10、15、2、、、', '300.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 1, 0, 1, 5, '<hr><h1>1</h1><p>將豬肉切片、加入辣椒醬、辣椒粉、糖、蒜末、米酒、蠔油、黑胡椒粉、青蔥段、洋蔥片醃漬一小時以上。</p> <hr><h1>2</h1><p>熱鍋加適量芝麻油、放入醃好的豬肉下去拌炒3～5分鐘。</p> <hr><h1>3</h1><p>起鍋之前放入花生和灑上白芝麻、配上一些生菜包著吃剛剛好。</p> <hr>', 'g、g、g、g、顆、g、g、g、g、根、少許、少許、少許'),
(301, '韓式糖醋豆腐', '豆腐、蛋、太白粉、水、橄欖油、鹽、乾木耳、洋蔥、紅甜椒、胡蘿蔔、小黃瓜、高湯、醋、糖、番茄醬、太白粉、水、醬油、檸檬', '700、1、1、剛好蓋過澱粉、2、1、2-3、0.25、0.5、30、30、3/4、0.25、0.5、2、1、1、1、0.5-1', '301.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 0, 0, 0, 0, 5, '<hr><h1>1</h1><p>將主要食材裡的太白粉和水拌勻、蓋上保鮮膜放冰箱靜置一晚、用之前小心地拿出來、倒去浮在上面的水、粉跟蛋、鹽和油充分拌勻</p> <hr><h1>2</h1><p>木耳切小塊、洋蔥切丁、甜椒切條、胡蘿蔔和黃瓜切片</p> <hr><h1>3</h1><p>豆腐先用重物壓出水份、用廚房紙巾吸乾、切成魚柳條大小</p> <hr><h1>4</h1><p>放一張烤盤紙在烤盤上、再次攪拌粉漿、把每一條豆腐都裹上粉漿、把裹好的豆腐放在烤盤紙上</p> <hr><h1>5</h1><p>加熱足夠的油至180 C</p> <hr><h1>6</h1><p>把豆腐一條一條放入熱油裡、炸至表面的粉漿形成一個硬?、撈起瀝油、讓豆腐稍微降溫、不要一次過全下</p> <hr><h1>7</h1><p>把油過提高至195 C、再次油炸豆腐至金黃、撈起瀝油</p> <hr><h1>8</h1><p>先炒洋蔥、木耳和胡蘿蔔、下甜椒和所有調味料跟水、煮沸</p> <hr><h1>9</h1><p>太白粉和水拌勻、倒入醬汁裡、下黃瓜和檸檬汁、煮到有些稠就離火</p> <hr><h1>10</h1><p>把汁淋在豆腐上/沾著汁吃</p> <hr>', '克、顆、量杯、剛好蓋過澱粉、大匙、小匙、朵、個、個、克、克、量杯、量杯、量杯、大匙、大匙、大匙、小匙、個'),
(302, '韓式炸雞', '美國雞骨腿3支、麵粉、沙拉油、大蒜、香菜、韓國辣醬、番茄醬、糖、水、酒、鹽、五香粉', '3、0.5、、2、、3、2、1、0.5、3、0.5、0.5', '302.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 0, 1, 5, '<hr><h1>1</h1><p>骨腿去骨切塊狀、加入醃料拌醃半小時。</p> <hr><h1>2</h1><p>取雞腿塊沾上麵粉、入油鍋炸金黃後、撈起。</p> <hr><h1>3</h1><p>熱鍋加入少許的沙拉油、小火炒香蒜末、加入調勻的調味料炒勻、再入雞腿塊拌勻。</p> <hr><h1>4</h1><p>灑些香菜裝飾。</p> <hr>', '支、杯、少許、粒、少許、大匙、大匙、大匙、杯、大匙、小匙、小匙'),
(303, '蚵仔煎', '酥皮蚵仔煎粉、水、鮮蚵、小白菜、雞蛋、海山醬、番茄醬、太白粉、糖', '50g、125g、隨個人喜好、半把、2顆、20g、10g、6g、少許', '303.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 6, '<hr><h1>1</h1><p>調好粉漿/50g蚵仔煎粉+125g水</p><hr><h1>2</h1><p>蚵仔放入熱鍋煎至7分熟</p><hr><h1>3</h1><p>倒入調好的粉漿，等待待粉漿邊緣呈酥皮狀</p><hr><h1>4</h1><p>加入2顆全蛋均勻抹開，放入適量小白菜，待青菜熟後翻面，煎至恰恰後即可起鍋</p><hr>', 'g、g、隨個人喜好、把、顆、g、g、g、少許'),
(304, '虱目魚肚粥', '白飯、虱目魚肚、紅蔥頭蒜末、蔥、芹菜、小白菜/紅蘿蔔(可省略)', '兩人份、一、1-2、適量、適量、適量', '304.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 0, 0, 6, '<hr><h1>1</h1><p>倒一點油煎魚肚, 只需要煎魚肉的部分,魚皮可煎可不煎</p><hr><h1>2</h1><p>將煎差不多五分熟的魚肚取出, 加入紅蔥頭蒜末煎香</p><hr><h1>3</h1><p>加水、加白飯稍微拌一下, 加入魚肚開大火煮滾(如果有要放青菜的,也可以在這步驟放入)</p><hr><h1>4</h1><p>如果喜歡粒粒分明的粥, 滾後3分鐘就能關火調味(鹽巴、白胡椒)加芹菜青蔥了！</p><hr><h1>5</h1><p>封面圖的魚肚只煎魚肉部分, 粥的虱目魚味會比較重</p><hr>', '兩人份、片、瓣、適量、適量、適量'),
(305, '擔仔麵', '油麵、鮮蝦、綠豆芽、韭菜、肉燥、滷蛋、鮮蝦高湯、鹽、胡椒粉', '1、半、半、150、1、4、2000 、2、適量', 'caursed305.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 0, 1, 0, 6, '<hr><h1>1</h1><p>鮮蝦先去殼留尾, 綠豆芽也去尾鬚泡水, 韭菜切段狀備用.將蝦殼用一點油炒香, 加適量水去熬蝦高湯, 最後只取湯,最後加少許鹽即可. </p><hr><h1>2</h1><p>將剝殼留尾蝦子燙一下撈起備用.</p><hr><h1>3</h1><p>將事先煮好的肉燥加熱, 加入去殼的白蛋滷上色備用</p><hr><h1>4</h1><p>滷蛋對切備用</p><hr><h1>5</h1><p>雞胸肉直接下去炸至兩面金黃, 拿起抹點鹽巴及胡椒粉, 切片備用</p><hr><h1>6</h1><p>起水鍋, 先燙豆芽菜和韭菜再燙油麵撈起</p><hr><h1>7</h1><p>一碗將麵條, 夾入豆芽菜和韭菜, 放入幾片炸過雞胸肉, 蝦子, 蛋,淋上肉燥 </p><hr><h1>8</h1><p>最後加入高湯, 灑點胡椒粉提味即是一碗可口美味的擔仔麵.</p><hr>', '斤、斤、斤、克、碗、個、CC、小匙、適量'),
(306, '鍋燒意麵', '蔥、香菇、高湯、水、火鍋料、鍋燒麵、蛋、泡菜', '50、3、400、400、照自己喜歡、1、1、50', '306.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 0, 1, 6, '<hr><h1>1</h1><p>蔥切蔥花</p><hr><h1>2</h1><p>香菇去梗切十字花 梗切片備用</p><hr><h1>3</h1><p>高湯與水混合 加入香菇梗煮滾</p><hr><h1>4</h1><p>香菇與火鍋料燙熟備用</p><hr><h1>5</h1><p>取1陶鍋 加入高湯</p><hr><h1>6</h1><p>加入鍋燒意麵與粉包 煮2分鐘</p><hr><h1>7</h1><p>放入火鍋料 雞蛋</p><hr><h1>8</h1><p>蓋蓋子燜1分鐘 放上蔥花與泡菜</p><hr><h1>9</h1><p>完成</p><hr>', '克、朵、毫升、毫升、照自己喜歡、包、顆、克'),
(307, '炒米粉', '米粉、中里肌肉、乾香菇、紅蘿蔔絲、洋蔥、蝦米、蒜末、高麗菜、素蠔油、白胡椒粉、鹽巴、芹菜末', '300、10、8、半、1、2、1、1/4、3、2、1、1', '307.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 1, 1, 0, 6, '<hr><h1>1</h1><p>中里肌用(素蠔油半匙+白胡椒+玉米粉)醃</p><hr><h1>2</h1><p>高麗菜洗淨用手撥塊</p><hr><h1>3</h1><p>紅蘿蔔刨絲/香菇洗淨切絲泡水</p><hr><h1>4</h1><p>蝦米洗淨瀝乾</p><hr><h1>5</h1><p>湯鍋燙米粉(水滾即撈起備用)</p><hr><h1>6</h1><p>炒鍋用1匙油爆香香菇/蝦米</p><hr><h1>7</h1><p>香菇、蝦米有香氣後放蔥白、蒜頭</p><hr><h1>8</h1><p>有蔥蒜味香氣後放肉(用鹽、白胡椒、玉米粉醃過)</p><hr><h1>9</h1><p>肉要大塊也要嫩肉肉撈起避免老了,調味(白胡椒、蠔油、香菇水),放入高麗菜,加燙米粉的熱湯</p><hr><h1>10</h1><p>高麗菜微軟時倒入燙過的米粉 米粉要好吃關鍵:「悶」</p><hr><h1>11</h1><p>將肉片放回鍋中 米粉要好吃關鍵:「悶」,完成</p><hr>', '克、片、朵、碗、顆、大匙、大匙、顆、大匙、大匙、小匙、大匙'),
(308, '米粉湯', '新竹米粉、青蔥、大蝦、豬肉片、雞蛋、韭菜、芹菜、油、鹽、胡椒粉、香油、油蔥酥', '1、3、2、5、1、1、1、一、1、少許、少許、少許', '308.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 0, 6, '<hr><h1>1</h1><p>熱鍋，下油，將蔥段和油蔥酥爆香後，加入水煮沸後放入米粉和大蝦再度煮沸後撈起米粉和大蝦先放置碗公內。</p><hr><h1>2</h1><p>煮沸後放入豬肉片和一顆蛋，再度煮沸後，調味放入鹽巴，胡椒粉，(也可加入一點魚露)</p><hr><h1>3</h1><p>起鍋前放入切好的韭菜和芹菜滾一下，滴幾滴香油，將料湯再淋入先前放置好米粉湯的碗內即完成。</p><hr>', '束、枝、隻、片、個、小把、珠、大匙、茶匙、少許、少許、少許'),
(309, '萬巒豬腳', '豬蹄膀、蔥、薑、蒜頭、滷包、醬油、黑糖、冰糖、紹興酒、蠔油、蒜頭、砂糖、水', '2、2、1、5、1、2、2、2、1、3、2、1、1', '309.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 1, 0, 1, 6, '<hr><h1>1</h1><p>準備蔥段、去皮蒜頭、薑片和滷包，準備來滷肉</p><hr><h1>2</h1><p>煮一鍋滾水加兩片薑片，豬蹄膀放進去煮10分鐘，直到骨頭沒有血水流出、肉呈現白色，把豬蹄膀取出，用清水沖乾淨</p><hr><h1>3</h1><p>另起油鍋，將蔥白、薑、蒜頭爆香，加入冰糖和黑糖拌炒至溶化成糖漿，加入醬油煮到小滾</p><hr><h1>4</h1><p>把醬汁和辛香料倒入壓力鍋中，再加入紹興酒、滷包、蔥綠，把水加到淹過豬蹄膀。我用電子壓力鍋的悶肉模式煮35分鐘，煮完後自動洩壓悶30~50分鐘。如果在爐子上煮，則是中小火滷50~60分鐘，悶1小時左右</p><hr><h1>5</h1><p>滷好的豬蹄膀的皮要上色、形狀完整、Q而不爛</p><hr><h1>6</h1><p>把豬腳夾起來放到烤箱或氣炸鍋400F(200C)烤個5~8分鐘，翻另一面再繼續烤，烤過的豬皮會更有彈性更好吃</p><hr><h1>7</h1><p>豬腳放涼後，去掉中間的骨頭，將豬腳切片</p><hr><h1>8</h1><p>蒜蓉沾醬: 把蒜頭磨成泥，加入蠔油(或醬油膏)、水和糖，就是美味的蒜泥沾醬</p><hr>', '支、支、小塊、顆、包、小碗、大匙、大匙、小碗、大匙、顆、茶匙、大匙'),
(310, '薑母鴨', '土番鴨、老薑、黑麻油、米酒、薑母鴨專用藥材、高麗菜、金針菇、米血、豆皮、凍豆腐、冬粉、鹽、 冰糖', '1、2、120、2、1、適量、適量、各1', '310.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 1, 1, 3, 6, '<hr><h1>1</h1><p>老薑切薄片狀, 鴨剁成塊狀, 其他配菜洗乾淨 - 高麗菜、金針菇、米血、豆皮、凍豆腐、冬粉 備用</p><hr><h1>2</h1><p>薑母鴨專用藥材1包</p><hr><h1>3</h1><p>起鍋熱適量油，把薑半煎炸至燒捲起, 放入鴨肉塊拌炒至外表赤赤的, 加入麻油, 米酒2瓶及薑母鴨專用藥材1包</p><hr><h1>4</h1><p>放入鴨肉塊拌炒至外表赤赤的,加入麻油,米酒 2瓶及薑母鴨專用藥材1包</p><hr><h1>5</h1><p>炒到至外表赤赤的</p><hr><h1>6</h1><p>加入麻油,米酒2瓶及薑母鴨專用藥材  1包, 再加入2瓶的水量</p><hr><h1>7</h1><p>最後加入甘蔗頭,加蓋用小火燜煮1小時</p><hr><h1>8</h1><p>最後放入所有配菜煮熟即可</p><hr><h1>9</h1><p>成品裝盤可享用. ( 可不沾醬吃, 享受食物原味, 也可調醬汁來沾這吃. )</p><hr>', '隻、大根、ml、瓶、包、適量、適量、大匙'),
(311, '鱔魚意麵', '鱔魚、洋蔥、高麗菜、蔥段、炸過蒜末、豬油、油炸碗形意麵、太白粉水、香油、鹽、醬油、糖、烏醋、白醋、米酒、味精、水', '半、1/2、1/8、2、1、3、2、少許、少許、1/2、1/2、2、4、1、少許、少許', '311.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 0, 0, 0, 0, 6, '<hr><h1>1</h1><p>鱔魚先清水洗過，加入米酒及醋抓拌靜置一會再以清水沖洗</p><hr><h1>2</h1><p>切片段(2~3公分)備用 (魚頭不要)。P.S.鱔魚切段前以斜刀來回輕輕的剁(菱格紋)，目的把骨頭略略切斷，以避免魚骨影響口感。</p><hr><h1>3</h1><p>將蒜頭切碎，放入油鍋內炸蒜頭酥，炸好後將蒜油及蒜酥分別置放備</p><hr><h1>4</h1><p>起油鍋, 快火快炒鱔魚片加入炸蒜末拌炒後先撈起備用</p><hr><h1>5</h1><p>高麗菜切片狀, 洋蔥切粗絲, ?切段備用</p><hr><h1>6</h1><p>油炸碗形意麵</p><hr><h1>7</h1><p>原鍋下少許油, 下蔥段, 洋?炒香炒軟, 再下高麗菜拌炒一下,加少許水, 調味後水滾再加入意麵拌炒, 最後加入炒過的鱔魚,以太白粉水勾芡，起鍋前淋上香油即完成。</p><hr><h1>8</h1><p>調味後水滾再加入意麵拌炒, 最後加入炒過的鱔魚,以太白粉水勾芡，起鍋前淋上香油即完成。</p><hr>', '斤、顆、顆、支、大匙、大匙、個、少許、少許、小匙、小匙、大匙、大匙、大匙、少許、少許'),
(312, '蚵仔麵線', '蚵仔、地瓜粉、紅麵線、細油蔥酥、柴魚片、紅蔥頭、水量、醬油、胡椒粉 、鹽、糖、太白粉水、紅蔥頭油、蒜泥、香菜、烏醋、紅辣豆瓣醬', '約200、適量、約250、約90、約15、約60、3000、2、1、3、3、約1、5、適量、適量、適量、適量', '312.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 0, 1, 6, '<hr><h1>1</h1><p>油蔥酥，用桿麵棍磨碎。紅麵線 ，若太長可分剪成段。香菜，洗乾淨用手分折段備用。</p><hr><h1>2</h1><p>用濾網裝蚵仔，用大量水泡洗一下，洗完再洗一次(洗時小心別洗破蚵仔，也別浸泡，會產生細菌)。</p><hr><h1>3</h1><p>蚵仔，瀝乾水份，一顆顆裹上薄薄一層地瓜粉(可用篩網濾除多餘的粉)</p><hr><h1>4</h1><p>平底鍋，放入適量熱水，一顆顆放入，煮滾至蚵仔浮起，約煮一分鐘(蚵仔一定要煮熟)，即可撈起來泡入冷水中、降溫。</p><hr><h1>5</h1><p>蚵仔撈起來泡入冷水中、降溫。</p><hr><h1>6</h1><p>紅蔥頭，切片。鍋中倒入5大匙油，紅蔥頭放入小火爆香後過濾只留油，即成紅蔥頭油。</p><hr><h1>7</h1><p>準備煮麵線要加的調味。</p><hr><h1>8</h1><p>紅麵線，用冷水泡一會變軟撈起，這步驟可沖洗掉紅麵線本身的一些鹽份。</p><hr><h1>9</h1><p>湯鍋水量約3000C.C，煮滾後將柴魚片放入瀘網中，在滾水中攪拌一會煮出味道，即成柴魚高湯。</p><hr><h1>10</h1><p>湯鍋中，加入1醬油、2鹽和糖、3細油蔥酥、4胡椒粉。</p><hr><h1>11</h1><p>放入紅麵線，蓋上鍋蓋煮10分鐘。</p><hr><h1>12</h1><p>倒入太白粉水芶芡，邊倒邊攪拌。最後再加入紅蔥頭油拌勻(此時可依狀況，另外再加入一些份量外的太白粉水芶芡)</p><hr><h1>13</h1><p>將麵線舀入碗內，加入蒜泥(別加太多)、適量烏醋、放上蚵仔和香菜，吃辣的人可再加紅辣豆瓣醬，「蚵仔麵線」完成</p><hr>', '公克、適量、公克、公克、公克、公克、C.C、大匙、小匙、大匙、大匙、碗、大匙、適量、適量、適量、適量'),
(313, '當歸鴨', '淨鴨、老薑片、當歸鴨中藥材、水、鹽、冰糖、當歸酒、米酒', '1、6、3000、小匙、大匙、少許、適量', '313.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 6, '<hr><h1>1</h1><p>淨鴨是脫毛, 去頭, 爪, 翅的鴨, 洗淨切塊, 先川燙後再用清水洗淨備用.</p><hr><h1>2</h1><p>起水鍋放入當歸藥材包, 將鴨翅, 頭, 先放入一起用小火熬湯</p><hr><h1>3</h1><p>熬出香味來放入川燙過鴨肉及薑片 再熬煮約1.5小時. ( 記得米酒最後放, 鴨肉比較不會吃起來硬硬的)</p><hr><h1>4</h1><p>調味後可盛碗, 淋上當歸酒更是對味.</p><hr>', '隻、片、CC、小匙、大匙、少許、適量'),
(314, '廣東粥', '白米、皮蛋、豬肉、油條、芹菜、橄欖油、鹽、豬大骨、食用水、洋蔥、乾干貝、鹽', '4、6、300、半、半、適量、適量、3、6、3、15、適量', '314.png', 'https://icook.tw/recipes/', 0, 1, 1, 1, 1, 0, 1, 1, 7, '<hr><h1>1</h1><p>白米洗淨，倒入橄欖油與少許鹽巴，像醃漬肉類一樣拌均勻。接著把米放入冷凍庫，放半天。</p><hr><h1>2</h1><p>熬高湯，將高湯所有食材水、豬大骨、洋蔥、乾干貝放在一起，大火煮滾後轉小火上蓋慢悶1小時。時間到後掀蓋下鹽，鹽的調味可以稍重些沒關係，等等煮粥後就會剛好。</p><hr><h1>3</h1><p>時間到後，過濾出大骨、洋蔥與雜質。乾干貝過濾出來後撥成絲狀再放回去。</p><hr><h1>4</h1><p>取出醃漬好的白米，將適量的高湯倒入鍋中，微火慢煮，煮製米湯合一，成為粥底。過程直中要持續攪拌，避免黏鍋。</p><hr><h1>5</h1><p>要熬到像這樣的稠度粥底才算完成，大概就是你攪拌時的痕跡不會馬上恢復的濃稠狀態。※熬煮過程可以加入濕豆皮，可以讓粥底顏色更乳白漂亮。</p><hr><h1>6</h1><p>接著皮蛋下水鍋煮熟後撈起入冷水降溫，剝殼切塊。</p><hr><h1>7</h1><p>肉切成絲，冷凍還沒完全解凍但已經有點軟的狀態是最好切的時候。</p><hr><h1>8</h1><p>水滾後下肉絲關火，快速燙幾秒後撈出。</p><hr><h1>9</h1><p>將切好的皮蛋放入粥底。</p><hr><h1>10</h1><p>補上肉絲。</p><hr><h1>11</h1><p>使用前鋪上一點切碎的老油條，撒上少許芹菜末、白胡椒，簡單版的廣東粥就告完成。</p><hr>', '杯、顆、g、條、根、適量、適量、支、斤、顆、g、適量'),
(315, '乾炒牛河', '河粉、牛?肉、洋蔥、豆芽、薑、蔥、生抽、老抽、糖、太白粉、水、麻油、生抽、老抽、糖、鹽', '300、150、半、100、2、2、1、1/2、1/4、1、1、1/4、3、1、1、1/4', '315.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 1, 1, 0, 7, '<hr><h1>1</h1><p>牛肉逆紋切成3mm薄片，用醃料醃製15分鐘；洋蔥切絲；薑切片切絲；豆芽菜洗淨去尾；蔥洗淨切段，分成蔥白蔥綠備用。</p><hr><h1>2</h1><p>熱鍋2湯匙油，下牛肉及薑絲，大火快炒把牛肉炒至 8成熟取出備用。</p><hr><h1>3</h1><p>下洋蔥加少許水炒至軟身後，加入蔥白和豆芽炒熟。</p><hr><h1>4</h1><p>再下河粉及所有調味料，用筷子攪拌均勻並不停炒約兩三分鐘。</p><hr><h1>5</h1><p>最後加蔥綠，並倒回炒好的牛肉拌勻即成。</p><hr>', 'g、g、顆、g、片、根、湯匙、茶匙、茶匙、茶匙、湯匙、茶匙、湯匙、湯匙、茶匙、茶匙'),
(316, '臘味飯', '白米、臘腸、肝腸、醬油、醬油膏或蠔油、味醂、黑胡椒粉', '2、3、2、1、1、1、1/4', '316.png', 'https://icook.tw/recipes/', 0, 1, 1, 1, 1, 0, 0, 0, 7, '<hr><h1>1</h1><p>製做臘味飯的所有食材</p><hr><h1>2</h1><p>臘腸肝腸洗淨後，先用叉子在表面戳一些洞，讓味道比較能夠釋放出來</p><hr><h1>3</h1><p>米洗淨後，放入電子鍋內鍋，再加入與米量相同份量的水（使用電鍋亦可，外鍋像煮飯一樣放 1 米杯水）</p><hr><h1>4</h1><p>將臘腸與肝腸平放放入（如果太大根可以如圖一樣切一半），使用煮飯模式開始煮</p><hr><h1>5</h1><p>等待煮飯的過程中將醬油膏、醬油、味醂、黑胡椒粉混和均勻成醬汁備用</p><hr><h1>6</h1><p>煮飯時間到後，悶 10 分鐘再開蓋，將臘腸與肝腸夾出</p><hr><h1>7</h1><p>將米飯翻鬆，再悶五分鐘</p><hr><h1>8</h1><p>將夾出的臘腸與肝腸切片</p><hr><h1>9</h1><p>將飯放入容器中，鋪上切好的臘腸與肝腸，再淋上醬汁即成。</p><hr>', '米杯、根、根、大匙、大匙、小匙、小匙'),
(317, '港式蝦仁腸粉', '再來米粉、太白粉、澄粉、水、沙拉油、鮮蝦、醬油、糖、水', '120、15、10、500、10、數隻、40、5、10', '317.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 1, 7, '<hr><h1>1</h1><p>將鮮蝦去殼去腸，用少許鹽和白胡椒粉調味，備用</p><hr><h1>2</h1><p>將所有材料放入碗內拌勻</p><hr><h1>3</h1><p>在蒸盤上塗上一層菜油，倒入一層薄薄的粉漿。用大火蒸2 -3 分鐘，看見表面有氣泡即可</p><hr><h1>4</h1><p>鮮蝦腸粉：在粉皮上放兩至三隻蝦，然後捲起，再用大火蒸三分鐘</p><hr><h1>5</h1><p>最後淋上醬油即成！</p><hr>', '克、克、克、毫升、毫升、數隻、毫升、克、毫升'),
(318, '白切雞', '仿仔雞腿(母雞)、米酒、薑泥(醃雞用)、?(醃雞用)、鹽、薑泥(醬料用)、?(醬料用)、鹽(醬料用)、沙拉油、香油', '一、3、1、1、1到1.5、1、2、1/2、5、1', '318.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 7, '<hr><h1>1</h1><p>?、薑泥、米酒、鹽醃上兩到三小時或隔夜。除了鹽，一隻雞腿大約一小匙到一小匙半，其它則隨意。</p><hr><h1>2</h1><p>燒一大鍋可以蓋過雞腿的水，待水滾後，將醃雞腿的?放入水一起煮，再加些米酒和鹽進去。</p><hr><h1>3</h1><p>然後將雞腿放入水裏約三秒再立即取出， 等水再度滾起，就將雞腿放入後熄火，悶50分鐘。</p><hr><h1>4</h1><p>50分鐘後取出，將雞腿泡冰水20分鐘即可切塊。</p><hr><h1>5</h1><p>接下來是港式燒臘店常會附的?油。一般店裏都不太可能放太多，做法很簡單,自己做，吃起來最痛快。</p><hr><h1>6</h1><p>先把薑磨成泥，再把?切碎一點，用鹽抓一抓，醃個20分鐘。</p><hr><h1>7</h1><p>醃好的?薑末再撒點白胡椒粉（或不撒也可以，也有吃過放沙薑粉的）</p><hr>', '隻、大匙、小匙、支、小匙、小匙、支、小匙、大匙、小匙'),
(319, '豉油雞', '老抽、生抽、糖、鹽、水、雞、薑、蔥（切段）', '1.5、2、1.5、少量、2、一、4、1', '319.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 0, 1, 0, 7, '<hr><h1>1</h1><p>先將雞洗淨，把薑蔥切好放入雞肚（記得剪掉倒屁股喔），雞爪也要剪出來，不用掉。將生抽、老抽、鹽、糖、開水放在碗中搞拌。</p><hr><h1>2</h1><p>熱鑊後倒入醬汁，醬汁（醬汁起碼要浸過半隻雞）滾開放入雞（雞背向下）。先用大火煮1分鐘然後再轉中火，同時把醬汁灌一些在雞肚中先煮5分鐘。</p><hr><h1>3</h1><p>其余三面至少煮8分鐘以上，過程中可以把醬汁淋在雞面上，令色澤更好看。雞爪是用來固定雞身，以免在煮的過程雞身會倒下，所以記得放一齊煮喔。（煮的過程要蓋鑊蓋）</p><hr><h1>4</h1><p>待最後一面煮好時要用大火收汁至稠身即可。</p><hr>', '湯匙、湯匙、茶匙、少量、碗、隻、片、束'),
(320, '蜜汁叉燒飯', '梅花肉、雞蛋、青江菜、白米飯、叉燒醬、醬油、蠔油、米酒、蜂蜜、砂糖、洋?碎、白胡椒粉、五香粉、蒜碎、薑碎', '一、一、兩、一、二、一、一、一、二、二、1/4、適量、適量、兩、兩', '320.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 1, 0, 0, 7, '<hr><h1>1</h1><p>準備好所有的食材</p><hr><h1>2</h1><p>將所有的醃料與梅花肉拌勻</p><hr><h1>3</h1><p>包上保鮮膜放置冰箱一夜，可讓醃料的味道更入味</p><hr><h1>4</h1><p>滾水中加入少許鹽，燙青江菜</p><hr><h1>5</h1><p>烤箱預熱2分鐘，烤盤鋪上錫紙，將烤網置在第二層，用200度將梅花肉烤30分鐘</p><hr><h1>6</h1><p>烤肉的過程需二次將食材取出翻面，並塗上蜂蜜醬再進烤箱加熱。</p><hr><h1>7</h1><p>將烤好的叉燒肉取出來，待放至溫熱時切成片即可食用。</p><hr><h1>8</h1><p>不沾鍋加少許橄欖油用模具煎出漂亮的花朵造型蛋</p><hr><h1>9</h1><p>將白米飯置於中央，再將食材擺盤即可上桌！</p><hr>', '塊、顆、朵、碗、大匙、大匙、大匙、大匙、大匙、大匙、顆、適量、適量、顆、片'),
(321, '港式蘿蔔糕', '蘿蔔、水、在來米粉、玉米粉、白胡椒粉、鹽巴、水、香菇、臘腸、油蔥酥\n', '400、400、200、50、適量、適量、300、20、兩、適量', '321.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 7, '<hr><h1>1</h1><p>臘腸切丁、泡好香菇切丁</p><hr><h1>2</h1><p>利用臘腸逼出來的油炒香菇 加入白胡椒粉、油蔥酥，然後盛起來備用</p><hr><h1>3</h1><p>蘿蔔刨粗絲加入水煮滾</p><hr><h1>4</h1><p>然後把臘腸、香菇倒入蘿蔔水那鍋煮滾之後直接沖入剛調好的粉漿，在爐上拌至均勻</p><hr><h1>5</h1><p>倒入玻璃保鮮盒放入電鍋蒸,外鍋2杯半的水,電鍋跳起來就好</p><hr><h1>6</h1><p>蒸好後放涼可以放冰箱保存</p><hr><h1>7</h1><p>隔天煎來吃</p><hr>', 'g、g、g、g、適量、適量、g、g、根、適量'),
(322, '蝦肉燒賣', '黃色雲吞皮、大蝦、生粉/栗粉、鹽、胡椒粉', '13、40、2、1、1', '322.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 1, 7, '<hr><h1>1</h1><p>先把蝦清洗好並把清理乾淨蝦腸</p><hr><h1>2</h1><p>加上生粉</p><hr><h1>3</h1><p>用手攪均勻</p><hr><h1>4</h1><p>攪均勻1分鐘之後，沖洗一下水。把生粉弄乾淨</p><hr><h1>5</h1><p>用廚房紙巾擦乾蝦</p><hr><h1>6</h1><p>用刀子把蝦壓成蝦泥（這樣就有蝦滑的感覺）</p><hr><h1>7</h1><p>在蝦泥上加胡椒粉和鹽</p><hr><h1>8</h1><p>放一張雲吞皮在大拇指和食指上，慢慢加蝦泥並壓住底部</p><hr><h1>9</h1><p>蒸大概10分鐘就可以吃了！</p><hr>', '片、隻、湯匙、小茶匙、小茶匙'),
(323, '港式老火湯', '白菜、紅蘿蔔、豬骨、蜜棗、南杏、陳皮、水、鹽', '600、400、600、5、30、1、6、適量', '323.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 7, '<hr><h1>1</h1><p>豬骨燙川10分鐘，去除血水，洗淨瀝乾，白菜洗淨，紅蘿蔔去皮滾刀切，陳皮用水浸軟?去皮內的囊。</p><hr><h1>2</h1><p>燒滾6L水，將所有材料放入煲內，中火煲30分鐘後，轉稍微一些火繼續煲90分鐘，按個人喜好下鹽調味。</p><hr>', 'g、g、g、粒、g、個、L、適量');
INSERT INTO `allrec` (`ID`, `name`, `ing`, `num`, `img`, `link`, `heartattack`, `pneumonia`, `diabetes`, `Lower_respiratory_tract`, `hypertension`, `Nephritis`, `Liver`, `total`, `type`, `step`, `unit`) VALUES
(324, '麻婆豆腐', '板豆腐、水A、鹽、橄欖油、生蒜泥醬、薑末、蔥白、絞肉、醬油、米酒、辣豆瓣醬、冰糖、高湯、辣油、樹薯粉、水B、蔥花', '1、1800、25、6、4、3、5、350、40、21、35、15、336、2、5.1、15、7', '324.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 0, 1, 8, '<hr><h1>1</h1><p>將所有主要使用到的食材先清點準備好，幫助後續料理過程更為順利喔</p><hr><h1>2</h1><p>將板豆腐切成1x1x1公分的塊狀</p><hr><h1>3</h1><p>水A＋鹽煮滾，板豆腐下鍋，水滾即可撈起濾乾，待用</p><hr><h1>4</h1><p>熱鍋下橄欖油，加入生蒜泥醬、薑末、蔥白，用中小火拌炒出香氣飄出</p><hr><h1>5</h1><p>加入絞肉拌炒至絞肉出水且變熟白</p><hr><h1>6</h1><p>加入醬油、米酒、辣豆瓣醬、冰糖，拌炒均勻，絞肉帶有醬色</p><hr><h1>7</h1><p>加入高湯及辣油拌勻</p><hr><h1>8</h1><p>加入板豆腐，稍微撥動豆腐，確保豆腐皆浸泡於醬汁中，轉小火燉煮約3~5分鐘(以豆腐上色入味狀態判別)</p><hr><h1>9</h1><p>將太白粉及水B拌勻後，倒入鍋中，倒入時邊輕輕拌攪，避免勾芡水預熱瞬間結塊，煮滾即可起鍋</p><hr><h1>10</h1><p>盛盤後撒上蔥花，要吃時，先將蔥花拌攪入麻婆豆腐中，多盛點飯，非常開胃喔</p><hr>', '塊、克、克、克、克、克、克、克、克、克、克、克、克、克、克、克、克'),
(325, '回鍋肉', '橄欖油、蒜碎、五花肉片、五香豆干、豉留香、黑豆豉、金美好醬油、紹興酒、蒜苗、青椒、辣椒片、切斷的芹菜', '30、5、250、180、1、1、15、15、2、1、2、3', '325.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 8, '<hr><h1>1</h1><p>冷鍋加入橄欖油，放入蒜碎爆香</p><hr><h1>2</h1><p>放入五花肉片、五香豆干拌炒</p><hr><h1>3</h1><p>加入豉留香、黑豆豉</p><hr><h1>4</h1><p>倒入金美好醬油、紹興酒</p><hr><h1>5</h1><p>再加入蒜苗、切好的青椒、辣椒片、芹菜切段，拌炒就完成囉!</p><hr>', 'cc、顆、公克、公克、大匙、大匙、cc、cc、支、顆、條、株'),
(326, '酸辣湯', '筍絲、紅蘿蔔絲、黑木耳絲、豆腐絲、肉絲、金針菇、豬血絲、雞蛋、香菜、蔥花、高湯、白醋、白胡椒粉、太白粉水、醬油', '300、0.6、50、300、300、1、200、3、適量、適量、4000、200、50、適量、少許', '326.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 8, '<hr><h1>1</h1><p>將材料切絲備妥，粗細大小一致才容易一起煮熟，肉絲用米酒醬油太白粉醃一下</p><hr><h1>2</h1><p>紅蘿蔔絲用一些油炒一下，加高湯，接著就可以慢慢的將材料放進去需要久煮得先下，易熟的慢放</p><hr><h1>3</h1><p>下調味料，醬油調色，醋跟白胡椒的味道要略重才夠味勾芡汁後才下蛋汁，湯滾一下就關火，讓蛋液泡熟</p><hr><h1>4</h1><p>撒上蔥花、香菜、香油就可以吃了</p><hr>', 'g、條、g、g、g、包、g、顆、適量、適量、cc、cc、g、適量、少許'),
(327, '宮保雞丁', '雞柳、醬油（醃雞肉）、蒜粉（末）（醃雞肉）、香油（醃雞肉）、鹽（醃雞肉）、花椒、乾辣椒、辣豆瓣醬、蒜粉（末）、蔥', '1、半、1、適量、1、1/3、半、1、1、1/3', '327.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 8, '<hr><h1>1</h1><p>將醃雞肉的香料、醬料加入後封上保鮮膜，將雞肉冰入冰箱約2小時</p><hr><h1>2</h1><p>熱鍋後倒入油，油熱後下雞肉將雞肉煎至金黃後蓋上鍋蓋悶至其熟透，並取出備用。</p><hr><h1>3</h1><p>使用煎雞肉後的餘油，放入花椒爆香後將花椒取出。</p><hr><h1>4</h1><p>放入1湯匙蒜粉（末）、乾辣椒半飯碗及一湯匙的辣豆瓣，將其翻炒香。</p><hr><h1>5</h1><p>加入雞肉、蔥拌炒後即可出鍋</p><hr><h1>6</h1><p>因醃漬肌肉時也有加入鹽巴、醬油，另外烹煮時加入的辣豆瓣也有鹹味，則不需再加入調料。</p><hr>', '盒、湯匙、湯匙、適量、小湯匙、湯匙、飯碗、湯匙、湯匙、飯碗'),
(328, '魚香肉絲', '肉絲、洋蔥、黑木耳、蔥、蒜、薑、鹽、糖、太白粉、胡椒粉、醬油、辣豆瓣醬、醋、糖、米酒、辣椒醬', '250、半、4-5、1、2、2、1、1/4、3、1/4、2、2、1、1、1、1', '328.jpg', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 0, 0, 0, 8, '<hr><h1>1</h1><p>洋蔥、黑木耳、薑切成條狀；蒜切片；蔥切段。</p><hr><h1>2</h1><p>肉絲加太白粉、鹽、胡椒粉、糖醃10分鐘左右。然後中大火燒熱油，倒入肉絲快炒，炒至7分熟左右撈起備用。</p><hr><h1>3</h1><p>用炒肉絲的油，爆香蒜和薑，然後加入醬油、辣豆瓣醬、糖、醋、米酒、辣椒醬和一碗半水煮沸。</p><hr><h1>4</h1><p>放入洋蔥和黑木耳快炒。</p><hr><h1>5</h1><p>炒至洋蔥略軟時，加入肉絲翻炒。</p><hr><h1>6</h1><p>在起鍋前，加入蔥段略炒。</p><hr><h1>7</h1><p>煮至醬汁濃稠後即可起鍋。</p><hr>', 'g、個、朵、枝、瓣、片、茶匙、茶匙、茶匙、茶匙、湯匙、湯匙、茶匙、茶匙、茶匙、茶匙'),
(329, '口水雞', '去骨雞腿排、小黃瓜、薑、蔥、蒜泥、油、醬油、糖、老乾媽、白芝麻、白胡椒', '1、2、4、1、少許、適量、1、1、2、少許、少許', '329.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 1, 1, 0, 8, '<hr><h1>1</h1><p>小黃瓜切斷拍扁+鹽殺青、去除多餘水份，擺盤。</p><hr><h1>2</h1><p>去骨雞腿肉抹鹽巴、酒、白胡椒醃一下。</p><hr><h1>3</h1><p>水+薑+蔥+酒煮熟雞肉撈起，切好擺盤。</p><hr><h1>4</h1><p>油+蒜泥炒香+老乾媽+醬油+糖（也能加醋）略炒，關火，淋在雞肉上，灑上白芝麻。</p><hr>', '片、根、片、根、少許、適量、大匙、小匙、大匙、少許、少許'),
(330, '辣子雞丁', '去骨雞腿肉、熟毛豆仁、薑末、辣椒、甘甜滷醬油、豆瓣醬、米酒、糖、烏醋', '2、50、1、2、1、1、2、1、1', '330.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 0, 0, 0, 8, '<hr><h1>1</h1><p>準備食材，去骨雞腿肉去皮切小塊(約1.5公分立方體)，辣椒洗淨切片。</p><hr><h1>2</h1><p>鍋裡放入2大匙油脂，雞肉放入煎到熟成</p><hr><h1>3</h1><p>放入薑末、辣椒片拌炒出香氣</p><hr><h1>4</h1><p>下調味料</p><hr><h1>5</h1><p>煮至醬料收稠</p><hr><h1>6</h1><p>最後加入熟毛豆仁拌炒一下，就可以盛盤上桌</p><hr>', '片、g、大匙、根、大匙、大匙、大匙、大匙、小匙'),
(331, '麻辣水煮魚', '魚片、蒜頭、薑、乾辣椒、香油、香菜或青蔥、西洋芹或黃豆芽、豆瓣醬、水或高湯、花椒、八角、月桂葉、乾辣椒、油、米酒、椒鹽、玉米粉、香油', '3、2、1、1、少許、適量、3、1-2、2、1、1、1、1、1-2、1、1少許、1、少許', '331.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 1, 0, 0, 8, '<hr><h1>1</h1><p>把魚片切塊（不要切太小塊，不然煮了都會縮太小）用米酒、椒鹽、香油和太白粉醃漬均勻。*醃漬的動作可以在煮的前一個小時做好</p><hr><h1>2</h1><p>把西洋芹切細和川燙，備用。</p><hr><h1>3</h1><p>五香油：放入1-2湯匙的油，加入花椒、八角、月桂葉和乾辣椒，煮至香味四溢。備用。</p><hr><h1>4</h1><p>在另一個鍋子裡放入油，切碎的蒜頭、切碎的薑和乾辣椒，煮至香味四溢</p><hr><h1>5</h1><p>加入豆瓣醬、水或高湯（我是加入剛剛燙青菜的水）煮滾。再加入醃好的魚片（不用煮太久，不然魚片會縮太小）</p><hr><h1>6</h1><p>把燙好的青菜撲在底部，再把水煮魚放在上面，最後淋上熱熱的五香油。灑一點青蔥或香菜。</p><hr>', '片、瓣、小段、把、少許、適量、根、大匙、大碗、大湯匙、粒、片、把、湯匙、小湯匙、少許、大湯匙、少許'),
(332, '蒜泥白肉', '五花肉、蒜泥、醬油、辣椒油、花椒油、砂糖', '1、6、3、5、2、1', '332.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 0, 0, 8, '<hr><h1>1</h1><p>五花肉洗淨。</p><hr><h1>2</h1><p>放進沸水煮20 分鐘。</p><hr><h1>3</h1><p>切成薄片。</p><hr><h1>4</h1><p>將醬汁淋上五花肉片的表面上。</p><hr><h1>5</h1><p>即可食用。</p><hr>', '塊、大匙、大匙、大匙、小匙、小匙'),
(333, '仰望星空派', '虱目魚一夜干、虱目魚肚、雞蛋、紅蘿蔔、馬鈴薯、洋蔥、花椰菜、白醬', '6-8、1、3、1-2、1、1、1-2、適量', '333.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 1, 1, 1, 0, 11, '<hr><h1>1</h1><p>洋蔥末、馬鈴薯塊、紅蘿蔔丁、薑片。</p><hr><h1>2</h1><p>將虱目魚肚去刺切塊。</p><hr><h1>3</h1><p>魚肚塊和魚頭一夜干，鋪薑片、淋米酒和黑胡椒粒。</p><hr><h1>4</h1><p>取一鍋水煮開，紅蘿蔔煮三分鐘撈起、花椰菜煮一分鐘撈起，馬鈴薯則是煮至筷子可搓過。</p><hr><h1>5</h1><p>煮三顆蛋約十分鐘。</p><hr><h1>6</h1><p>馬鈴薯灑鹽巴和胡椒，拌成泥。</p><hr><h1>7</h1><p>白煮蛋切片。</p><hr><h1>8</h1><p>烤箱上下火200度，預熱十分鐘。</p><hr><h1>9</h1><p>鍋內不放油，煎虱目魚肚至金黃。</p><hr><h1>10</h1><p>烤盤底部放入洋蔥末、白煮蛋片，中間部分放虱目魚肚、白醬，抹平均後灑上紅蘿蔔丁、花椰菜，再抹上一層白醬。</p><hr><h1>11</h1><p>擺上魚頭一夜干 、 起司，上下火200度烤20-30分鐘就完成了！</p><hr>', '片、片、顆、根、顆、顆、把、適量'),
(334, '威靈頓牛排', '牛排（最好是菲力）、薄片火腿、香菇、派皮、鵝肝醬、橄欖油、黃芥末、鹽巴、黑胡椒、蛋黃', '2、10-12、約20、兩、適量、適量、適量、少量、少量、3', '334.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 1, 11, '<hr><h1>1</h1><p>香菇用紙巾擦乾淨髒汙後切小塊放入攪碎機，加一點鹽巴跟黑胡椒後攪成泥狀</p><hr><h1>2</h1><p>接著把攪成泥狀的菇醬放平底鍋，把水分炒乾，平底鍋內不要放油</p><hr><h1>3</h1><p>香菇富含水分，會大量出水，水分炒乾約需要15-20分鐘</p><hr><h1>4</h1><p>炒出水分後會變成深色一坨，取出放一旁</p><hr><h1>5</h1><p>然後準備牛排，牛排灑上粗鹽跟黑胡椒</p><hr><h1>6</h1><p>然後熱鍋放油，準備油封牛排橄欖油大量的放，不用省，等鍋跟油熱了之後放牛排，一面煎一分鐘</p><hr><h1>7</h1><p>一分鐘之後翻面再煎一分鐘，接著把牛排側邊立起大概煎30-45秒，四邊都要煎</p><hr><h1>8</h1><p>取出油封後的牛排</p><hr><h1>9</h1><p>整個抹上滿滿的黃芥末，芥末不要選有大顆粒的</p><hr><h1>10</h1><p>然後撕一大張保鮮膜墊著，在保鮮膜上舖火腿</p><hr><h1>11</h1><p>然後把剛剛炒好的香菇醬一半鋪在火腿上</p><hr><h1>12</h1><p>接著把鵝肝醬塗在香菇醬上，這個動做不是必須，沒有鵝肝醬也沒關係</p><hr><h1>13</h1><p>然後把沾滿黃芥末的牛排放上</p><hr><h1>14</h1><p>然後像捲壽司一樣的用底下的保鮮膜把火腿包著牛排捲起，然後兩邊像糖果包裝一樣捲緊，接著放冰箱冷藏20分鐘塑形，然後重複同樣步驟做第二捲</p><hr><h1>15</h1><p>二十分鐘到了之後，一樣先鋪保鮮膜，然後在保鮮膜上放上派皮</p><hr><h1>16</h1><p>接著拿出剛剛的火腿牛排捲，然後拆開保鮮膜，把火腿捲放在派皮正中心</p><hr><h1>17</h1><p>在派皮的周圍塗上蛋黃液，然後把派皮蓋上火腿捲</p><hr><h1>18</h1><p>接著兩邊也一樣蓋上然後一樣用底下的保鮮膜把包上派皮的火腿牛排捲起，記得捲緊，接著放冰箱冷藏10分鐘</p><hr><h1>19</h1><p>十分鐘之後拿出，拆開保鮮膜，在派皮光滑沒有收口的那面塗上蛋黃液</p><hr><h1>20</h1><p>然後用刀在表面輕劃出葉片紋路，這時候要在表皮灑一點粗鹽，然後就可以放入氣炸鍋啦！200度25分鐘</p><hr><h1>21</h1><p>氣炸完之後起鍋等10分鐘再切，肉汁才不會流出</p><hr>', '塊、片、朵、片、適量、適量、適量、少量、少量、顆'),
(335, '炸魚薯條', '麵粉、雞蛋、水、泡打粉、鹽、黑胡椒粉、白魚肉、胡蘿蔔 (切條, 事先燙熟)、櫛瓜 (切條)', '1、1、1、1、適量、適量、2、1.5、1/2', '335.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 1, 0, 11, '<hr><h1>1</h1><p>將麵糊中的所有材料攪勻</p><hr><h1>2</h1><p>白魚肉表面撒上少許麵粉(份量外), 均勻的裹上一層麵糊. 入油鍋中炸至兩面金黃即可</p><hr><h1>3</h1><p>將胡蘿蔔及櫛瓜條加入剩餘的麵糊中, 一樣入油鍋炸至兩面金黃</p><hr>', '米杯、顆、米杯、小匙、適量、適量、片、根、條'),
(336, '蘑菇雞肉派', '雞肉、韭蔥leek （可用青蔥取代）、蘑菇、燻肉丁（或培根）、法式酸奶油、雞高湯、麵粉、奶油、市售酥皮、雞蛋、月桂葉、百里香', '250、半、一、50、兩、一、一、適量、視烤盤大小而定、一、一、少許', '336.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 1, 1, 0, 11, '<hr><h1>1</h1><p>雞肉切丁之後稍微灑點鹽跟胡椒抓醃</p><hr><h1>2</h1><p>雞肉跟燻肉丁下鍋用奶油煎</p><hr><h1>3</h1><p>煎雞肉的同時切蔥，切完加到鍋子裡跟雞肉一起炒約五分鐘</p><hr><h1>4</h1><p>加入蘑菇與麵粉炒一分鐘</p><hr><h1>5</h1><p>加入雞高湯與香料煮滾之後中小火煮20分鐘，加入法式酸奶油 cr?me fra?che</p><hr><h1>6</h1><p>最後湯汁收乾到大約如圖所示的程度</p><hr><h1>7</h1><p>雞肉餡入烤盅，鋪上酥皮刷上雞蛋液，入烤箱180度烤到皮酥赤黃（約10-15分鐘）</p><hr><h1>8</h1><p>搭配清燙蘆筍就是健康美味的一餐了</p><hr>', 'g、支、把、g、大匙、杯、湯匙、適量、視烤盤大小而定、顆、片、少許'),
(337, '英式餡餅', '高筋麵粉、植物起酥油或牛羊板油、人造奶油或奶油、鹽、冷水、牛肉、馬鈴薯、紅蘿蔔、洋蔥、鹽、現磨黑胡椒、人造奶油或奶油、蛋汁', '250、60、12、1/2、88、175、175、100、88、適量、適量、1、1/2', '337.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 0, 1, 0, 11, '<hr><h1>1</h1><p>將麵粉、起酥油、鹽、人造奶油或奶油、水倒入攪拌機中，揉麵8-10分鐘至麵團表面光滑有光澤</p><hr><h1>2</h1><p>以保鮮膜包起置於冰箱中鬆弛30分鐘至1小時</p><hr><h1>3</h1><p>馬鈴薯削皮，和蕪菁甘藍、洋蔥、牛肉皆切成小塊1立方公分的小塊，放入大碗中混勻，以鹽和胡椒調味</p><hr><h1>4</h1><p>拿出麵糰，切成兩半，滾圓再桿開，形成直徑約25公分的圓形</p><hr><h1>5</h1><p>烤盤鋪上烘焙紙，烤箱預熱到攝氏150度</p><hr><h1>6</h1><p>將內餡鋪在派皮的半圓上，放上1小球奶油，蓋上另一半的派皮，以手指按壓邊緣以確保密封，再以叉子壓上壓紋</p><hr><h1>7</h1><p>將餡餅移到烤盤上，表面刷上蛋液</p><hr><h1>8</h1><p>放入烤箱中層，烘烤約45分鐘直到表面金黃，若約35分鐘時派皮尚未上色，則將烤溫調高10度</p><hr>', 'g、g、g、小匙、ml、g、g、g、g、適量、適量、小球、個'),
(338, '西米烤布丁', '西米、牛奶、淡奶、雞蛋、鹽、糖、無鹽奶油、吉士達粉', '50、250、50、1、適量、50、20、15', '338.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 11, '<hr><h1>1</h1><p>先把西米煮熟，瀝水備用。</p><hr><h1>2</h1><p>將雞蛋、吉士達粉、淡奶拌勻至完全沒有顆粒。</p><hr><h1>3</h1><p>將牛奶、糖、鹽、無鹽奶油煮至有小泡泡便可。此時可將西米和蛋液倒進鍋中拌勻。</p><hr><h1>4</h1><p>將混合物倒進模中約九分滿，並於烤盤注入一半熱水，180度烤10-15分鐘即可。</p><hr>', 'g、g、g、顆、適量、g、g、g'),
(339, '牧羊人派', '牛絞肉、紅蘿蔔、西芹、洋蔥、地瓜、番茄醬、啤酒、鹽、牛骨高湯、黑胡椒、迷迭香', '兩人份、2、2、1、2、酌量、半、少許、酌量、少許、少許', '339.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 0, 0, 0, 11, '<hr><h1>1</h1><p>準備好食材，準備開始把所有蔬菜切丁丁。</p><hr><h1>2</h1><p>在平底鍋中倒入橄欖油，用中火把洋蔥丁炒軟並放入蒜末，接著放入芹菜丁、紅蘿蔔丁一起拌炒至軟。</p><hr><h1>3</h1><p>加入牛絞肉一起炒熟（炒個10～12分鐘）。</p><hr><h1>4</h1><p>倒入1/2啤酒煨煮，加入少許番茄糊，至酒精蒸發，加少許鹽、黑胡椒、迷迭香調味。</p><hr><h1>5</h1><p>同時把2條地瓜削皮，放入電鍋蒸20分鐘，取出搗成泥狀（地瓜我就沒有再調味了，我覺得天然甜甜的就很好吃了）。</p><hr><h1>6</h1><p>取一個烤盤，把牛絞肉蔬菜鋪在底下鋪平，再抹上厚厚地瓜泥（這時可疑用湯匙背面抹出一勺一勺的痕跡來看起來更可愛），放進預熱好的烤箱。</p><hr><h1>7</h1><p>200度烤30分鐘，完成了！！</p><hr><h1>8</h1><p>牧羊人派的歷史緣由我就不多贅述了，總之最後出爐的牧羊人派每一口都帶著鬆軟的地瓜泥的甜味和蔬菜牛絞肉炒過的肉香，一湯匙舀下去真的是雙層美味！</p><hr>', '兩人份、條、條、顆、顆、酌量、罐、少許、酌量、少許、少許'),
(340, '蘭開夏羊肉鍋', '羊肩肉、洋蔥、紅蘿蔔、牛番茄、馬鈴薯、大蒜、牛肉乾、無鹽奶油、水、迷迭香、百里香、月桂葉、巴西里、鹽、黑胡椒', '300、100、100、2、1、20、40、20、600、0.5、0.5、1、適量、適量、適量', '340.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 1, 1, 1, 11, '<hr><h1>1</h1><p>羊肩肉先用鹽、黑胡椒調味後，放入鍋中煎至上色。</p><hr><h1>2</h1><p>接著放入洋蔥塊、紅蘿蔔塊翻炒，再加入牛番茄塊、蒜碎炒香後，加入無鹽奶油、水、牛肉乾、迷迭香、百里香跟月桂葉。最後加入鹽與黑胡椒調味，煮滾之後關火。</p><hr><h1>3</h1><p>加牛肉乾有濃縮高湯的效果，能讓味道釋放到湯中。也可以直接使用羊高湯或牛高湯。</p><hr><h1>4</h1><p>在煮好的湯上面排滿馬鈴薯片、刷一層奶油，並放入烤箱以130℃烤1.5小時。取出後，撒上巴西里碎即完成。</p><hr>', 'g、g、g、顆、顆、g、g、g、cc、g、g、片、適量、適量、適量'),
(341, '肋眼牛排佐約克郡布丁', '肋眼牛排、海鹽、黑胡椒', '1、適量、適量', '341.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 11, '<hr><h1>1</h1><p>牛排鍋燒至非常熱，不需要放油，下牛排煎至冒出肉汁翻面(肉汁越多表示熟度越熟)，，續煎至喜歡的熟度，撒上海鹽，現磨黑胡椒</p><hr><h1>2</h1><p>取出牛排靜置3~5分鐘，靜置能讓肉汁鎖在牛排裡，一定要記得讓牛排休息一下唷。隨意放上沙拉和約克郡布丁擺盤，就可以開始享用。</p><hr>', '塊、適量、適量'),
(342, '勃根地紅酒燉牛肉', '牛肋條、洋蔥、紅蘿蔔丁、西洋芹丁、勃根第紅酒、牛高湯、月桂葉、百里香、培根、大蒜、鹽、胡椒、磨菇、奶油', '500、一、二分之一、二分之一、500、500、1、1/2、15、50、2、適量、適量、50、10', '342.png', 'https://icook.tw/recipes/', 0, 1, 1, 1, 1, 1, 0, 1, 10, '<hr><h1>1</h1><p>備料，牛肉洗淨，因為燉煮後會縮小，所以切大塊(五公分），調味蔬菜：西洋芹、洋蔥、紅蘿蔔等切丁。</p><hr><h1>2</h1><p>將紅酒、牛肉、調味蔬菜(洋蔥丁、紅蘿蔔丁、西洋芹丁)，月桂葉、百里香、黑胡椒、鹽混合，放入冰箱冷藏室醃漬24-48小時。</p><hr><h1>3</h1><p>開始料理，取一深鍋中放入培根香煎酥脆後，盛起備用。</p><hr><h1>4</h1><p>紅酒、牛肉、蔬菜分別瀝出，牛肉放入煎培根的鍋中大火煎上色(Browning)。取出備用。</p><hr><h1>5</h1><p>同鍋再炒瀝出的調味蔬菜，炒香後加入麵粉同炒，續將番茄糊放入同炒，再將煎好的牛肉與培根加入，加入已先預熱的紅酒，邊炒邊將鍋底焦物刮出(Deglazing)，再加入高湯。煮滾開始燉煮。</p><hr><h1>6</h1><p>欲燉煮直至軟爛，可以依個人設備選擇。</p><hr><h1>7</h1><p>正統做法烤箱攝氏160度燉3小時。</p><hr><h1>8</h1><p>瓦斯爐小火燉煮2.5小時。</p><hr><h1>9</h1><p>大同電鍋外鍋放兩杯冷水，跳起後再加入兩杯熱水，第二次跳起後，查看肉的熟度。</p><hr><h1>10</h1><p>悶燒鍋3-4小時。</p><hr><h1>11</h1><p>瓦斯爐重覆加熱悶燒法，煮滾後不開蓋悶二十分鐘，再開火煮滾五分鐘再悶二十分鐘，數次。</p><hr><h1>12</h1><p>牛肉快燉煮好時，將蘑菇洗淨切片，鍋中炒香奶油後放入蘑菇炒至帶焦糖色。</p><hr><h1>13</h1><p>將燉煮好的牛肉與蔬菜撈起，牛肉湯汁略進行濃縮Reducing，再將炒好的蘑菇放入牛肉湯汁中小火煨兩至三分鐘，加入鹽與胡椒調味，再將牛肉與蔬菜放回燉煮數分鐘，紅酒燉牛肉放一晚味道會更香醇濃郁。</p><hr><h1>14</h1><p>紅酒燉牛肉適合搭配馬鈴薯泥或法國麵包，當然飯與各式麵條也很適合。我個人喜歡搭配馬鈴薯泥，紅酒牛肉醬汁與香滑綿密馬鈴薯泥相當契合佐餐酒可選擇口感渾厚勃艮第產區紅酒</p><hr>', '克、個、杯、杯、cc、cc、片、茶匙、cc、g、辦、適量、適量、g、g、'),
(343, '紅酒燉香雞', '雞腿，對切成半、蘑菇，對切成半、洋蔥，切丁、蒜頭，切丁、芽球甘藍、紅酒、胡蘿蔔，切塊、新鮮百里香或迷迭香、甜椒粉或蕃茄醬、鹽、胡椒', '6、250、2、2、100、700、2、3、2、適量、適量', '343.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 10, '<hr><h1>1</h1><p>雞肉入鍋煎至表面色澤金黃。</p><hr><h1>2</h1><p>芽球甘藍、胡蘿蔔、百里香加入步驟1.拌勻。</p><hr><h1>3</h1><p>洋?、紅椒粉加入步驟2.拌勻，再加入紅酒，送入烤箱以200度烘烤40分鐘，取出，調入鹽、胡椒拌勻。</p><hr><h1>4</h1><p>蘑菇以小火慢烘至焦糖色，加入鹽、胡椒拌勻，再加入步驟3.拌勻，即可享用。</p><hr>', '隻、g、顆、顆、g、ml、根、株、EL、適量、適量'),
(344, '韃靼牛肉', '紐約客、蛋黃、酸黃瓜、酸豆、伍斯特醬、塔巴斯可辣椒醬、法式芥末醬、鹽、黑胡椒', '250、1、25、20、1、1、1、適量、適量', '344.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 1, 4, 10, '<hr><h1>1</h1><p>酸黃瓜切丁。</p><hr><h1>2</h1><p>牛肉切成肉泥狀。先把牛肉塊切成片狀，再切成條狀，最後切成粒狀。切成粒狀後再把牛肉用刀子快速的剁得更細。</p>牛肉的選擇菲力里肌、紐約客、沙朗都行。因為個人喜歡帶點油脂，而且不是很喜歡菲力的口感，所以我是使用紐約客並去除外層油脂的部位。如果不想要有油的話可直接選擇菲力。當然，肉品一定要選新鮮且生食級好肉</p><hr><h1>3</h1><p>接著把牛肉末、酸黃瓜碎、酸豆、蛋黃、鹽、黑胡椒、伍斯特醬、塔巴斯可辣椒醬、法式芥末醬全部放在一起。</p><hr><h1>4</h1><p>快速翻攪使所有食材都混在一起。</p><hr><h1>5</h1><p>全部壓成泥後，固定造形放上餐盤，上桌品嚐。</p><hr>', 'g、顆、g、g、匙、匙、大匙、適量、適量'),
(345, '法式燉菜', '綠櫛瓜、黑柿番茄、茄子、蒜頭、蘑菇義大利麵醬、梅醋、義大利香料、橄欖油、鹽巴、胡椒粉', '1、2、1、5、3、1、適量、1/2、適量', '345.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 1, 10, '<hr><h1>1</h1><p>準備食材:蘑菇義大利麵醬、綠櫛瓜、黑柿番茄、茄子、蒜頭、梅醋、義大利香料粉。</p><hr><h1>2</h1><p>將綠櫛瓜、番茄、茄子切成薄片，蒜頭切末備用。</p><hr><h1>3</h1><p>取一個烤皿，鋪上3湯匙蘑菇義大利麵醬。利用義大利麵醬做法式燉菜真的很輕鬆方便。</p><hr><h1>4</h1><p>放入1湯匙梅醋，也可用果醋替代，如使用白醋需要額外加1小匙糖。</p><hr><h1>5</h1><p>灑上適量義大利香料。</p><hr><h1>6</h1><p>放入蒜末攪拌均勻即可。</p><hr><h1>7</h1><p>依序將綠櫛瓜、茄子、番茄三片疊一起。</p><hr><h1>8</h1><p>按造這樣排列組合貼著烤皿邊緣排放圍繞成一圈，再淋上1/2湯匙橄欖油，也可用刷子刷上一層橄欖油，會更油亮漂亮，最後撒上鹽和黑胡椒粉就可以送入烤箱囉!</p><hr><h1>9</h1><p>上下火160度，烤約25分鐘即可。各家烤箱溫度不同，可再自行調節烘烤時間，只要看蔬菜軟化即可出爐。如擔心蔬菜烤焦可在菜上鋪烘焙紙或鋁箔紙。</p><hr>', '條、顆、條、瓣、湯匙、湯匙、適量、湯匙、適量'),
(346, '馬賽魚湯', '大蒜、洋蔥、蕃茄、亨氏蕃茄糊、魚高湯、蛤蜊、蝦子、鯛魚或你愛的魚、白酒、吳郭魚、洋蔥、紅蘿蔔、水、薑片', '2、半、3、半、750、半、半、2、100、1、半、一、850-900、10', '346.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 1, 0, 0, 10, '<hr><h1>1</h1><p>可以前一天先燉魚高湯 把所有食材加入鍋子裡 滾以後轉小火加蓋 煮一個半小時到兩個小時</p><hr><h1>2</h1><p>熱鍋炒切碎的洋蔥 炒至透明後 加入切碎的大蒜炒出香味後 再加入去皮去籽的切碎蕃茄用食物攪拌棒稍微打碎 但是不要全部打碎 保留一點蕃茄的口感 如果家裡沒有可以用食物調理機或省去這個步驟（蕃茄切小塊一點）</p><hr><h1>3</h1><p>加入半罐的蕃茄糊和魚高湯及白酒煮滾後加入蝦子和魚煮3分鐘加入魚以後不要一直攪拌 免得魚會碎（魚片要切大塊一點）</p><hr><h1>4</h1><p>最後加入蛤蠣 蛤蠣開以後立刻關火 試試看味道加入鹽巴或黑胡椒 完成</p><hr><h1>5</h1><p>國外的馬賽魚湯還會加入茴香 </p><hr>', '顆、顆、顆、罐、cc、斤、斤、片、cc、整隻、顆、根、cc、片'),
(347, '香煎鵝肝', '鵝肝（約1.5cm薄片）、法包', '兩、兩', '347.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 10, '<hr><h1>1</h1><p>將鵝肝切成1.5 cm薄片， 注意不能夠切得太薄</p><hr><h1>2</h1><p>將鵝肝兩面用刀??成菱形狀的切紋，大約有2mm深</p><hr><h1>3</h1><p>將?茶匙鹽和少量黑椒碎，平均地灑在在鵝肝兩邊</p><hr><h1>4</h1><p>法包放在多士爐或平底鑊上翻熱</p><hr><h1>5</h1><p>在一個平底鑊中，開中火，加熱直至鑊面有足夠高溫，放鵝肝</p><hr><h1>6</h1><p>鵝肝每一邊煎30秒至1分鐘左右，然後上碟，煎好的鵝乾大約在室溫靜止一分鐘，等待鵝肝中間的熱力慢慢分佈，之後可用廚紙把表面的油分抹去，放在法包上，便可享用</p><hr><h1>7</h1><p>備註：煎鵝肝可以配無花果、新鮮布?或桃等水果，又或者拌以帶水果味的意大利醋一起享用</p><hr>', '片、片'),
(348, '焗烤番茄薯', '馬鈴薯、起司絲、牛番茄、黃甜椒、紅甜椒、洋蔥、蒜末、迷迭香、胡椒鹽、奶油、鹽巴、水', '大2/小3、50、2、半、半、半、三、適量、適量、兩、適量、一', '348.png', 'https://icook.tw/recipes/', 1, 1, 0, 0, 1, 1, 0, 0, 10, '<hr><h1>1</h1><p>備料:1.馬鈴薯洗淨、去皮    2.用鹽水煮馬鈴薯，10分-20分，試用筷子看能不能輕易插穿，可插穿後撈起備用  3.蒜頭切末、洋蔥切片  4.蔬菜切段   5.熱鍋、下奶油一匙</p><hr><h1>2</h1><p>下蒜頭、洋蔥，中火翻炒</p><hr><h1>3</h1><p>洋蔥吸收奶油微黃後下甜椒加鹽巴1小匙、撒上胡椒鹽</p><hr><h1>4</h1><p>.第一層馬鈴薯壓泥放入烤盤或厚瓷盤中</p><hr><h1>5</h1><p>第二層鋪上炒好的奶香洋蔥與甜椒</p><hr><h1>6</h1><p>熱鍋融化奶油，下切片番茄，小火嫩煎約2-3分後下一湯匙水</p><hr><h1>7</h1><p>再煎至兩片焦黃、外皮軟爛，煎乾水分撒上黑胡椒與胡椒鹽、迷迭香喜歡吃微甜的也可加小半杓紅糖烤箱先行預熱190度C</p><hr><h1>8</h1><p>第三層番茄片均勻鋪平於蔬菜上</p><hr><h1>9</h1><p>第四層-最終~均勻鋪上起司絲放入烤箱中，上下火190度烤10-15分鐘(起司要焦一些可烤15-20分)</p><hr>', '顆、g、顆、顆、顆、顆、瓣、適量、適量、匙、適量、匙'),
(349, '法式鹹派 Quiche', '雞蛋、牛奶、鮮奶油、培根、洋蔥、波菜、起士、鹽、糖、黑胡椒、酥皮、奶油、麵粉', '2、100、100、3-4、1、1、適量、適量、適量、適量、1-2、適量、適量', '349.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 10, '<hr><h1>1</h1><p>準備食材，可以加入自己喜歡的食材，食材切末或丁</p><hr><h1>2</h1><p>熱鍋下培根</p><hr><h1>3</h1><p>下洋蔥，炒到培根焦脆洋蔥變軟拿起來備用</p><hr><h1>4</h1><p>拿一個碗加入蛋、鮮奶油和牛奶，灑一點鹽、糖和黑胡椒，如果培根會太鹹鹽加少一點，攪拌均勻</p><hr><h1>5</h1><p>拿一個模具塗抹上奶油後灑上一層麵粉</p><hr><h1>6</h1><p>酥皮兩層鋪在底部</p><hr><h1>7</h1><p>鋪上炒好的培根洋蔥、起士和波菜</p><hr><h1>8</h1><p>加入攪拌好的蛋液，160度烤大約20分鐘看大小</p><hr><h1>9</h1><p>完成</p><hr>', '顆、ml、ml、片、顆、把、適量、適量、適量、適量、片、適量、適量'),
(350, '法式薯泥釀鯛魚', '洋蔥、紅蔥頭、蒜頭、培根、紅甜椒、黃甜椒、櫛瓜、西洋芹、小番茄、豌豆、檸檬、甜羅勒、雞高湯、小茴香粉、馬鈴薯、熱牛奶、奶油、鯛魚、馬鈴薯、蛋白、蒜頭、紅蔥頭、蛤蜊、白酒', '切丁、切碎、切碎、1-2、半、半、半、一、適量、適量、一、一、1、適量、2、100、30、2、切小原型薄片、適量、切末、切末、適量、適量', '350.png', 'https://icook.tw/recipes/', 1, 1, 0, 0, 1, 1, 0, 0, 10, '<hr><h1>1</h1><p>馬鈴薯切塊 打成泥過篩 加入熱牛奶 攪拌後加入奶油</p><hr><h1>2</h1><p>熱鍋冷油，炒洋蔥、培根丁 出油後加入蔬菜丁燉煮 上面加甜羅勒（可改成九層塔）蓋上蓋子 入味後調味 完成</p><hr><h1>3</h1><p>鯛魚片對半後修成長方形熱鍋冷油，下鯛魚片調味鹽胡椒百里香煎半熟放鐵盤</p><hr><h1>4</h1><p>馬鈴薯切圓柱形切片0.2cm蛋白打發鋪在魚片上蓋上馬鈴薯圓形片當魚鱗在淋橄欖油放明火烤箱 烤熟上色</p><hr><h1>5</h1><p>熱鍋冷油加上蒜頭、紅蔥頭末爆香下蛤蜊、加白酒</p><hr><h1>6</h1><p>最後做擺盤 下層鋪薯泥墊魚排 外圍放蔬菜蛤蜊 裝飾：檸檬用削皮刀削長片、歐式蔬菜擺盤</p><hr>', '切丁、切碎、切碎、條、顆、顆、條、條、適量、適量、顆、小把、罐、適量、顆、cc、g、塊、切小原型薄片、適量、切末、切末、適量、適量'),
(351, '法式紙包鮭魚', '鮭魚、彩椒、檸檬、奶油、橄欖油、鹽、洋蔥', '1片、1/2顆、1顆、45g、2~3匙、一小撮、半顆', '351.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 1, 0, 0, 0, 10, '<hr><h1>1</h1><p>鮭魚兩面用鹽巴稍微搓揉，主要去腥味外，也可以增加一點風味</p><hr><h1>2</h1><p>將彩椒、洋蔥切絲，檸檬切片備用</p><hr><h1>3</h1><p>準備兩張烘焙紙鋪下面，依序將彩椒、洋蔥、鮭魚、檸檬放進烘焙紙，最後加上奶油（若有香料也可以灑上）</p><hr><h1>4</h1><p>將烘焙紙包起來，盡量緊密一些，若料太多可以用釘書機固定喔</p><hr><h1>5</h1><p>烤箱先預熱200度後，就可以將所有食材放入烤箱啦</p><hr><h1>6</h1><p>依據鮭魚片的厚度決定烘烤時間，大約在30~40分鐘</p><hr><h1>7</h1><p>完成</p><hr>', '片、顆、顆、g、匙、小撮、顆'),
(353, '荷葉雞肉粽', '圓糯米、乾香菇、去骨雞腿肉[切成9塊]、水、蠔油、白胡椒粉、胡椒鹽、五香粉、日曬鹽、紅露酒、日曬鹽、胡椒鹽、白胡椒粉、鹹蛋黃、料理米酒', '2、18-20、3、5、3、2、2、1、2、1、1、1、1、9、100', '353.png', 'https://icook.tw/recipes/362179', 1, 1, 1, 1, 1, 1, 1, 0, 7, '<h1>1<h1><p>準備食材。圓糯米前一晚先洗淨後放冰箱冷藏泡隔夜。鹹蛋黃用料理米酒[要蓋過所有鹹蛋黃以上的米酒量] 清洗及讓去腥, 表面的白色臍帶都要洗淨後, 烤箱預熱220度C上下火烤10~14分鐘, 烤好後放涼備用。紐扣菇也是提早準備好, 泡過濾水泡開後備用。<p><h1>2<h1><p>圓糯米的量還不少, 但我電子鍋只有3人份所以分兩鍋煮。第一鍋是用電子鍋, 調味料的部分跟糯米拌勻按下煮飯鍵開始煮; 因為李錦記熊貓蠔油有點像台式醬油膏不會太鹹, 所以我加得比例有比較高, 可以依個人口味斟酌。<p><h1>3<h1><p>另一鍋是用鑄鐵鍋來煮。因為糯米吸水性比較強, 所以建議水量可以比平常煮飯再多1.5倍左右。調味料的部分跟糯米拌勻後, 加水蓋過米就可以開中大火先開始煮飯。<p><h1>4<h1><p>在等煮飯的同時來醃肉。將洗淨切小塊的雞腿肉放上醃料, 用手稍微揉搓入味。今天打算包成9個荷葉粽, 所以都把材料分成9份, 若想包大一點或小一點, 可以再酌量調整。<p><h1>5<h1><p>第二個鑄鐵鍋裡糯米的部分在煮到水大滾之後稍微拌一下鍋底避免燒焦, 蓋鍋蓋計時10分鐘。。<p><h1>6<h1><p>計時10分鐘時要轉最小的火, 但是火力的圈圈最好是平均整個鍋底都可以受熱均勻的, 才不會中間燒焦然後四週一週的飯不熟。<p><h1>7<h1><p>等待煮飯的同時來煎雞腿肉。把醃好的雞腿肉下鍋, 雞皮朝下不用下油直接開中火。因為腿肉的皮富含油脂, 熱鍋後就不會黏鍋。<p><h1>8<h1><p>大約煎到兩面都有上色有金黃, 約七~八分熟狀態即可取出備用。<p><h1>9<h1><p>同一個鍋子放入切成小圈的香腸, 也是兩面都有上色有金黃狀態即可取出備用。<p><h1>10<h1><p>荷葉在一般中藥行就可以買到一大張沒有裁剪的荷葉, 使用前一天可以先取出洗淨泡水。\n我自己裁剪的荷葉方式是先把中間梗剪掉, 然後依荷葉大小剪成3片[裁兩刀]或4片[裁3刀]。裁剪好之後再繼續泡水。<p><h1>11<h1><p>糯米以及包粽子的食材都備好之後就可以開始包了。因為荷葉粽都很大, 其實不太需要綁起來, 我都是把食材放在中間偏上方集中的地方, 把最上面折下來, 然後兩側往中間, 最後再把尾巴往下折或折進去。如果荷葉有些中間的破洞比較大一點, 可以像我放一張棕葉來墊底。<p><h1>12<h1><p>折好之後就放在可以蒸的鐵盤上備用, 或是家裡有竹蒸籠更好, 可以放在竹蒸籠上準備。<p><h1>13<h1><p>鐵蒸鍋的水先滾開, 將包好荷葉粽放在鐵蒸鍋上開始蒸粽子。<p><h1>14<h1><p>時間是從水滾開始計時60分鐘, 如果鍋子比較小的話, 記得中途要補上熱水繼續蒸。<p><h1>15<h1><p>蒸好之後就可以打開來直接品嚐荷葉粽, 不過因為糯米比較不消化, 建議每餐少量取用, 不要一下子吃太多會有負擔, 而且要搭配較多纖維素的蔬菜會比較營養均衡。<p>', '斤、個、塊、杯、大匙、小匙、小匙、小匙、小匙、大匙、小匙、小匙、小匙、顆、ml'),
(354, '豆鼓蒸排骨', '排骨、蒜頭、薑、蔥、糖、橄欖油、太白粉、鹽、豆鼓', '750、5、1、1、2、1、1.5、1、2', '354.png', 'https://icook.tw/recipes/362113', 0, 0, 0, 1, 0, 0, 0, 0, 7, '<h1>1<h1><p>排骨洗淨後泡水30分鐘左右，泡掉排骨上的血水。<p><h1>2<h1><p>蒜頭、薑切末。<p><h1>3<h1><p>排骨擦乾水份後，加入鹽、糖、太白粉、橄欖油、蒜末、薑末，攪拌至排骨表面產生黏性後，放入冰箱醃1小時左右。<p><h1>4<h1><p>排骨醃好後，加入豆鼓攪拌均勻，然後隔水蒸25分鐘左右。<p><h1>5<h1><p>蒸完後撒上蔥花即可。如果覺得太淡，可以加點醬油喔～<p>', '克、瓣、片、條、茶匙、湯匙、湯匙、茶匙、茶匙'),
(355, '港式燒肉', '豬肉、五香粉、紹興酒、鹽、小蘇打粉、白醋', '1、10、少許、少量、5、少量', '355.png', 'https://icook.tw/recipes/355253', 0, 1, 1, 1, 1, 0, 1, 0, 7, '<h1>1<h1><p>先醃料（五味粉，酒，鹽）表面不醃，好後上保鮮膜包覆四周，上面不包，放冷藏冰6小時以上<p><h1>2<h1><p>取出來改包鋁紙，ㄧ樣也是表面不包，將小蘇打粉沾水塗表面等20分鐘後上白醋<p><h1>3<h1><p>將氣炸80度，時間60分，這是因?我們要先烘乾水份<p><h1>4<h1><p>好後..抹點油，氣炸200度，時間20分鐘<p><h1>5<h1><p>完成了<p>', '塊、克、少許、少量、克、少量'),
(356, '乾炒豬扒意粉', '豬扒、火腿絲、芽菜、韭黃、義大利粉、黑椒碎、鹽、醬油、牛油', '2、30、30、30、2、少許、少許、少許、少許', '356.png', 'https://icook.tw/recipes/359391', 1, 1, 0, 1, 1, 0, 0, 0, 7, '<h1>1<h1><p>1）先將豬扒切小件加入鹽，醬油，黑椒碎掩半小時後先煎熟2）將意大利粉煮至8成熟3）加入牛油將韭黃，芽菜、火腿絲快炒數十秒，加入意大利粉、豬扒小件一起炒4）加入醬油炒勻便可上碟<p>', '件、克、克、克、人份、少許、少許、少許、少許'),
(357, '港式菠蘿包', '高筋麵粉、水、高筋麵粉、奶粉、蛋液、酵母粉、鹽、糖、無鹽奶油、水、低筋麵粉、糖、鹽、奶粉、泡打粉、無鹽奶油、蛋黃', '20、100、250、10、40、4、1/4、40、20、70、90、65、1/8、20、1、40、1', '357.png', 'https://icook.tw/recipes/350215', 0, 1, 0, 1, 0, 0, 1, 0, 7, '<h1>1<h1><p>先做湯種，麵粉過篩，加入水煮成糊狀，放涼備用。<p><h1>2<h1><p>將酵母粉和70ml的水混合。<p><h1>3<h1><p>現在可以處理麵包部份，將麵粉過篩，並加入奶粉、鹽、糖、酵母混合液、蛋液和已放涼的湯種拌勻，揉5-10分鐘成團。<p><h1>4<h1><p>加入無鹽奶油，揉至油份完全被麵團吸收，滾成球狀，放在碗中發酵45分鐘。<p><h1>5<h1><p>第一次發酵完成後取出，並按壓排出空氣。再次滾成球狀，分成八等份，放到烤盤上進行第二次發酵。<p><h1>6<h1><p>此時，可將菠蘿皮的材料混合，放在保鮮膜上揉成條狀，並放到冰箱冷藏15分鐘。<p><h1>7<h1><p>將菠蘿皮從冰箱取出，分成八等份，用麵?壓成薄薄的圓形，放於麵包上，並掃上蛋液。<p><h1>8<h1><p>放進烤箱，180度15分鐘，即成。<p>', '克、ml、克、克、克、克、茶匙、克、克、ml、克、克、茶匙、克、茶匙、克、個'),
(358, '港式蛋撻', '低筋麵粉、無鹽牛油(奶油) (室溫)、糖霜、蛋黃、熱水、淡奶、全蛋液、白砂糖', '90、45、20、1、60、60、50、25', '358.png', 'https://icook.tw/recipes/349081', 1, 1, 0, 1, 0, 0, 1, 0, 7, '<h1>1<h1><p>無鹽牛油(奶油)放置室溫，直至可在牛油上輕鬆留下指痕把無鹽牛油(奶油)打散，加入糖霜攪拌均勻<p><h1>2<h1><p>蛋黃分次加入，攪拌均勻，把低筋麵粉過篩攪拌成團用保鮮覆蓋好，冷藏30分鐘<p><h1>3<h1><p>在熱水中加入糖混合至融化<p><h1>4<h1><p>加入淡奶混合後加入全蛋液攪拌均勻，過篩備用<p><h1>5<h1><p>在蛋撻模上塗油，麵團分成6份搓圓<p><h1>6<h1><p>塑形：一邊按麵團一邊轉蛋撻模，令撻皮平均<p><h1>7<h1><p>整理撻模的邊緣<p><h1>8<h1><p>放入已預熱的焗爐以200度焗7分鐘<p><h1>9<h1><p>蛋液倒入撻皮前先攪拌一下避免沉澱，也可以再過篩一次去除氣泡加入餡料後放入已預熱的焗爐以200度焗13-15分鐘<p>', '克、克、克、個、ml、ml、克、克'),
(359, '粟米豬骨山藥湯', '豬骨、玉米、紅胡蘿蔔、新鮮山藥、枸杞、水、鹽', '1、2、1、半、適量、1000、適量', '359.png', 'https://icook.tw/recipes/348371', 1, 1, 1, 0, 1, 0, 1, 0, 7, '<h1>1<h1><p>先把豬骨煮幾分鐘（目的是去血水）大概煮沸3分鐘就好了<p><h1>2<h1><p>把玉米，紅胡蘿蔔，和山藥切好，並把所有的材料（包括豬骨)放進一大鍋內<p><h1>3<h1><p>慢火煮2個小時, 最後加些鹽。就可以喝了<p>', '斤、條、條、條、適量、ml、適量'),
(360, '滑蛋蝦仁燴飯', '蝦仁、雞蛋、蔥、蒜頭、鹽、糖、鹽、糖、胡椒粉、太白粉', '50、4、1、1、1/2、1/4、2、1/2、1/2、2', '360.png', 'https://icook.tw/recipes/348222', 0, 1, 0, 1, 0, 0, 1, 0, 7, '<h1>1<h1><p>先準備好食材。<p><h1>2<h1><p>蔥切碎；蒜頭切末。<p><h1>3<h1><p>蝦仁洗淨後加入一顆蛋白、鹽、糖醃5分鐘左右。<p><h1>4<h1><p>水燒熱後關火，把蝦仁放入熱水中，燙至蛋白變成白色後即可撈起瀝水（不用把蝦燙熟）。此時蛋白會在蝦仁表層形成「保護膜」，讓蝦仁吃起來更Q嫩。<p><h1>5<h1><p>中小火爆香蒜頭，加入蝦仁快炒幾下。<p><h1>6<h1><p>倒入2飯碗水，加入鹽、糖、胡椒粉調味，再加入太白粉讓醬汁濃稠。<p><h1>7<h1><p>待醬汁煮沸後，以畫圈的形式倒入蛋液。<p><h1>8<h1><p>在起鍋前加上蔥花。<p><h1>9<h1><p>最後將滑蛋蝦仁羹淋在白飯上即可。<p>', '克、個、枝、瓣、茶匙、茶匙、茶匙、茶匙、茶匙、湯匙'),
(361, '咕嚕雞球', '雞胸肉、紅椒、洋蔥、鳳梨、醬油、鹽、胡椒粉、米酒、生粉、蛋液、茄汁、白醋、白糖', '300、1、1、1/4、2、1、1、1、半、1、3、2、3', '361.png', 'https://icook.tw/recipes/347005', 1, 0, 1, 1, 1, 0, 0, 0, 7, '<h1>1<h1><p>把雞肉到成一塊塊，並加鹽,胡椒粉,米酒,和醬油醃30分鐘。<p><h1>2<h1><p>把醃好的雞肉均勻塗抹蛋液，並塗上生粉<p><h1>3<h1><p>等油熱(180度)，把雞肉放進炸。炸成金黃色，就可以撈起。<p><h1>4<h1><p>把洋蔥，紅椒炸一炸，30秒就可以<p><h1>5<h1><p>準備另平鍋，將醬汁煮熱在最後加上生粉水。再加上炸好的洋蔥，紅椒，雞肉，和菠蘿(?梨)並快速拌勻，就可以上菜了。<p>', '克、個、個、個、湯匙、茶匙、茶匙、湯匙、杯、個、湯匙、湯匙、湯匙'),
(362, '楊枝甘露', '西谷米、芒果、椰奶、芒果、葡萄柚、椰奶', '100、400、250、100、適量、適量', '362.png', 'https://icook.tw/recipes/344282', 1, 1, 1, 1, 1, 1, 1, 0, 7, '<h1>1<h1><p>首先將芒果、葡萄柚去皮，取出果肉備用。<p><h1>2<h1><p>備一鍋滾水，將西谷米下鍋煮5~7分鐘後，關火、上蓋再悶5~7分鐘。<p><h1>3<h1><p>接著將煮好的西谷米放入冷(冰)水中冷卻備用。<p><h1>4<h1><p>再來將芒果與椰奶放入果汁機中打成汁。<p><h1>5<h1><p>最後將所有食材盛碗就完成了。<p>', '克、克、ml、克、適量、適量'),
(363, '麻辣雞煲', '小雞翅、洋蔥、蒜頭、花椒粉、薑片、蠔油、辣豆瓣醬、辣椒醬、辣椒、雞高湯、生抽、老抽、花雕酒、太白粉、砂糖', '12、半、5、少許、片、湯匙、湯匙、湯匙、根、ml、湯匙、湯匙、湯匙、少許、少許', '363.png', 'https://icook.tw/recipes/342877', 1, 0, 1, 1, 0, 1, 1, 0, 7, '<h1>1<h1><p>首先把雞翅放進醃料醃至少兩小時<p><h1>2<h1><p>洋蔥、辣椒、蒜、薑片都放進鍋裡拌炒，直到洋蔥炒至金黃色。<p><h1>3<h1><p>放入雞翅，把雞翅煎到金黃後，把調味料加入鍋裡跟雞翅一起拌炒。<p><h1>4<h1><p>加入雞高湯，蓋上鍋蓋燜煮5分鐘就完成了。<p>', '隻、顆、瓣、少許、片、湯匙、湯匙、湯匙、根、ml、湯匙、湯匙、湯匙、少許、少許'),
(364, '蒜蓉蝦春卷', '海蝦、春捲皮、蒜泥、鹽、胡椒粉', '500、3、2、1、少許', '364.png', 'https://icook.tw/recipes/293012', 1, 1, 1, 1, 1, 0, 1, 0, 7, '<h1>1<h1><p>海蝦洗淨去?去腸臟瀝乾水分，切碎備用。<p><h1>2<h1><p>加入蒜泥調味與蝦肉調勻醃15 分鐘。<p><h1>3<h1><p>將餡料放上春卷皮，捲好成扁圓筒狀。<p><h1>4<h1><p>下熱油鍋以小火炸8 分鐘至全熟。<p><h1>5<h1><p>待涼片刻。<p><h1>6<h1><p>即可食用。<p>', '克、張、大匙、大匙、少許'),
(365, '港式海鮮兩面黃\n\n', '雞蛋麵、海鮮、魚板、芥蘭、太白粉水、蒜蓉、雞粉、白胡椒粉', '2、1、少許、3、少許、3、1、1', '365.png', 'https://icook.tw/recipes/333948', 1, 1, 1, 1, 1, 1, 1, 0, 7, '<h1>1<h1><p>準備食材。蝦仁用米酒胡椒醃一下。<p><h1>2<h1><p>燒一鍋水。水滾之後下入雞蛋麵。煮一分鐘。放涼，備用。<p><h1>3<h1><p>加入一大匙沙拉油。麵煎到兩面都金黃脆脆的即可。<p><h1>4<h1><p>裝盤備用。<p><h1>5<h1><p>蒜蓉爆香。加入海鮮。均勻炒熟。裝盤備用。<p><h1>6<h1><p>加一碗水。水滾後分次加入太白粉水勾芡。加入一小匙雞粉, 魚板, 及芥蘭。<p><h1>7<h1><p>加入煮好的海鮮。撒上白胡椒。<p><h1>8<h1><p>將剛炒好的海鮮炒料淋在脆脆的雞蛋麵上即可。<p>', '份、碗、少許、把、少許、瓣、小匙、小匙'),
(366, '冬菇臘腸煲仔飯', '豬肉、米、臘腸、冬菇、糖、醬油、芝麻油', '100、1、1、7、半、1、半', '366.png', 'https://icook.tw/recipes/332972', 0, 1, 0, 1, 0, 0, 0, 0, 7, '<h1>1<h1><p>把冬菇浸水<p><h1>2<h1><p>豬肉切小塊，用糖，醬油和芝麻油醃一下<p><h1>3<h1><p>米洗好放入沙煲裡，加入清水，幾勺浸泡冬菇的水和一勺油<p><h1>4<h1><p>放上臘腸和冬菇，用大火煮。水滾的時候轉成中火。<p><h1>5<h1><p>等煲仔飯的時候，把豬肉放入平底鍋裡，煎成金黃色。<p><h1>6<h1><p>煲仔飯的水全都沒的時候放入豬肉。關火，用蓋蓋者10分鐘<p><h1>7<h1><p>煲仔飯放點甜醬油就可以咯～<p>', '克、杯、條、個、茶匙、茶匙、茶匙'),
(367, '鳳爪排骨飯', '排骨、鳳爪、豆鼓、米、水、紅尖椒、蒜頭、鹽、生抽、糖、豆瓣醬、酒、蠔油、胡椒粉、麻油、豆鼓、甜醬、住侯醬、豆瓣醬、蒜蓉、糖、胡椒粉、蠔油、鼓油、紹興酒、粟粉', '300、半、適量、3、3、適量、2、半、1、1、半、1、2、少許、1、少許、1、1、1、2、1、少許、2、1、1、2', '367.png', 'https://icook.tw/recipes/332060', 1, 1, 0, 1, 0, 0, 0, 0, 7, '<h1>1<h1><p>先將紅尖椒蒜頭切開<p><h1>2<h1><p>將鳳爪調味料攪拌，醃最少2小時。<p><h1>3<h1><p>將排骨調味料攪拌，醃最少2小時。<p><h1>4<h1><p>將米清洗後放入飯盅內，加入相同份量水份。<p><h1>5<h1><p>燒熱一鍋水，將飯盅放入先蒸十分鐘。<p><h1>6<h1><p>飯熟後再將排骨及鳳爪加入。<p><h1>7<h1><p>再加入紅椒絲及豆豉。<p><h1>8<h1><p>加蓋，蒸二十分鐘即可。<p>', '克、磅、適量、杯、杯、適量、湯匙、茶匙、湯匙、茶匙、茶匙、湯匙、湯匙、少許、茶匙、少許、湯匙、茶匙、茶匙、湯匙、茶匙、少許、湯匙、湯匙、湯匙、茶匙'),
(368, '豬皮魚蛋水魷', '豬皮、陳皮魚蛋、水魷、紅蔥頭、蒜蓉、水份、柱侯醬、咖哩醬、傳統咖哩粉、叉燒醬、冰糖', '1、1、1、2、1、適量、2、2、1、2、2', '368.png', 'https://icook.tw/recipes/332055', 1, 1, 0, 1, 1, 1, 1, 0, 7, '<h1>1<h1><p>先將豬皮魚蛋水魷汆水,再將材料切塊備用。<p><h1>2<h1><p>燒熱油鍋,將蒜蓉紅蔥蓉爆香。<p><h1>3<h1><p>將豬皮魚蛋加入炒勻。<p><h1>4<h1><p>再加入醬料及水魷炒勻。<p><h1>5<h1><p>加入適量水分，加蓋。<p><h1>6<h1><p>煮滾後轉中火，烹煮15分鐘即可。<p>', '塊、磅、隻、個、湯匙、適量、湯匙、湯匙、包、湯匙、粒'),
(369, '皮蛋香菜魚片湯', '鯛魚、皮蛋、薑、香菜、香油、鹽', '2、2、5、1、少許、適量', '369.png', 'https://icook.tw/recipes/323158', 1, 0, 1, 1, 1, 0, 1, 0, 7, '<h1>1<h1><p>鯛魚切片、皮蛋切成4等份、薑切成薑絲、香菜留完整一株、其它切段<p><h1>2<h1><p>薑絲放入約1200cc的水內，煮滾<p><h1>3<h1><p>放皮蛋和魚片<p><h1>4<h1><p>煮熟至湯有第點呈現白色時加入整株的香菜<p><h1>5<h1><p>煮滾，在起鍋前加入切段香菜、香油、適量的鹽調味<p><h1>6<h1><p>上桌～清爽的湯品<p>', '條、顆、片、把、少許、適量'),
(370, '芝麻醬西多士', '麵包、芝麻醬、雞蛋、牛油', '2、2-3、2、少許', '370.png', 'https://icook.tw/recipes/325664', 0, 1, 0, 0, 1, 1, 1, 0, 7, '<h1>1<h1><p>先將芝麻醬塗抹在麵包上<p><h1>2<h1><p>將雞蛋打好 將兩片麵包合上 再將麵包沾滿雞蛋<p><h1>3<h1><p>將沾蛋的麵包放進油鑊裡半煎炸 炸到四面金黃<p><h1>4<h1><p>最後加奶油和煉乳便完成<p>', '片、茶匙、隻、少許'),
(371, '薯仔炆雞翼', '雞翅、薑片、馬鈴薯、洋蔥、老抽、生抽、胡椒粉、糖、麻油', '1、2、2、半、1、2、1/2、1、1', '371.png', 'https://icook.tw/recipes/321624', 0, 0, 0, 0, 0, 1, 1, 0, 7, '<h1>1<h1><p>雞翼解凍後沖水洗淨、瀝乾加入醃料拌勻醃約半小時<p><h1>2<h1><p>把洋蔥切片<p><h1>3<h1><p>把馬鈴薯切塊<p><h1>4<h1><p>中火熱鍋加油，先煎皮的一邊，反轉再煎至兩邊上色即可，然後把雞中翼/雞翅夾起待用\n<p><h1>5<h1><p>中火熱鍋加油，炒香薑片及洋蔥後加入馬鈴薯煎香<p><h1>6<h1><p>加入雞中翼/雞翅，及剩下的醃料汁和一碗水<p><h1>7<h1><p>待醬汁燒開後調較至小火蓋上鍋蓋炖約20分鐘<p><h1>8<h1><p>翻炒一下然後試味，可按個人口味加鹽調味<p>', '磅、片、個、個、茶匙、湯匙、茶匙、茶匙、茶匙'),
(372, '山竹牛肉', '牛絞肉、腐竹皮、醬油、陳皮末、嫩肉粉、胡椒粉、太白粉水', '250、少許、1、1、1/4、少許、3', '372.png', 'https://icook.tw/recipes/313814', 1, 1, 1, 1, 1, 0, 0, 0, 7, '<h1>1<h1><p>芫荽、荸薺、陳皮分別洗淨去皮切末。<p><h1>2<h1><p>腐竹皮浸透，瀝乾水分切成小塊鋪在小碟上。<p><h1>3<h1><p>牛絞肉加入調味拌勻醃15 分鐘。<p><h1>4<h1><p>牛肉搓成兩顆小球，放在腐竹皮上。<p><h1>5<h1><p>水煮沸後，以大火蒸15 分鐘。<p><h1>6<h1><p>即可食用。<p>', '克、少許、大匙、小匙、小匙、少許、大匙'),
(373, '香菇滑雞', '去骨雞腿、乾香菇、嫩薑、蠔油、醬油、糖、米酒、太白粉', '2、3、5、6、2、1、1、1', '373.png', 'https://icook.tw/recipes/320455', 0, 0, 0, 1, 0, 0, 0, 0, 7, '<h1>1<h1><p>雞腿切小塊 薑切片<p><h1>2<h1><p>所有食材及調味料攪拌均勻靜置至少1小時等待入味<p><h1>3<h1><p>取一淺盤 將醃好雞肉放入 用電鍋蒸15分鐘（外鍋一杯水）就完成<p>', '隻、朵、片、大匙、大匙、大匙、大匙、大匙'),
(374, '蔥油雞腿排', '去骨肉雞腿、米酒、白胡椒粉、醬油、青蔥碎、嫩薑碎、沙拉油、鹽/白胡椒粉', '1、4、少許、12、30、5、40、各1', '374.png', 'https://icook.tw/recipes/319202', 1, 0, 0, 1, 1, 0, 0, 0, 7, '<h1>1<h1><p>將蒸氣烘烤爐設定健康炸模式預熱<p><h1>2<h1><p>預熱的同時將雞肉和醃料一起混合均勻，醃15分<p><h1>3<h1><p>將蔥醬材料混合圴?，放入烤皿<p><h1>4<h1><p>蒸烤盤鋪上烘焙紙，放上雞腿肉（雞皮朝上），烤皿一起放入<p><h1>5<h1><p>健康炸模式預熱完炸10分鐘 即完成<p>', '片、克、少許、克、克、克、克、克'),
(375, '鮮蝦凍豆腐煲', '冷凍白蝦、板豆腐、金針菇、雪白菇、蒜頭、醬油、米酒、鹽巴、水、味霖', '5、1/3、1/3、1/3、2、1.5、1、適量、2、1', '375.png', 'https://icook.tw/recipes/312491', 1, 1, 1, 1, 1, 0, 0, 0, 7, '<h1>1<h1><p>白蝦邊解凍邊去泥腸，將蝦頭留下煮湯會比較入味。菇菇們清理乾淨後切段備用<p><h1>2<h1><p>起鍋，倒入適量的油爆香蒜末。等蒜頭略黃時把蝦頭放進去一起炒<p><h1>3<h1><p>待香氣十足時加入水、米酒、醬油、味霖等調味料再放入豆腐使其吸收湯汁<p><h1>4<h1><p>接著放入菇菇們以及蝦子。最後再用鹽巴最後調味即可出鍋！<p>', '隻、盒、包、包、瓣、匙、匙、適量、杯、匙'),
(376, '皮蛋瘦肉粥', '白飯、絞肉、皮蛋、青蔥、紹興酒、香油、油條、鹽巴、白胡椒、豬龍骨、香菇蒂、薑片、水', '1、60、1、適量、少許、少許、2、1-2、適量、300、適量、3', '376.png', 'https://icook.tw/recipes/289093', 1, 1, 1, 1, 1, 1, 1, 0, 7, '<h1>1<h1><p>熬高湯：豬骨冷水下鍋，水滾後倒掉洗去雜質，重煮一鍋水並加入豬骨、香菇蒂，水滾後以小火慢熬，以免清湯變濁，期間撈去雜質與浮油<p><h1>2<h1><p>皮蛋蒸熟後用劃切方式切開，若壓碎蛋黃粥的顏色就沒那麼好看囉！絞肉加入少許的鹽巴、米酒、麻油拌過稍醃，再以鹽水燙過撈起，除了可以去腥，也能去除肉渣<p><h1>3<h1><p>起一鍋高湯，放入白飯和絞肉煮滾，接著以鹽、白胡椒調味，當飯糊化到你喜好的軟硬度後，再放入皮蛋塊和青蔥<p><h1>4<h1><p>裝碗並放入少許紹興酒、麻油增香，再擺上油條就完成囉！<p>', '碗、克、顆、適量、少許、少許、塊、小匙、適量、克、適量、片'),
(377, '焗釀鮮蟹蓋', '蟹、罐頭蟹肉、洋蔥、磨菇忌廉湯、白酒、麵粉、碎芝士、胡椒粉、雞蛋、糖水', '4、1、1、1、1、適量、適量、適量、1、1', '377.png', 'https://icook.tw/recipes/283407', 1, 0, 0, 1, 1, 1, 1, 0, 7, '<h1>1<h1><p>【準備】 用水煮熟蟹放涼後，拆出蟹蓋並修剪蟹蓋邊和蟹咀，再清洗乾淨； 可以拆出新鮮蟹肉，或用罐頭蟹肉作為餡料<p><h1>2<h1><p>清洗洋蔥後再切成幼絲； 將焗爐預熱<p><h1>3<h1><p>【煮食】 燒紅鑊落油，加入洋蔥絲用中火炒至乾身後盛起，再用篩壓走洋蔥的水份； 燒紅鑊，加入蟹肉用中火炒至乾身，再加入白酒和胡椒粉除腥味後關火<p><h1>4<h1><p>加入洋蔥絲和磨菇忌廉湯到鑊中，用小火炒至均勻後關火； 再加入麵粉後撈勻餡料後放涼<p><h1>5<h1><p>把餡料釀入蟹蓋，再混和水，雞蛋，糖水後，把蛋槳掃上去和加上芝士碎； 把蟹蓋放入焗爐，用250度焗約5分鐘至表面金黃色，完成！<p>', '隻、罐、個、罐、湯匙、適量、適量、適量、隻、茶匙'),
(378, '港式辣炒蟹', '蟹、蒜頭、薑、蔥、辣椒、水、醬油、蠔油、辣椒醬、糖', '3、3、半、3、3、3、1、1、適量、1', '378.png', 'https://icook.tw/recipes/260803', 1, 0, 1, 1, 0, 0, 0, 0, 7, '<h1>1<h1><p>首先會教大家如何處理磅蟹剛好菜市場有特價的磅蟹我的是叫水蟹或三點蟹蟹肉不多不過比較便宜 ， 而且還特價，因為我買的好像快死掉，但依然很鮮 ， 色澤非常美 ，所以這些特價品正正剛好可以用來煮辣炒蟹 ，不用像清蒸一樣追求很鮮味!<p><h1>2<h1><p>1. 先把蟹反轉 ， 然後將刀放在眼睛跟底蓋的中間位置，一刀插下去 ， 因為是心臟位置它就會死掉<p><h1>3<h1><p>2. 先剝掉蟹鉗 ， 從底蓋部份大力一開，反轉，蟹蓋就開了!<p><h1>4<h1><p>3. 紅圈的位置，是他的肺，跟突起來的殼 ，先把突出來的外殼用剪刀剪掉，吃起來就不會割嘴巴!<p><h1>5<h1><p>4. 一邊沖水洗乾淨，一邊把肺除掉另外蟹蓋 ， 紅圈的是突出來的殼跟內臟，也要剪掉除掉!\n如果有蟹膏的話，就小心慢慢的用手，把內臟扯掉清乾淨，小心的留下蟹膏不過你看到我這個蟹蓋沒蟹膏，我就整個棄掉 ， 很懶<p><h1>6<h1><p>5. 蟹鉗也稍稍敲碎一下，吃的時候方便剝殼 完成了預備程序 ,是不是很簡單 !\n如果你真的懶，就買已經?好的蟹，或叫菜市場的人幫你處理就好 !<p><h1>7<h1><p>6. 把水，糖，醬油，蠔油 ，一點辣椒醬，辣椒絲不要籽，攪拌成為一碗醬汁另外把蔥切段 ， 薑切片和磨碎 ， 蒜頭也磨碎就好，如果你覺得太麻煩，全部切片就好<p><h1>8<h1><p>7. 開中火 , 先把薑蒜炒香<p><h1>9<h1><p>8. 放進磅蟹來煎，煎好一邊之後，就反轉煎另外一邊!不用不停的炒 ， 會比較難熟跟很麻煩 ， 把它放進去不理它不就很好嗎<p><h1>10<h1><p>8. 煎另外一邊<p><h1>11<h1><p>9. 兩邊都熟了之後 ， 大概總共6-8分鐘 (磅蟹很快熟) ，就開大火下醬汁! <p><h1>12<h1><p>10. 不停的炒, 炒到醬汁已經剩下一點，就下蔥段<p><h1>13<h1><p>11. 不停的炒，炒到醬汁完全收乾 ， 就完成了其實炒2，3分鐘 醬汁就會完全收乾，非常快速 ,是不是太簡單了 !! <p>', '隻、粒、塊、棵、條、湯匙、湯匙、湯匙、湯匙、適量、茶匙'),
(379, '港式海鮮粥', '白米、皮蛋、魚肉、中卷、蝦仁、薑絲、蔥花、水、鹽、米酒', '200、20、80、80、80、適量、少許、1500、1、少許', '379.png', 'https://icook.tw/recipes/254191', 1, 1, 1, 1, 1, 1, 1, 0, 7, '<h1>1<h1><p>白米洗淨瀝乾，加入皮蛋搓均勻備用。<p><h1>2<h1><p>魚肉、中卷洗淨，切片備用。<p><h1>3<h1><p>（步驟1）中加入水，放入電鍋內鍋中，外鍋加1又1/2杯水，煮至開關跳起續燜5分鐘<p>', '克、克、克、克、克、適量、少許、ml、小匙、少許'),
(380, '鮮蝦餛飩', '豬絞肉、黑木耳、蝦、餛飩皮、水、鹽、蒜末、薑末、五香粉、胡椒粉、紹興酒、醬油、原蔗糖或白砂糖、太白粉、麻油、蔥花', '250、10、75、26、5、少許、2、適量、1、適量、1、適量、1、1、1、1、1、適量', '380.png', 'https://icook.tw/recipes/252380', 1, 1, 1, 1, 1, 0, 1, 0, 7, '<h1>1<h1><p>絞肉先用少許的鹽順著同一個方向攪拌，然後，加入水分也是同一個方向攪拌並摔打至有黏性。把調味料加入拌勻（注意最後才加入麻油）醃約1至2個小時（放進冰箱裡）。<p><h1>2<h1><p>清洗黑木耳後，用食用水泡發，之後瀝水切成細條，放入保鮮袋然後放進冰箱裡，備用。<p><h1>3<h1><p>把蝦清洗處理好，撒上少許鹽抓幾下，靜置5分鐘。然後，清水洗淨、用廚房紙巾擦乾水分、再撒上胡椒粉拌勻，備用。<p><h1>4<h1><p>把絞肉和黑木耳混合好，蝦除外。把蝦切半。<p><h1>5<h1><p>把混合好的絞肉、蝦放在餛飩皮中間，四邊沾上少許的水。<p><h1>6<h1><p>上下對折，兩側黏住。<p><h1>7<h1><p>左、右兩側尾端沾上少許水分黏合。<p><h1>8<h1><p>包好的餛飩先蓋上保鮮膜以妨表皮乾燥。<p><h1>9<h1><p>鍋子注入清水，煮滾後加入少許橄欖油並放入餛飩，蓋上鍋蓋煮至滾後，再加入約一個飯碗的室溫水，再次蓋上鍋蓋煮至滾，撒入蔥花和少許的鹽拌勻即成！<p><h1>10<h1><p>在家裡自己做的港式餛飩真材實料，每一顆都料多飽滿，每一口也是幸福！<p>', '克、克、克、片、湯匙、少許、瓣、適量、茶匙、湯匙、茶匙、茶匙、茶匙、適量'),
(381, '薑汁炒芥蘭', '芥蘭、蒜蓉、薑汁、鹽、糖、紹興酒', '1、適量、2、半、1、適量', '381.png', 'https://icook.tw/recipes/247434', 0, 1, 0, 1, 0, 0, 1, 0, 7, '<h1>1<h1><p>芥蘭洗淨後去老葉和花，將莖斜切備用<p><h1>2<h1><p>因個人口味準備蒜蓉多少。<p><h1>3<h1><p>薑去皮，磨成薑蓉。<p><h1>4<h1><p>榨出薑汁備用。<p><h1>5<h1><p>芥蘭出水3分鐘。<p><h1>6<h1><p>同一時間，燒熱油鑊爆香蒜蓉<p><h1>7<h1><p>加入芥蘭快炒，至芥蘭莖開始軟身和轉色，沿鑊邊贊酒，加鹽和糖調味，落薑汁炒勻熄火，上碟。<p>', '斤、適量、湯匙、茶匙、茶匙、適量'),
(382, '東坡肉', '五花腩、姜、蔥、蒜、生抽、老抽、冰糖、紹興酒、玫瑰露、八角、草果、香葉、桂皮、辣椒', '500、適量、適量、適量、3-4、2、50、2、1、2-3、2-3、3-4、1、1', '382.png', 'https://icook.tw/recipes/360228', 1, 0, 1, 1, 0, 1, 1, 1, 9, '<h1>1<h1><p>將五花腩切成理想的大小，再用綿繩綁緊。冷水冷鍋加薑、蔥和五花腩，開火並煮出血水，水滾後關火，取出五花腩，用冷水沖乾淨並抹乾豬肉和綿繩的水份。檢查豬皮，如有毛毛要用鉗拔掉。豬肉處理好後待用。<p><h1>2<h1><p>下油開鍋，炒香薑蔥蒜和辣椒。薑蔥蒜和辣椒炒香後，拿起放在一旁。<p><h1>3<h1><p>同一個鍋子裏放入冰糖炒至溶化、起泡及成焦糖色。如有需要可以加一點水加快冰糖溶化。<p><h1>4<h1><p>冰糖溶化及變焦糖色後，放入五花腩並煎香每一面。<p><h1>5<h1><p>取出五花腩放在一旁，將炒香的薑蔥蒜和辣椒鋪在鍋底，並將五花腩豬皮朝下放入鍋內。<p><h1>6<h1><p>草果用刀拍開口，與其他調味料一起加入鍋內，並加入適量的水至遮蓋五花腩。大火煮滾，然後轉小火燉兩至三小時。<p><h1>7<h1><p>燉煮約兩小時後，將所有調味料取出，繼續燉煮約一小時，最後用大火煮至收汁。<p>', '克、適量、適量、湯匙、湯匙、克、湯匙、茶匙、塊、粒、片、條、條'),
(383, '中式油飯風味什錦飯', '白米、雞腿肉、胡蘿蔔、鴻喜菇、麻油、酒、醬油、砂糖、雞高湯粉、白熟芝麻', '375、1、1、1、1、4、2、1.5、2、2', '383.png', 'https://icook.tw/recipes/356855', 1, 1, 0, 1, 0, 1, 0, 0, 9, '<h1>1<h1><p>鴻喜菇先切掉根部再拆散，胡蘿蔔切扇形，雞腿肉切成3公分見方的塊狀。<p><h1>2<h1><p>在平底鍋倒入麻油，以中火將雞腿肉炒至變色後，加入胡蘿蔔與鴻喜菇。<p><h1>3<h1><p>接著加入A，以中火拌炒。<p><h1>4<h1><p>將洗好的白米倒入電子鍋內鍋， 加入酒與吸飽食材鮮甜滋味的米飯真是無敵！ 360cc的水，再放入3，開始煮飯。<p>', '克、塊、根、株、大匙、大匙、大匙、小匙、小匙、小匙、小匙'),
(384, '芋頭糕', '芋頭、香菇、紅蔥頭、食用油、豬絞肉、白胡椒粉、糖、米酒、醬油、香菇水、在來米粉、水', '500、4、100、30、100、3、5、5、15、200、250、750', '384.png', 'https://icook.tw/recipes/349410', 1, 1, 0, 1, 0, 1, 0, 0, 9, '<h1>1<h1><p>芋頭洗淨、削皮、切丁<p><h1>2<h1><p>香菇泡水後切丁，香菇水留用<p><h1>3<h1><p>紅蔥頭切碎<p><h1>4<h1><p>鍋子裡倒入油、豬絞肉、香菇、紅蔥頭，炒熟、炒香<p><h1>5<h1><p>再加入白胡椒粉、糖、米酒、醬油，拌炒均勻<p><h1>6<h1><p>加入芋頭丁、香菇水，拌炒均勻，蓋上鍋蓋，小火燜煮15分鐘<p><h1>7<h1><p>準備一個大碗，倒入在來米粉、水，攪拌均勻<p><h1>8<h1><p>將在來米粉漿倒入鍋裡<p><h1>9<h1><p>小火持續攪拌至用鍋勺推開可看見鍋底不回流的濃稠度<p><h1>10<h1><p>再填裝到蒸籠，頂部抹平，邊緣也要抹平，這樣蒸出來才漂亮，若填裝到容器內，可以先抹一層薄薄的油，比較好脫模<p><h1>11<h1><p>滾水蒸30分鐘<p><h1>12<h1><p>蒸好後稍微放涼再取出或脫模，就可以直接切來吃了喔!<p>', '克、片、克、克、克、克、克、克、克、毫升、克、克'),
(385, '麥仔煎', '雞蛋、砂糖、沙拉油、水、中筋麵粉、泡打粉、黑芝麻、砂糖、花生粉', '1、25、1、160、130、5、2、1、3', '385.png', 'https://icook.tw/recipes/348729', 0, 1, 0, 1, 0, 1, 1, 0, 9, '<h1>1<h1><p>先將雞蛋與糖拌勻後加入油及水攪拌均勻，倒入中筋麵粉及泡打粉後攪拌成麵糊備用。<p>', '顆、克、大匙、ml、克、克、大匙、大匙、大匙'),
(386, '上海生煎包', '麵粉、乾酵母、砂糖、鹽、豬腳肉、蔥花、薑泥、醬油、米酒、砂糖、鹽、白胡椒、麻油、橄欖油', '300、3、1、0.5、2、酌量、酌量、少許、少許、少許、少許、少許、少許、少許', '386.png', 'https://icook.tw/recipes/347185', 1, 1, 0, 1, 0, 0, 0, 0, 9, '<h1>1<h1><p>『製作麵皮』在all purpose flour中加入少許鹽、糖、乾酵母、水（慢慢加）開始用手和勻搓揉，揉製10～15分鐘後放室溫發酵1.5小時。<p><h1>2<h1><p>時間到後麵團漲至2倍大，繼續揉排氣，麵團對切拉長長條狀，用刀切成一段一段，蓋上保鮮膜再醒15分鐘。<p><h1>3<h1><p>時間到再用酒瓶桿麵，把一個個小麵團桿成巴掌大的圓形，準備包餡。『製作內餡』在豬絞肉中加入醬油、米酒、麻油、白胡椒、鹽、砂糖、薑末攪拌，中途邊攪繼續加入水、油打出黏性，最後加入蔥花一起攪拌。<p><h1>4<h1><p>在桿成圓形的麵皮上放上餡料，一摺一摺的把麵皮收起來（這段好難，我也是失敗了好幾個，有把它收口起來就好醜醜的沒關係，因為等等在煎生煎包時是收口朝鍋底）。把一顆顆包好的生煎包放在平底鍋中再醒10分鐘（每顆可以留一點空隙）<p><h1>5<h1><p>時間到用用中大火煎油煎生煎包5分鐘→倒入水蓋鍋蓋再繼續煎至稍收乾。<p><h1>6<h1><p>倒入少許油、撒上白芝麻、大把蔥花蓋鍋蓋5分鐘→完成了！！????<p><h1>7<h1><p>這次大概做了23個，每個都有收口收緊，湯汁都沒有流出來????????（沾醬吃也好好吃！）<p>', '克、匙、匙、匙、人份、酌量、酌量、少許、少許、少許、少許、少許、少許、少許'),
(387, '珍珠丸子', '糯米、豬絞肉、鹽、糖、白胡椒粉、薑花、蔥花、太白粉、香油', '1、400、1、1、1.5、10、20、10、10', '387.png', 'https://icook.tw/recipes/347157', 0, 1, 0, 0, 0, 0, 1, 0, 6, '<h1>1<h1><p>糯米倒入水浸泡6小時，瀝乾備用<p><h1>2<h1><p>絞肉加鹽，攪拌出筋<p><h1>3<h1><p>加入糖、胡椒，持續攪拌<p><h1>4<h1><p>加入薑末、蔥花、太白粉、香油，攪拌均勻<p><h1>5<h1><p>抓出大小適中的肉丸子 (大小盡量一致，以便熟成度一致)<p>\n<h1>6<h1><p>裹上糯米並輕壓 (不是只有沾上糯米喔!)<p><h1>7<h1><p>蓋上蒸籠蓋，滾水蒸15分鐘<p><h1>8<h1><p>飽滿挺立的珍珠肉丸子完成囉!<p>', '杯、克、小匙、小匙、小匙、克、克、克、克'),
(388, '小籠湯包', '細絞豬絞肉（3肥7瘦）、皮凍、蔥薑水、蔥、醬油、鹽、棕櫚糖或二砂、白胡椒粉、香油、中筋麵粉、牛奶、酵母、糖、沙拉油', '300、200、50、3、1、1.5、1.5、少許、適量、300、180、2、12、3', '388.png', 'https://icook.tw/recipes/346883', 1, 1, 1, 1, 0, 0, 1, 0, 6, '<h1>1<h1><p>豬皮凍作法連結：https://icook.tw/recipes/345884蔥薑水作法：2根蔥和1小塊薑洗淨略切，加水80g後，直接用果汁機打勻，濾出蔥、薑即可。 或者將洗淨切好的蔥、薑放到裝水的容器中，反複搓揉出味道也可以喔～\n食譜份量可作約20顆小湯包。<p><h1>2<h1><p>豬絞肉先放鹽絞拌出一點黏度後，再放入除了香油以外的調味料，<p><h1>3<h1><p>攪拌成黏稠狀；<p><h1>4<h1><p>加入剁碎的豬皮凍、蔥花和香油拌勻，放冷藏保存。<p><h1>5<h1><p>做麵皮，牛奶中加入糖與酵母略拌勻，加入中筋麵粉和沙拉油；<p><h1>6<h1><p>拌到沒有液體，<p><h1>7<h1><p>大略的揉成糰，蓋起來鬆弛15分鐘；<p><h1>8<h1><p>揉到光亮不黏手；<p><h1>9<h1><p>麵糰秤重，分成15份，將麵糰壓扁後，從外向中間繞一圈的收，抓起麵糰翻面滾圓成球狀。用保鮮膜蓋起來，再次鬆弛10分鐘。<p><h1>10<h1><p>10分鐘後，便可將麵糰壓桿成中間厚，旁邊薄的麵皮，一次桿5片；<p><h1>11<h1><p>取出內餡，包入麵皮中；小湯包體積小，抓摺時用指間輕抓麵皮，邊摺邊轉小湯包，最後收口捏緊。<p><h1>12<h1><p>排入鋪了烘培紙的蒸籠裡；<p><h1>13<h1><p>靜置發酵40-60分鐘（依室內溫，調整發酵時間）；發酵完成後，冷水起蒸18分鐘即可。蒸好後不要馬上開蓋，略等3-5分鐘，待蒸氣散了後再開蓋取出。<p>', '克、克、克、根、湯匙、茶匙、茶匙、少許、適量、克、克、克、克、克'),
(389, '奶白雲吞雞', '春雞、水、牛奶、金華火腿、薑片、京蔥、小棠菜、鮮蝦雲吞、杞子、鹽、粟粉、白胡椒粉', '1、700、50、5、適量、適量、適量、適量、適量、半、1-2、2', '389.png', 'https://icook.tw/recipes/346369', 1, 1, 1, 1, 1, 0, 1, 0, 9, '<h1>1<h1><p>春雞內外洗淨，用粟粉，鹽和白胡椒粉醃15分鐘。<p><h1>2<h1><p>用少量油爆香薑片，京蔥和金華火腿。<p><h1>3<h1><p>加水煮滾。<p><h1>4<h1><p>放入春雞合上蓋中小火煮約20-30分鐘把雞煮熟。<p><h1>5<h1><p>用另一個鍋煮雲吞，以免麵粉令雞湯變味。<p><h1>6<h1><p>雞煲加入杞子，小棠菜及煮至半熟的雲吞。全熟後加入牛奶，即成鮮甜的奶白雲吞雞。<p><h1>7<h1><p>1. 水可以用雞湯取代，不過我比較喜歡天然食材。\n2. 牛奶份量可試味加減至喜愛程度。<p>', '隻、ml、ml、片、適量、適量、適量、適量、適量、茶匙、茶匙、茶匙'),
(390, '南瓜芝麻球', '白芝麻、糯米粉、南瓜泥、白糖', '適量、100-120、些許、30', '390.png', 'https://icook.tw/recipes/340927', 1, 1, 1, 1, 1, 1, 1, 0, 9, '<h1>1<h1><p>將糯米粉倒入糖水、南瓜泥後，揉成一小顆一小顆圓沾上白芝麻後，以小火油炸，浮起可輕壓讓它更膨脹，中火收油完成！<p>', '適量、克、些許、克'),
(391, '蔥油餅', '中筋麵粉、沸水、冷水、蔥花、鹽、胡椒粉、油', '250、120、38、100、4-6、適量、適量', '391.png', 'https://icook.tw/recipes/340204', 1, 1, 0, 1, 1, 0, 1, 0, 6, '<h1>1<h1><p>麵粉過篩，沖入沸水拌勻。用冷水調節軟硬度，揉至光滑。醒10-30分鐘，此時準備蔥花。<p><h1>2<h1><p>取燙麵糰   200g，整型，醒麵。<p><h1>3<h1><p>麵醒好，桿開，均勻抹上ㄧ層油（也可以使用油酥：油+麵粉）、均勻灑鹽、蔥花（可以依各人嗜辣程度，調好胡椒粉蔥花）。<p><h1>4<h1><p>捲起，雙手握著麵的兩端，反方向扭轉，不用拉長只要扭轉。<p><h1>5<h1><p>ㄧ圈圈疊起來，醒10-30分鐘。<p><h1>6<h1><p>桿平，不要桿太用力，稍微有厚度，油餅才會有層次感。<p><h1>7<h1><p>桿好後移到鍋子裡，中小火。（鍋子要預熱）\nㄧ次多做，可以桿開，放到冷凍庫，等下次要吃再去烹煮。<p><h1>8<h1><p>有層次才好吃。<p>', '克、ml、ml、克、克、適量、適量'),
(392, '花雕醉鮑魚', '鮑魚、薑、蔥、冰、花雕紹興酒、糟鹵、蠔油、糖、老抽、水、桂圓、杞子', '6、適量、適量、1、150、150、10、2、2、30、6、1', '392.png', 'https://icook.tw/recipes/339845', 1, 1, 1, 1, 0, 1, 1, 0, 9, '<h1>1<h1><p>準備食物盒及將調味料一起放入。<p><h1>2<h1><p>鮑魚稍稍洗淨待用。水加薑蔥，再溫熱的時候加鮑魚一起煮8-10分鐘直至全熟。<p><h1>3<h1><p>準備冰水。鮑魚熟時撈起，浸冰水保持爽口彈牙。<p><h1>4<h1><p>將鮑魚擦洗乾淨，並取出及去腸。最後將鮑魚放入浸4-5小時即可食用。<p><h1>5<h1><p>小TIPS：1. 加多一片當歸一起浸泡的話，中藥味更香濃哦！2. 咸度和甜度可以自由加減。<p>', '隻、適量、適量、碗、ml、ml、ml、茶匙、茶匙、克、粒、撮'),
(393, '黑糖糕', '黑糖、熱水、蜂蜜、中筋麵粉、樹薯粉（地瓜粉）或太白粉、泡打粉、熟的白芝麻', '100、200、20、140、40、8', '393.png', 'https://icook.tw/recipes/339494', 1, 1, 0, 1, 0, 1, 1, 0, 9, '<h1>1<h1><p>把熱水倒入黑糖盆內攪拌融化至無顆粒狀放涼。待黑糖水放涼後再加入蜂蜜攪拌均勻。<p><h1>2<h1><p>電鍋加3-4杯水先煮沸。將中筋麵粉，樹薯粉過篩至步驟一攪拌均勻至無粉無顆粒狀。（樹薯粉有顆粒，過篩時可用湯匙壓碎）<p><h1>3<h1><p>將泡打粉倒入步驟二攪拌均勻。<p><h1>4<h1><p>把攪拌均勻的麵糊倒入模具，再放入已經滾煮的電鍋內蒸熟至開關跳起。<p><h1>5<h1><p>在蒸熟的黑糖糕上灑上熟的白芝麻，在放進電鍋悶上5-10分鐘即可取出。<p><h1>6<h1><p>將黑糖糕移至鐵架上，剪開翻開四邊鋁箔放涼即可食用。<p><h1>7<h1><p>待放涼後切片，美味香Q的黑糖糕完成囉！<p>', '克、克、克、克、克、克'),
(394, '高麗菜水煎包', '中筋麵粉、砂糖、鹽、牛奶、即溶酵母粉、高麗菜、冬粉、豆干、紅蘿蔔、蝦皮、香麻油、白胡椒粉、砂糖、鹽', '300、18、2、165、10、3、200、1、1、1/3、1、1、、1/2、1', '394.png', 'https://icook.tw/recipes/339120', 1, 1, 0, 1, 0, 0, 1, 0, 9, '<h1>1<h1><p>高麗菜冬粉餡: 高麗菜洗淨切丁，加點鹽巴攪拌，靜置半小時後高麗菜會出水，把水倒掉，用一點過濾水把高麗菜鹽分洗掉，再用力擠乾水分<p><h1>2<h1><p>紅蘿蔔切細絲，豆干切小丁；冬粉下滾水燙熟撈起，剪成小段，和其他餡料和調味料全部拌在一起，超級香~<p><h1>3<h1><p>包水煎包: 把麵團材料攪拌均勻，靜置鬆弛30分鐘。鬆弛好的麵團中間戳一個洞，然後把圈圈越拉越大，再用手截斷<p><h1>4<h1><p>分成10等份(每顆約50g)，滾圓後靜置15分鐘。如果在空氣較乾燥的地方，麵團表面要蓋上一塊布，表皮才不會風乾變硬<p><h1>5<h1><p>將麵團?成中間厚、四周薄的的麵皮<p><h1>6<h1><p>挖一匙餡料在正中央，右手一折一折逆時針方向捏起，左手大拇指幫忙把餡料往下壓，最後捏緊收口。把完成的包子蓋上一塊布，靜置30分鐘<p><h1>7<h1><p>煎生煎包: 熱鍋、倒入一點油，把煎包放到鍋子裡排好、包子間要留一點之後膨脹的距離，開中小火把底部煎到一點金黃色，倒水淹過煎包1/3高度，加蓋悶煮10~12分鐘<p><h1>8<h1><p>水分快燒乾時，翻面把另一面也煎成金黃色<p><h1>9<h1><p>巷口美食水煎包就完成囉!<p>', '克、克、克、克、克、克、克、捆、片、條、大匙、大匙、適量、茶匙、茶匙'),
(395, '鮮蝦白菜捲', '大蝦仁、胡蘿蔔末、大白菜、老豆腐、蔥花、蒜末、薑末、醬油、味醂、鹽、白胡椒粉、減鹽醬油、太白粉', '250、40、10、115、50、1、1、1、1/2、1/2、、1、1', '395.png', 'https://icook.tw/recipes/338583', 1, 1, 1, 1, 1, 0, 1, 0, 6, '<h1>1<h1><p>準備食材。大白菜從蒂頭切、一片一片剝開葉片、清洗乾淨。胡蘿蔔削皮、切末，蔥洗淨、切蔥花。準備蒜末和薑末。老豆腐切片、備用。<p><h1>2<h1><p>燒開半鍋水、放入白菜葉、汆燙白菜葉、過冷水，然後逐一攤開。<p><h1>3<h1><p>把大蝦去頭、去殼保留完整蝦仁。清洗乾淨後，切開蝦背部、清除/挑出腸泥。<p><h1>4<h1><p>蝦仁切丁，再切成蝦泥；亦可使用食物料理機處理。<p><h1>5<h1><p>胡蘿蔔末、蔥花加入蝦泥、調味料也拌入；以筷子攪拌同一方向拌勻，產生黏性。蓋上保鮮膜、冰箱冷藏備用。<p><h1>6<h1><p>雙手沾水，抓適量蝦仁泥、放在老豆腐片上；然後逐一擺在白菜葉上、慢慢捲起。<p><h1>7<h1><p>包好的鮮蝦白菜捲。<p>\n<h1>8<h1><p>鍋裡準備1杯水，加入1湯匙醬油。*此步驟開始可改用電鍋料理，湯碗盛裝湯汁、鮮蝦白菜捲放入湯汁，電鍋外鍋加水1杯、按下開關烹煮。開關跳起、打開鍋蓋即完成囉。<p><h1>9<h1><p>鮮蝦白菜捲擺入鍋。<p><h1>10<h1><p>蓋上鍋蓋燜煮五分鐘，打開鍋蓋查看食材是否熟透。<p><h1>11<h1><p>逐一夾出熟透的鮮蝦白菜捲，擺盤。<p><h1>12<h1><p>鍋裡的湯汁，以太白粉水勾芡、然後淋在鮮蝦白菜捲上。<p><h1>13<h1><p>營養豐富、色香味俱全的鮮蝦白菜捲上桌享用。<p>', '克、克、片、克、克、茶匙、茶匙、茶匙、茶匙、茶匙、適量、湯匙、湯匙'),
(396, '黑糖粉粿', '黑糖、木薯粉、太白粉、水', '200、150、50、500', '396.png', 'https://icook.tw/recipes/337940', 1, 1, 0, 1, 0, 1, 1, 0, 6, '<h1>1<h1><p>準備食材：黑糖、木薯粉、太白粉。<p><h1>2<h1><p>準備黑糖。<p><h1>3<h1><p>黑糖和水300克攪拌均勻，放入鍋裡煮沸。<p><h1>4<h1><p>木薯粉、太白粉混勻，然後加入200克水攪拌均勻。<p><h1>5<h1><p>黑糖水煮沸，立刻沖入備用、已拌勻粉漿，以筷子迅速攪拌成麵糊。<p><h1>6<h1><p>若是溫度不夠、未能糊化，移至爐上加熱；就會迅速成麵糊。<p><h1>7<h1><p>麵糊倒入模具，以沾水的拌匙或湯勺抹平表面。<p><h1>8<h1><p>電鍋外鍋加水1杯、麵糊置蒸架，按下開關進行蒸煮；時間約10-15分鐘。<p><h1>9<h1><p>開關跳起、取出蒸熟的粉粿置涼；蒸熟的黑糖粉粿是透明狀態。等待粉粿完全冷卻，再放入冰箱冷藏。<p><h1>10<h1><p>冰涼後，輕輕一剝就可以脫模囉。<p><h1>10<h1><p>冰涼後，輕輕一剝就可以脫模囉。<p><h1>12<h1><p>黑糖粉粿擺盤享用。<p><h1>13<h1><p>消暑的粉粿綠豆湯。<p><h1>14<h1><p>黑糖粉粿沾裹黃豆粉，別具風格的美味。<p>', '克、克、克、克'),
(397, '麻婆炒麵', '絞肉、青江菜、寬版麵、蒜頭、豆瓣醬、麻辣醬、砂糖、水、醬油', '1、1、1、4-5、4、適量、2、2、2', '397.png', 'https://icook.tw/recipes/329764', 1, 1, 0, 1, 0, 0, 0, 0, 9, '<h1>1<h1><p>將所需食材備妥。<p><h1>2<h1><p>1）青江菜洗淨切小段備用2）蒜頭切末備用（蔥花可有可無）<p><h1>3<h1><p>燒一鍋熱水，煮開後將一整包麵條倒入。煮4-5分鐘（偏硬口感）時間到後熄火。將熱水倒掉，用冷水沖一下麵條降溫，以免等待時麵條變軟。<p><h1>4<h1><p>煮麵時，可以開始準備底料。熱鍋後倒入適量沙拉油。放入蒜末炒香。<p><h1>5<h1><p>倒入絞肉拌炒<p><h1>6<h1><p>絞肉炒散變色後，倒入4大匙豆瓣醬，適量麻辣醬（依個人可承受辣度自行調整），醬油2大匙，2匙糖拌炒。<p><h1>6<h1><p>絞肉炒散變色後，倒入4大匙豆瓣醬，適量麻辣醬（依個人可承受辣度自行調整），醬油2大匙，2匙糖拌炒。<p><h1>7<h1><p>再倒入2碗水稍微燉煮一下。不用太久，2-3分鐘即可<p><h1>8<h1><p>倒入青菜拌炒<p><h1>9<h1><p>等青菜變軟<p><h1>10<h1><p>倒入剛才煮好的麵條<p><h1>11<h1><p>拌炒均勻後即可熄火。底下的湯汁等一下會被麵條吸收，不用收乾沒關係。<p><h1>12<h1><p>盛盤享用囉～<p>', '盒、包、包、瓣、大匙、適量、小匙、碗、大匙'),
(398, '鯛魚絲瓜', '絲瓜、鯛魚、蒜頭、鹽', '一條、2片、適量、適量', '398.png', 'https://icook.tw/recipes/328653', 1, 1, 1, 1, 1, 0, 1, 0, 6, '<h1>1<h1><p>絲瓜去皮切片。鯛魚切成條狀。蒜頭切末備用。<p><h1>2<h1><p>熱鍋後倒入少許油。放入蒜末炒香。<p><h1>3<h1><p>放入鯛魚條拌炒。<p><h1>4<h1><p>魚肉變白後先起鍋。<p><h1>5<h1><p>再倒入絲瓜拌炒後，加入一碗水滾一下。<p><h1>6<h1><p>等絲瓜滾到變軟。<p><h1>7<h1><p>倒入魚肉。加入適量鹽巴調味。<p><h1>8<h1><p>再稍微滾一下至魚肉熟透。<p><h1>9<h1><p>起鍋盛盤。<p>', '條、片、適量、適量'),
(399, '鹹甜炸年糕', '年糕、青蒜、香菜、酥炸粉、水、胡椒粉、鹽巴', '300、1-2、2-3、1、0.8、適量、1', '399.png', 'https://icook.tw/recipes/322339', 1, 1, 1, 1, 1, 0, 1, 0, 6, '<h1>1<h1><p>將酥炸粉先加水調成粉漿，加入鹽巴攪拌均勻後，青蒜跟香菜切末加入粉漿內攪拌均勻，年糕切成適合大小，再將年糕放入粉漿內拌勻<p><h1>2<h1><p>油溫約160-180度放入裹上麵糊的年糕，炸至粉漿金黃色，撈出年糕即可。<p><h1>3<h1><p>灑上適量胡椒粉即可享用。<p>', '克、根、根、碗、碗、適量、匙'),
(400, '台式鹽酥雞', '雞胸切丁、蒜泥、薑泥、蔥段、醬油膏、醬油、水、五香粉、迷迭香、香蒜黑胡椒粉、白胡椒粉、義大利香料、二砂糖、中筋麵粉、地瓜粉、義大利香料、九層塔、鹽酥雞胡椒粉、日式辣椒粉、台式辣椒粉', '1、5、5、3、2、2、5、大量、適量、大量、適量、適量、1、比例3、比例1、適量、半、很多、1、適量', '400.png', 'https://icook.tw/recipes/358788', 1, 1, 1, 1, 1, 1, 1, 0, 6, '<h1>1<h1><p>醃料攪拌後放入雞胸<p><h1>2<h1><p>均勻裹粉<p><h1>3<h1><p>使用不沾鍋 中火熱油 置入雞胸炸<p><h1>4<h1><p>撈起雞胸 靜置三分鐘  後回鍋內加溫 順帶加入九層塔及鹹酥雞胡椒粉  即可上菜<p>', '個胸、瓣、片、根、匙、匙、匙、大量、適量、大量、適量、適量、匙、比例3、比例1、適量、包、很多、包、適量'),
(401, '臘腸炒飯', '米、高麗菜、香腸、蒜頭、紅蔥頭、低醬油、沙茶醬、鹽、紅蘿蔔', '1.5、1/4、3、5、1、1/2、1', '401.png', 'https://icook.tw/recipes/360376', 0, 1, 0, 0, 1, 0, 0, 0, 6, '<h1>1<h1><p>1-香腸煮熟，切成丁狀備用2-兩湯匙油放入鍋內，加蒜頭爆香，紅籮蔔，煮到有點熟，雞蛋3個打散放入鍋內，再加入高麗菜翻炒，順序加醬油，鹽，沙茶，炒到有點香味。3-把爆好的紅蔥頭，跟煮好的米飯，放入鍋內一起飯炒，以中小火拌勻即可，最後加入香腸就完成。<p>', '碗、顆、條、顆、湯匙、小匙、大匙'),
(402, '台式手扒雞', '全雞、蔥、薑、蒜頭、米酒、水、蠔油、鹽、糖、白胡椒粉、五香粉、蜂蜜、黑胡椒鹽、配菜(馬鈴薯、地瓜、胡蘿蔔)', '1隻、2支、1小塊、5瓣、100ml、300ml、80g、2茶匙、1大匙、1茶匙、1小碗、適量、適量', '402.png', 'https://icook.tw/recipes/360566', 1, 0, 0, 1, 0, 1, 0, 0, 6, '<h1>1<h1><p>醃料: 把蔥切段，蒜頭5瓣去皮，薑切薄片<p><h1>2<h1><p>把蔥薑蒜加入米酒和水，用攪拌棒打碎，渣渣過濾掉，攪拌過的辛香料更能釋放香氣，讓雞肉更入味<p><h1>3<h1><p>加入五香粉、鹽、糖、白胡椒粉和蠔油，攪拌到糖鹽融化<p><h1>4<h1><p>醃雞: 把全雞洗淨、擦乾<p><h1>5<h1><p>剛剛的蔥薑蒜渣渣不要丟，塞進雞肚子裡，可以去除雞肉腥味<p><h1>6<h1><p>用一個大盆子或是大塑膠袋，把全雞和醃料放入，空氣擠出密封起來，把雞肉按摩搓揉，雞胸朝下放冰箱一整晚，中間把全雞翻面一次，讓兩面都醃到入味<p><h1>7<h1><p>烤雞:全雞從冰箱取出，把雞身裡的醃料取出，放在室溫回溫。準備耐烤的蔬菜，如馬鈴薯、地瓜等，滾刀切成大塊，洋蔥鋪在全雞底下，把雞架高，可以讓熱對流到底部，讓烤盤底部不燒焦，蔬菜同時也可以吸收肉汁精華<p><h1>8<h1><p>雞胸這面朝上，把雞翅尾端收到雞身下方，雞腿交錯、用棉繩綁起來，烤出來的形狀會比較漂亮<p><h1>9<h1><p>把烤箱預熱400F(205C)，把全雞放進烤箱烘烤30分鐘<p><h1>10<h1><p>在表皮刷上一層厚厚的蜂蜜幫助上色，再放入烤箱烤10分鐘，這個動作重複兩次，表面會越來越上色<p><h1>11<h1><p>把雞肉翻到背面，一樣刷上蜂蜜、烤10分鐘，重複兩次。如果表片有局部比較上色的部分，可以剪一塊鋁箔紙蓋住再烤，避免燒焦。雞腿尾端、雞翅、雞屁股因為體積比較小，上色比較快，還有雞胸上部凸出來的兩塊胸部也很容易上色。這時候底部已經有不少肉汁，把底下的地瓜馬鈴薯翻動一下、均勻沾上肉汁繼續烤<p><h1>12<h1><p>用一支竹籤，插到雞胸肉和雞腿排最厚的部位，流出來的肉汁如果沒有帶血色，就代表雞肉熟了，如果不夠就再入爐烤一下<p><h1>13<h1><p>香噴噴的手扒雞出爐! 用剪刀剪成大塊，吃起來更方便!<p><h1>14<h1><p>一定要沾粗粒的黑胡椒鹽最對味!<p>', '隻、支、小塊、瓣、ml、ml、g、g、茶匙、大匙、茶匙、小碗、適量、適量'),
(403, '白菜滷', '大白菜、乾香菇、紅蘿蔔、大蒜、薑片、乾蝦米、蔥段、醬油、烏醋', '半、5-6、1/3、6-8、2-3、適量、2-3、1、1', '403.png', 'https://icook.tw/recipes/359656', 1, 1, 1, 1, 1, 0, 0, 0, 6, '<h1>1<h1><p>備料！<p><h1>2<h1><p>起油鍋，蝦仁炒香後，續加入香菇絲、蒜泥、蒜頭、薑片、蔥白段（可省略）爆香！<p><h1>3<h1><p>加入紅蘿蔔絲（片）略炒至軟！（也可加入黑木耳）<p><h1>4<h1><p>白菜梗的部份先下鍋炒至微軟，加入醬油一大匙拌炒一下。再加入香菇水、熱開水合計約100cc，煮滾後中小火蓋鍋悶煮10分鐘。（白菜本身會出水，所以不用加太多水）<p><h1>5<h1><p>續加入菜葉部份，悶煮10分鐘，加入烏醋一大匙、鹽調味，再加入綠蔥段拌炒一下，起鍋！<p>', '顆、朵、條、顆、片、適量、支、大匙、大匙'),
(404, '刈包', '刈包皮、酸菜、橄欖油A、二砂糖A、OmniPork新餐肉、鹽、橄欖油B、蔥、蒜、醬油、米酒、二砂糖B、花生粉(以加糖)、香菜葉', '4、300、10、27、4、6.5、3、2、4、6.7、15、3.2、20、7', '404.png', 'https://icook.tw/recipes/357564', 1, 1, 1, 1, 1, 0, 0, 0, 6, '<h1>1<h1><p>所有食材的準備盤點，今天使用了OmniPork新餐肉作為刈包的主食，反而比過往做刈包的料理時間還要短又方便<p><h1>2<h1><p>酸菜開封後先清水洗過多次，讓原本醃漬多餘的鹽分給沖洗掉，我買的這包酸菜比以往的酸菜要來的不鹹，但還是多沖洗了幾次，然後記得濾乾<p><h1>3<h1><p>熱鍋下橄欖油A，油熱就加入濾乾的酸菜，加入二砂糖A及鹽，炒至乾爽卻油亮<p><h1>4<h1><p>蒜頭拍扁，蔥切段<p><h1>5<h1><p>熱鍋下橄欖油B，鍋熱下OmniPork新餐肉(新餐肉不需退冰，冷凍取出直接下鍋煎），煎至兩面金黃即先起鍋，待用<p><h1>6<h1><p>原鍋直接繼續煸炒蔥段及蒜頭，煸至帶有微微金黃上色，且香味飄出，加入醬油、米酒、二砂糖B，將糖炒至溶化<p><h1>7<h1><p>放入煎好的OmniPork新餐肉，煨至上醬色即可關火(約5分鐘左右就可以)<p><h1>8<h1><p>將熱好的刈包皮從電鍋取出後，夾上一塊OmniPork新餐肉、酸菜(依自己喜歡的方式夾，照片是夾入一匙的份量)<p><h1>9<h1><p>加入花生粉(一個約5克)及香菜葉(一個約1.7克左右)<p><h1>10<h1><p>快速上桌熱騰騰的刈包，免去以往滷肉花費的時間，新餐肉真的很方便，不用等尾牙給自己一個吃刈包的理由了，想吃就可以來一份嘍<p>', '個、克、克、克、塊、克、克、根、顆、克、克、克、克、克'),
(405, '鮮蝦台式涼麵', '油麵、草蝦開背、小黃瓜切絲、蛋皮切絲、冰水、蔥切段、薑、米酒、鹽巴、義香芝麻醬、糖、醬油、白醋、冰開水、蒜頭磨成泥', '300、10、隨意、2、1000、1、3、1、1、1、1、2、80、5', '405.png', 'https://icook.tw/recipes/353523', 1, 0, 0, 1, 0, 0, 0, 0, 6, '<h1>1<h1><p>將醬汁材料混和均勻備用<p><h1>2<h1><p>準備一鍋水開大火加熱，水沸騰後加入蔥、薑、鹽、米酒及草蝦燙1分鐘後撈起備用<p><h1>3<h1><p>再加入油麵燙10秒撈起並放入冰水中冰鎮一下<p><h1>4<h1><p>將冰鎮好的油麵撈起並加入兩大湯匙的食用油攪拌均勻<p><h1>5<h1><p>將所有處理後的食材擺好之後淋上醬汁即可收工<p>', '克、隻、隨意、張、ml、根、片、大匙、大匙、包、湯匙、湯匙、ml、瓣'),
(406, '台式黃金泡菜', '白菜、蒜頭瓣、豆腐乳、白醋、蘋果、蘿蔔、鹽、香油或麻油、糖', '1、3-5、4、90、1、2、適量、30、適量', '406.png', 'https://icook.tw/recipes/353017', 0, 1, 0, 0, 0, 0, 0, 0, 6, '<h1>1<h1><p>備料後將白菜洗淨，切適當的大小<p><h1>2<h1><p>放入大盆子，利用適量的鹽巴醃漬<p><h1>3<h1><p>在等待醃製過程中，我會利用周邊比較重的物品重壓在白菜上，加速和以利水「生」出來<p><h1>4<h1><p>在醃製泡菜過程可以將其他的備料切成小丁放進去果汁機打成醬汁??這次我用3顆蒜頭瓣??，因為我這次白菜的比較小顆??喜歡酸一點的、辣一點的可以再多放白醋跟辣椒粉哦??另外手邊沒有蘋果，但有蘋果醋，也可以用蘋果醋代替白醋跟蘋果<p><h1>5<h1><p>白菜經過鹽的醃製後會生水，需要洗乾淨擰乾再放入要保存泡菜的容器裡唷<p><h1>6<h1><p>之後再把醬汁放入攪均勻<p><h1>7<h1><p>黃金泡菜完成放一天會「越陳越香」哦<p>', '顆、顆、塊、ml、顆、條、適量、ml、適量'),
(407, '紅燒滷肉', '豬腩肉、薑、大蔥、水、老抽、醬油、冰糖、米酒、八角、草果、桂皮、月桂葉、玫瑰露、白胡椒', '2、3-5、1、1、3、4-5、1、2、5-6、3-4粒1、3、幾滴、適量', '407.png', 'https://icook.tw/recipes/352348', 1, 0, 0, 1, 1, 1, 0, 0, 9, '<h1>1<h1><p>豬腩肉洗淨，拔除毛毛。將豬腩肉，姜，蔥放入冷水，慢慢用小火煮至出血水。將豬腩肉切成理想中的厚度。<p><h1>2<h1><p>下油開鍋，將姜和大蔥炒出香味。 將豬腩肉放進去炒香至出豬油，豬肉表層帶焦啡色。<p><h1>3<h1><p>草果用刀拍開口。加一碗水，將所有調味料放進然後用小火開始燉煮約1小時。<p><h1>4<h1><p>醬汁要蓋過豬肉，不夠的話再加水。中途翻轉，確保所有豬肉都可以沾上醬汁。<p><h1>5<h1><p>豬肉差不多煮至變軟前開蓋煮至收汁即可。<p>', '條、片、條、碗、湯匙、湯匙、湯匙、湯匙、粒、粒、片、幾滴、適量'),
(408, '紅燒牛肉麵', '牛肋條、番茄、洋蔥、薑片、蒜頭、蔥、八角、辣豆瓣醬、醬油、辣椒、冰糖、蘿蔔', '1、1-2、2、2、6、7、3、1、2-3、90、自行斟酌、1、300', '408.png', 'https://icook.tw/recipes/346116', 1, 0, 1, 1, 0, 1, 0, 0, 9, '<h1>1<h1><p>倒少許油熱鍋，放入薑片和大蒜炒至金黃色後加入蔥（白色部分）和切薄的洋蔥片（一顆洋蔥量）炒至變軟後再加入切成大塊的蕃茄和牛肋條炒至表面變色（三分熟）。<p><h1>2<h1><p>加入辣豆瓣醬炒香後，接下來加入醬油和冰糖拌炒均勻。<p><h1>3<h1><p>加入300c.c.的熱水，滾開後放入切好的蘿蔔和切大塊的洋蔥（一顆）再加入熱水蓋過食材即可。<p><h1>4<h1><p>大火煮滾後轉中火滾20-30分鐘再轉小火滾30分鐘，關火後等30分鐘即完成。<p>', '公斤、顆、顆、顆、片、粒、支、個、大匙、克、自行斟酌、匙、克'),
(409, '三杯雞', '雞里肌肉、九層塔、蔥、小辣椒、薑、蒜、太白粉、鹽、糖、醬油、麻油、米酒、糖', '250、1、1、1、2、3、1、0.5、1.5、2、2、2、1、1', '409.png', 'https://icook.tw/recipes/343326', 0, 0, 0, 1, 0, 0, 0, 0, 9, '<h1>1<h1><p>九層塔洗淨瀝乾水分；小辣椒切小段；薑、蒜頭切片；蔥切段。<p><h1>2<h1><p>雞肉切塊，加入醬油、鹽、糖、太白粉醃15-20分鐘。<p><h1>3<h1><p>用中火煎一下雞肉，煎至7、8分熟時可撈起瀝油備用。<p><h1>4<h1><p>留著煎雞肉的油（如果覺得油太多，可以倒掉一些），爆香蒜、薑，然後加入辣椒、九層塔快炒。<p><h1>5<h1><p>轉中大火，倒入雞肉，加入醬油、米酒、麻油、糖、一碗水炒至均勻。<p><h1>6<h1><p>煮至醬汁濃稠後即可起鍋。<p>', '克、把、條、條、片、瓣、茶匙、茶匙、茶匙、湯匙、湯匙、湯匙、湯匙、湯匙'),
(410, '海鮮粥', '豬背骨、手工虱目魚丸、文蛤、洋蔥、透抽、白飯、鹽、水', '1、1、300、1、、3、1、1800', '410.png', 'https://icook.tw/recipes/342711', 1, 0, 1, 0, 1, 0, 1, 0, 9, '<h1>1<h1><p>買回來經過兩天的文蛤下鍋前先用些鹽水浸泡30分鐘！讓牠吐沙我買的這包沒沙.而且文蛤泡水後紛紛的吐出斧足很新鮮<p><h1>2<h1><p>洋蔥切絲<p><h1>3<h1><p>豬背骨用水洗過後跟洋蔥ㄧ起入鍋加入1800cc的水熬湯30分鐘也可以用電鍋！外鍋一杯水按下開關煮兩次<p><h1>4<h1><p>湯底熬好後！加入手工虱目魚丸<p><h1>5<h1><p>加入白飯<p><h1>6<h1><p>加入文蛤和透抽鹽調味文蛤和透抽熟就能關火<p><h1>7<h1><p>海鮮粥的海鮮種類不限<p>', '盒、盒、克、顆、適量、碗、湯匙、ml'),
(411, '炒烏龍麵', '紅蘿蔔、木耳、鴻禧菇、香瓜、青江菜、肉絲、烏龍麵、香油、醬油、胡椒粉、米酒、烏醋', '1/3、1、半、2、4、半、2、一點、一點、一點、一點、一點、一點、半、半', '411.png', 'https://icook.tw/recipes/342164', 1, 1, 1, 1, 1, 0, 0, 0, 9, '<h1>1<h1><p>將胡蘿蔔木耳鴻禧菇放入鍋內炒一炒<p><h1>2<h1><p>青江菜 肉醃製好（如何醃製如請看食材唷） 香菇切絲泡水<p><h1>3<h1><p>烏龍麵我使用個<p><h1>4<h1><p>再將全部的東西陸陸續續放入鍋內剛剛胡蘿蔔木耳鴻禧菇放入鍋內後再放入香菇絲還有醃製好的肉，再放入青江菜過最後放入烏龍麵 醬油 米酒 烏醋 香菇水 都最後再一起放入<p><h1>5<h1><p>稍微收汁就可以起鍋囉！最後再另外煎荷包蛋半熟，就可以上桌囉！<p>', '根、大片、包、大片、朵、碗、一點、一點、一點、一點、一點、一點、杯、湯匙'),
(412, '碗粿', '豬絞肉、香菇、雞蛋、油蔥酥、醬油、砂糖、白胡椒粉、在來米粉(沾米粉)、太白粉、水、油、鹽、糖、蠔油(醬油膏)、蘿蔔乾、蒜頭、水、砂糖', '200、4、4、1、2、3、少許、200、60、1040、1、1/2、1/2、3、適量、3、1、1', '412.png', 'https://icook.tw/recipes/335217', 0, 1, 0, 1, 0, 0, 1, 0, 9, '<h1>1<h1><p>把乾香菇洗淨、去掉香菇梗，加水泡發<p><h1>2<h1><p>將雞蛋煮熟去殼，絞肉下鍋炒散，加入油蔥酥和香菇，炒出香氣後，加入醬油、糖、白胡椒粉調味，加一小碗水小火煨煮30~40分鐘，雞蛋也放下去一起滷<p><h1>3<h1><p>碗粿米漿: 把沾米粉200g和太白粉60g混和，沒有太白粉也可以改用玉米粉，倒入200g清水，攪拌成粉漿<p><h1>4<h1><p>燒一鍋水(其餘840g)，加入1/2茶匙糖、1/2茶匙鹽、和一大匙油，水滾後沖進粉漿並快速攪拌，滾水會讓粉漿糊化成半熟狀態<p><h1>5<h1><p>把粉漿裝入碗中(約八分滿)，表面抹平，大約可以裝6~8碗左右<p><h1>6<h1><p>肉燥滷好後，在碗粿上放上半朵香菇、一匙肉燥、1/4顆滷蛋(或一顆鹹蛋黃)，滷汁依個人口味淋上<p><h1>7<h1><p>放入電鍋，外鍋加入1.5米杯的水蒸至跳起，或用爐子大火蒸25~30分。蒸好後不要馬上拿出來，在鍋內悶20~30分後再取出<p><h1>8<h1><p>醬料: 蠔油、砂糖和一點水(用熱水先溶解砂糖)、再磨一點蒜泥、放入一點蘿蔔乾，混和均勻後淋在碗粿上面當淋醬<p><h1>9<h1><p>熱熱的碗粿口感比較軟綿，放涼後比較香Q有彈性<p>', '克、朵、顆、大匙、大匙、茶匙、少許、克、克、克、大匙、小匙、小匙、大匙、適量、瓣、大匙、茶匙'),
(413, '飯糰', '糯米、菜脯粒、肉鬆、油條、雞蛋、青蔥、蒜泥', '1、1、適量、1/2條、2、2、1', '413.png', 'https://icook.tw/recipes/333926', 0, 1, 0, 0, 1, 1, 1, 0, 9, '<h1>1<h1><p>將油條剪成適當大小，青蔥切末備用。<p><h1>2<h1><p>準備1米杯量的糯米，加上0.6的水，將糯米煮熟備用。<p><h1>3<h1><p>以氣炸鍋氣炸油條，溫度設定200度C，時間15分鐘。<p><h1>4<h1><p>熱鍋加少許的油，將菜脯粒及蒜泥炒香，可加入少許的日式醬油調味。<p><h1>5<h1><p>將雞蛋、青蔥及少許的鹽混勻，熱鍋加1匙的油，煎好蔥花蛋備用。<p><h1>6<h1><p>將糯米挖取出，用飯匙把糯米舖平。<p><h1>7<h1><p>將菜脯粒舖上。<p><h1>8<h1><p>加入肉鬆。<p><h1>9<h1><p>加入蔥花蛋。<p><h1>10<h1><p>加入油條。<p><h1>11<h1><p>將飯糰包妥。<p><h1>12<h1><p>美味的台式飯糰就完成了哦。<p>', '杯、碗、適量、條、顆、支、顆'),
(414, '滷豬腳', '豬前腿、蔥、薑、蒜、醬油、酒、可樂、五香粉、油、月桂葉、桂皮、八角、小辣椒、胡椒粒', '1、3、1、半、100、100、250、1、20、3、1、3、4、隨意', '414.png', 'https://icook.tw/recipes/332108', 1, 0, 0, 1, 1, 1, 0, 0, 9, '<h1>1<h1><p>豬腳切小塊，蔥，薑和蒜切段/片/去皮。蔥白和蔥青分開。<p><h1>2<h1><p>鍋中放些油，直接將洗淨的豬腳放入翻炒。<p><h1>3<h1><p>豬腳的血色快消失時，加入蔥白，薑和蒜，繼續翻炒。加入醬油，酒和可樂，煮滾。可加入少許的水。加入五香粉。<p><h1>4<h1><p>倒入砂鍋中，加入香料包，水滾後轉小火，1小時後關火。<p>', '隻、支、小塊、粒、ml、ml、ml、小匙、ml、葉、片、顆、個、隨意'),
(415, '古早味蛋糕', '菜油/ 無鹽牛油、低筋麵粉、全脂牛奶、全蛋、砂糖、雲呢拿香油 ', '50、50、50、3、50、數滴', '415.png', 'https://icook.tw/recipes/331239', 1, 1, 0, 1, 0, 1, 1, 0, 9, '<h1>1<h1><p>預備：1. 在正方形模鋪上焗爐紙2. 低筋麵粉過篩一次3. 蛋白和蛋黃分開，蛋白放入雪櫃雪凍4. 預熱焗爐150℃<p><h1>2<h1><p>1. 低筋麵粉在大碗過篩一次備用2. 煮滾一鍋水至微滾。牛奶和菜油放攪拌盤中，用手動攪拌器一邊攪拌，大火加熱1分鐘3. 將小鍋的牛奶直接倒入低筋麵粉中快手拌勻，之後加幾滴雲呢拿香油（可加可不加）<p><h1>3<h1><p>分3次加入蛋黃攪勻<p><h1>4<h1><p>從雪櫃取出蛋白，用電動攪拌機打再起泡，分3次加入砂糖，將蛋白打至濕性發泡<p><h1>5<h1><p>預熱焗爐150°C。將1/3蛋白加入蛋黃糊中拌勻，將所有蛋黃糊倒入蛋白霜中輕手拌勻<p><h1>6<h1><p>將蛋糕糊倒入鋪好焗爐紙的正方模具中，鋪平，在桌上”登” 幾下<p><h1>7<h1><p>將蛋糕盤放在大焗盤上，注入50°C溫水，水浴法150°C 60分鐘，完成脫模，放在架上放涼切件享用<p>', '克、克、克、隻、克、數滴'),
(416, '玉米濃湯', '玉米粒、馬鈴薯、紅蘿蔔、洋蔥、蒜頭、蛋、黑胡椒、鹽、奶粉', '1、2、2、2、適量、2、適量、適量、4', '416.png', 'https://icook.tw/recipes/330646', 1, 0, 0, 0, 1, 0, 1, 0, 9, '<h1>1<h1><p>食材準備：1.馬鈴薯切丁2.紅蘿蔔切丁3.洋蔥切丁4.蒜頭切碎5.玉米粒備用<p><h1>2<h1><p>取一鍋熱油後，先下蒜頭爆香<p><h1>3<h1><p>下玉米、馬鈴薯、紅蘿蔔、洋蔥炒出香氣<p><h1>4<h1><p>加水，淹過食材<p><h1>5<h1><p>燜煮，待馬鈴薯的澱粉質煮出（可將煮好的食材先倒入調理機或果汁機攪拌一下，會更快），湯變濃稠狀<p><h1>6<h1><p>取200cc水+奶粉四匙攪拌均勻後，加入湯中<p><h1>7<h1><p>加入蛋液<p><h1>8<h1><p>加入黑胡椒、鹽調味<p><h1>9<h1><p>好喝的台式玉米濃湯即可上桌囉～<p>', '罐、顆、根、顆、適量、顆、適量、適量、匙'),
(417, '蘆筍炒蝦仁', '蘆筍、蝦子、辣椒、蛋白、老薑、玉米粉、鹽巴、米酒', '1、8、1、1、5、5、3、5', '417.png', 'https://icook.tw/recipes/329788', 1, 0, 0, 1, 0, 0, 0, 0, 9, '<h1>1<h1><p>備料：蝦子去腸泥，蝦殼留下。蘆筍去皮後切3-4公分，薑切薄片，辣椒去籽切塊<p><h1>2<h1><p>煮鍋：煸蝦子後加入水，熬煮蝦高湯<p><h1>3<h1><p>熱平底鍋：約50g的油來炸蘆筍，可以保持蘆筍的鮮度*若有炸鍋也願意多洗一個炸鍋，可以用炸鍋炸。在此為省油以及方便，用平底鍋傾向一邊，簡單過個油<p><h1>4<h1><p>熱平底鍋：蝦子洗乾淨後用廚房紙巾擦乾，裹上蛋白與玉米粉，下油鍋炸，可以幫助蝦子定型<p><h1>5<h1><p>熱平底鍋：濾掉油後，將過油的蘆筍、薑片、辣椒與蝦子拌炒，加入鹽巴、米酒與熬煮的蝦高湯，大火快煸約3分鐘即完成<p><h1>6<h1><p>擺盤：完成！<p>', '把、隻、根、顆、薄片、克、克、克'),
(418, '薑絲蛤蜊清湯', '蛤蜊、薑絲、米酒、九層塔、香菜、香油、白胡椒鹽', '適量、適量、適量、少許、少許、少許、少許', '418.png', 'https://icook.tw/recipes/328296', 1, 0, 0, 1, 1, 1, 0, 0, 9, '<h1>1<h1><p>蛤蜊吐沙後清洗乾淨備用, 薑切絲, 九層塔/香菜洗淨備用～<p><h1>2<h1><p>取一湯鍋, 加水煮開~ 水煮開之後加入薑絲, 再加入蛤蜊 (千萬不要用雞湯或雞湯塊調味, 會讓湯的味道變奇怪又混濁)<p><h1>3<h1><p>蛤蜊的殼一開之後立即夾出來, 才會飽滿又新鮮(一顆一顆夾, 不要等到整鍋蛤蜊都打開才撈出來, 蛤蜊每顆熟成時間不同, 等到全部蛤蜊打開...有的都已經煮過頭了)<p><h1>4<h1><p>湯碗裡加入蛤蜊, 少許米酒, 幾滴的香油; 再放入一點九層塔及香菜, 最後淋上熱熱的湯再灑上一點白胡椒鹽, 一碗好喝又清甜的蛤蜊湯就完成了<p>', '適量、適量、適量、少許、少許、少許、少許'),
(419, '台式壽司', '海苔、紅蘿蔔、小黃瓜、雞蛋、肉鬆、米飯', '1包、1條、1條、1個、酌量、酌量', '419.png', 'https://icook.tw/recipes/326060', 0, 1, 0, 1, 1, 1, 1, 0, 9, '<h1>1<h1><p>1.紅蘿蔔燙好切成一小條。2.小黃瓜洗乾淨後切成一小條。3. 煮好飯4.雞蛋煎好切成條狀。5肉鬆備好。<p><h1>2<h1><p>1.煮好的飯鋪平在海苔上，平放壽司捲簾上。2.在中間的地方，鋪平肉鬆、小黃瓜、紅蘿蔔、蛋。3.海苔捲成圓狀，完成。<p>', '包、條、條、個、酌量、酌量');
INSERT INTO `allrec` (`ID`, `name`, `ing`, `num`, `img`, `link`, `heartattack`, `pneumonia`, `diabetes`, `Lower_respiratory_tract`, `hypertension`, `Nephritis`, `Liver`, `total`, `type`, `step`, `unit`) VALUES
(420, '蔥花手撕麵包', '高筋麵粉、砂糖、鹽、酵母粉、水、蛋、奶油、蛋黃液、蔥花、鹽、胡椒、油', '230g、22g、3g、3g、123g、22g、22g、1顆、5支、適量、適量、適量', '420.png', 'https://icook.tw/recipes/324285', 1, 1, 0, 1, 1, 0, 1, 0, 9, '<h1>1<h1><p>準備材料<p><h1>2<h1><p>麵團製作除了奶油，其他的材料都倒入盆中攪拌<p><h1>3<h1><p>攪拌完後，在桌面灑一些麵粉開始揉麵團，表面比一開始光滑就差不多了<p><h1>4<h1><p>分成3等份，在中間放入奶油揉勻<p><h1>5<h1><p>盆中抹一點奶油再放入麵團最後包上保鮮膜，開始發酵使麵團發酵至原本的1.5～2倍大<p><h1>6<h1><p>手指沾一點麵粉插入麵團中，不回縮即完成<p><h1>7<h1><p>分成8等份搓圓，用濕布蓋在麵團上約20分鐘<p><h1>8<h1><p>再次搓圓放入模具中，用保鮮膜包大約20分鐘<p><h1>9<h1><p>塗上蛋液<p><h1>10<h1><p>蔥+鹽+胡椒+油，攪拌均勻後灑在以塗上蛋液的麵團上<p><h1>11<h1><p>放入事先預熱好的烤箱185度烤20～25分，中途要轉一下模具的位置，否則會烤的不均勻<p><h1>12<h1><p>完成～<p>', '克、克、克、克、克、克、克、顆、支、適量、適量、適量'),
(421, '熱炒牛柳', '牛小排、洋蔥、玉米筍、九層塔、醬油膏、醬油、烏醋、香油、紅糖', '1、半、5、少許、1、少許、少許、少許、1', '421.png', 'https://icook.tw/recipes/314424', 1, 0, 1, 0, 1, 0, 0, 0, 9, '<h1>1<h1><p>備料。（因為蔥價太高，所以沒有使用蔥跟蒜，如果有可以加）牛肉切成條狀，用醃料拌勻，把洋蔥、玉米筍切好。<p><h1>2<h1><p>中火熱鍋，一小匙油先把玉米筍、洋蔥炒軟，起鍋備用。再放入牛肉翻炒至七分熟時，再把蔬菜倒回拌炒，再加入調味料，而烏醋、辣椒、九層塔在起鍋前才加入並快速翻炒即可。<p><h1>3<h1><p>完成。<p>', '塊、顆、根、少許、匙、少許、少許、少許、小匙'),
(422, '椒鹽杏鮑菇', '杏鮑菇大朵、蔥、蒜、小磨坊鹽酥雞椒鹽', '2、1、4-5、適量', '422.png', 'https://icook.tw/recipes/305466', 1, 1, 1, 1, 1, 1, 1, 0, 9, '<h1>1<h1><p>?備料?1. 蔥切成蔥花2. 蒜切碎3. 杏鮑菇切成塊狀或片狀都可以<p><h1>2<h1><p>?將杏鮑菇煎至焦香?熱鍋下油，先下杏鮑菇。不久杏鮑菇會出水，不用擔心還是繼續煎到兩面焦黃後取出。<p><h1>3<h1><p>?爆香蒜頭?再下一次油爆香蒜頭，再把剛剛的杏鮑菇入鍋拌炒<p><h1>4<h1><p>?下調味料與蔥花?小磨坊鹽酥雞椒鹽粉撒個三到四下，拌炒均勻分佈在杏鮑菇後，最後下蔥花拌炒10秒，立刻起鍋。<p>', '朵、支、瓣、適量'),
(423, '九層塔烘蛋', '蛋、九層塔或羅勒', '3、半', '423.png', 'https://icook.tw/recipes/303826', 1, 1, 1, 1, 1, 1, 1, 0, 9, '<h1>1<h1><p>備料：1. 半碗九層塔或羅勒切碎2. 將三顆蛋+切碎的九層塔拌勻<p><h1>2<h1><p>熱鍋後下油（烘蛋油多ㄧ點比較容易成功），我大概下手掌大的油，再等油鍋熱<p><h1>3<h1><p>等油鍋熱後，下九層塔蛋液<p><h1>4<h1><p>等到蛋的邊邊都冒泡煎至脆脆的再翻面煎，等兩邊都有焦黃色就完成了！<p>', '顆、碗'),
(424, '五更腸旺 ', '大腸、鴨血、酸菜、蒜頭、蒜苗、嫩薑、青蔥、米酒、白醋、胡椒粉、辣椒醬', '200、300、50、2、1、1、1、適量、適量、適量、2', '424.png', 'https://icook.tw/recipes/296667', 1, 1, 1, 1, 1, 0, 0, 0, 9, '<h1>1<h1><p>食材準備，青蔥、蒜頭切末，蒜苗斜片，薑切絲，鴨血切片。<p><h1>2<h1><p>熱油後放入花椒和些許蔥末，煉花椒油，花椒變色後瀝出備用。<p><h1>3<h1><p>放入一大匙油，加入蒜末、薑絲、蒜白斜片、桂林辣椒醬爆香。<p><h1>4<h1><p>加入酸菜炒香。<p><h1>5<h1><p>加入川燙過的鴨血、大腸、花椒油、一杓水，拌炒悶煮2-3分鐘。<p><h1>6<h1><p>加入蒜苗斜片拌炒。<p><h1>7<h1><p>起鍋前加入些許白醋、米酒、胡椒粉提味。<p><h1>8<h1><p>擺盤上桌就完成囉！<p>', '克、克、克、顆、根、塊、根、適量、適量、適量、匙'),
(425, '涼拌小黃瓜', '小黃瓜、薑絲、蒜末、辣椒、白醋、砂糖', '600、適量、適量、1、80、80', '425.png', 'https://icook.tw/recipes/293570', 1, 0, 0, 1, 0, 0, 1, 0, 9, '<h1>1<h1><p>小黃瓜切成小塊或拍裂，灑一點鹽讓它出水，靜置約10分鐘，備用。<p><h1>2<h1><p>將辣椒、蒜頭、薑絲切碎備用。<p><h1>3<h1><p>砂糖跟白醋要1:1的比例<p><h1>4<h1><p>將全部的調味料混合拌勻。<p><h1>5<h1><p>再拌入小黃瓜。裝在保鮮盒裡，放入冷藏2-3天。<p><h1>6<h1><p>裝盤之後，再加一點麻油或香油就完成了。<p>', '克、適量、適量、支、克、克'),
(426, '肉羹', '梅花肉、新鮮黑木耳、香菇、竹筍、太白粉、蒜頭、薑、胡椒粉、五香粉、糖、醬油、米酒、木薯粉、高湯、水、鹽\'、麻油、太白粉', '350、1、5、150、2-3、2、2、適量、適量、1、3、1、3、400、400、2、適量、1.5', '426.png', 'https://icook.tw/recipes/291511', 1, 0, 0, 1, 0, 1, 0, 0, 9, '<h1>1<h1><p>梅花肉切條後，加入醬油、米酒、糖、五香粉、胡椒粉醃15分鐘左右。<p><h1>2<h1><p>竹筍、香菇、黑木耳切絲（配菜可根據個人喜好增減，加紅蘿蔔、雞蛋、豬血都可以）；蒜、薑切末。<p><h1>3<h1><p>梅花肉醃好後，加入木薯粉拌勻。<p><h1>4<h1><p>用中火爆香薑末、蒜末，然後倒入筍、香菇、黑木耳略炒。<p><h1>5<h1><p>炒香配料後，倒入高湯和水，加入鹽、太白粉和麻油調味。<p><h1>6<h1><p>湯煮開後，慢慢放入梅花肉，放的時候要注意將肉絲分開，不然煮熟後肉絲會黏在一起。<p><h1>7<h1><p>完成～食用時可加一點胡椒粉和黑醋調味，喜歡吃香菜或九層塔的也可加一些）<p>', 'g、朵、朵、g、湯匙、瓣、片、適量、適量、茶匙、湯匙、湯匙、湯匙、ml、ml、茶匙、適量、湯匙'),
(427, '蒜味蝦', '蝦、洋蔥、青蔥、蒟蒻、蘑菇', '8、適量、3、2、適量', '427.png', 'https://icook.tw/recipes/286319', 1, 0, 1, 0, 1, 1, 1, 0, 9, '<h1>1<h1><p>先備料切食材<p><h1>2<h1><p>幫蝦子去殼，頭留著<p><h1>3<h1><p>去蝦腸<p><h1>4<h1><p>豬油與蒜末及蝦頭爆油，放入全部全部食材加入清水，拌炒，加入醬油 芝麻油待食材全入味即可上桌<p>', '隻、適量、支、個、適量'),
(428, '椒鹽蟹管肉', '蟹管肉、油、青蔥、辣椒、蒜頭、黑胡椒、白胡椒、米酒、鹽', '250g、4、1、1、4、適量、適量、少許、0.5', '428.png', 'https://icook.tw/recipes/279735', 1, 0, 0, 1, 0, 0, 0, 0, 9, '<h1>1<h1><p>將青蔥切成小段狀、辣椒斜切、蒜頭去皮後直切<p><h1>2<h1><p>取一盤子撒上麵粉，將蟹管肉均勻的沾上麵粉，下鍋前拍掉多餘麵粉<p><h1>2<h1><p>取一盤子撒上麵粉，將蟹管肉均勻的沾上麵粉，下鍋前拍掉多餘麵粉<p><h1>4<h1><p>將油全數瀝出，然後把所有的料再倒回鍋中<p><h1>5<h1><p>加入鹽巴、胡椒和蔥綠後乾炒一下，起鍋前可以在鍋邊倒入少許的米酒熗鍋<p><h1>6<h1><p>超香的炒蟹管肉完成囉！爆香過的油炒菜很好用，一點都不會浪費！<p>', 'g、大匙、根、根、瓣、適量、適量、少許、匙'),
(429, '台式馬卡龍 牛粒', '蛋黃、細砂糖、過篩低粉、玉米粉、糖粉（篩在麵糊表面用）、蛋白、細砂糖、牛奶巧克力、奶油、糖粉、鹽、奶油、檸檬汁、糖粉', '4、10、110、20、適量、4、80、50、100、10、少許、100、15、15', '429.png', 'https://icook.tw/recipes/274135', 0, 1, 0, 1, 0, 0, 0, 0, 9, '<h1>1<h1><p>預爐210/200 烤8分～10分先將蛋黃蛋白分開，蛋黃加細砂糖先拌均<p><h1>2<h1><p>打發蛋白到硬性發泡 細砂糖分三次下<p><h1>3<h1><p>蛋白硬性發泡是有硬挺的尖勾 鋼鍋倒扣是不是不會掉下來的<p><h1>4<h1><p>挖1/3蛋白輕拌入蛋黃中 拌勻後再將全部蛋白也拌入<p><h1>5<h1><p>再將蛋黃糊倒入剩於的蛋白鍋中輕拌幾下 不用拌到看不到蛋白<p><h1>6<h1><p>這時就開始篩入過篩過的粉類 輕拌個5下再篩一點粉類進來，過程中要輕柔以免消泡，大約拌至均勻即可<p><h1>7<h1><p>這是拌好的麵糊 一樣是膨膨輕輕的沒有消泡<p><h1>8<h1><p>我事先在防沾烤布上用小瓶蓋 用低粉作記號方便等下擠麵糊<p><h1>9<h1><p>輕柔的將麵糊裝入擠花袋，擠在鋪有烤焙紙上的烤盤有防沾烤布也行，這樣可以方便烤好放涼後取下，擠3～5公分大小 要保留間距 因為麵糊會膨脹起來就會沾黏在一塊，最後在表面撒上二層糖粉，喜歡甜一點的人就撒多一點<p><h1>10<h1><p>這快出爐的樣子是不是很美啊<p><h1>11<h1><p>等涼後從烤布上取下就可以夾上檸檬奶油霜、牛奶巧克力奶油霜、焦糖奶油霜<p><h1>12<h1><p>小小一顆 真的是小朋友下課回家後的小點心呢！<p><h1>13<h1><p>檸檬奶油霜 將所有材料放入鍋中一起打發即可備用囉。牛奶巧克力先隔水加熱到溶化即可，等溫度降到26～28再倒入其他己經準備好的材料鍋中， 全部一起快速打發 巧克力糊冷掉會結塊、太熱又會把奶油融化導致無法打發，所以在溫度上要控制好。<p>', '顆、克、克、克、適量、顆、克、克、克、克、少許、克、cc、克'),
(430, '黑輪湯', '玉米、白蘿蔔、黑輪條、香菇、魚卵卷、杏鮑菇、鳥蛋、醬油膏、水、鹽', '2、1、4-8、6-8、5-8、5、1、2、1、1', '430.png', 'https://icook.tw/recipes/247510', 1, 1, 1, 0, 1, 1, 1, 0, 9, '<h1>1<h1><p>蘿蔔去皮切輪狀，玉米切段；放入大同電鍋水淹過食材，外鍋1量米杯水先煮。<p><h1>2<h1><p>電鍋跳起在放入其他食材。香菇洗淨整朵放，杏鮑菇切片，黑輪切半，魚卵卷洗淨放入。<p><h1>3<h1><p>湯底使用醬油膏兩大匙。<p><h1>4<h1><p>大同電鍋外鍋1杯水。<p><h1>5<h1><p>完成。鹹淡按個人嗜好調配。<p>', '支、根、條、朵、個、根、包、匙、碗、小匙'),
(431, '紅燒油豆腐', '油豆腐、青蔥、油蔥酥、水、醬油、八角、桂皮、鹽、楓糖', '3、2、適量、1、半、1、1、少許、適量', '431.png', 'https://icook.tw/recipes/232623', 1, 0, 1, 1, 1, 0, 0, 0, 9, '<h1>1<h1><p>將油豆腐切成小塊三角形, 如果太厚, 從中間再對切一半, 讓油豆腐呈扁三角形狀.<p><h1>2<h1><p>將水, 醬油和青蔥煮至沸騰, 加入八角, 桂皮, 鹽和楓糖後,便可放入油豆腐.<p><h1>3<h1><p>等滷汁再度沸騰時, 放入油蔥酥同煮, 轉小火並蓋上鍋蓋, 煮約15分鐘即可.<p>', '大塊、根、適量、碗、碗、個、個、少許、適量'),
(432, '泰式打拋肉', '豬絞肉、九層塔、蒜片、辣椒、蠔油、淡醬油、魚露、糖、泰式黑醬油、水', '400、1、6、4、2、2、1、1、1、1/4', '432.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>準備好食材，蒜頭辣椒剁碎。<p> <hr><h1>2<h1><p>下一大匙油，蒜頭辣椒爆香。喜歡辣的可以多加一點辣椒。<p> <hr><h1>3<h1><p>加入絞肉，剁碎之後加入2大匙蠔油，2小匙淡醬油。<p> <hr><h1>4<h1><p>拌炒均勻，加入1大匙魚露，1小匙糖，1小匙泰式黑醬油，1/4杯水。<p> <hr><h1>5<h1><p>加入九層塔，均勻拌炒。<p> <hr><h1>6<h1><p>完成。<p> <hr>\']', 'g、小碗、顆、支、大匙、大匙、大匙、小匙、小匙、杯'),
(433, '泰式酸辣海鮮麵', '蝦子、鱈魚丸、肉片、麵條、小白菜、冬陰功醬、鹽巴', '10、6、6、2、1、20、2', '433.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 3, '<hr><h1>1<h1><p>備料：將小白菜洗淨，然後乾煸蝦子帶出蝦子的味道<p> <hr><h1>2<h1><p>下鍋：煸出蝦味後加水煮出蝦湯的基底，待水滾後，加入冬陰功醬<p> <hr><h1>3<h1><p>下鍋：水滾後加入鱈魚丸、肉片，煮滾起鍋前加入小白菜<p> <hr><h1>4<h1><p>擺盤：完成！<p> <hr>\']', '隻、顆、片、把、把、g、g'),
(434, '泰式咖哩蔬菜', '牛蕃茄、馬鈴薯、洋蔥、小黃瓜、木耳絲、板豆腐、蒜碎、水、素食咖哩即煮醬、椰漿', '1、1、1、1、1/3、1/3、1、300、1、200', '434.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>牛蕃茄切小塊\\n洋蔥切片\\n馬鈴薯切小條\\n小黃瓜切片\\n木耳切絲\\n豆腐切片\\n切蒜碎\\n(咖哩即煮醬在全聯買的)<p> <hr><h1>2<h1><p>除了小黃瓜、豆腐，所有食材和咖哩醬放入平底鍋中，小火炒香<p> <hr><h1>3<h1><p>再加1碗清水，大火煮滾<p> <hr><h1>4<h1><p>煮滾後，加入椰漿，再放豆腐、小黃瓜，轉小火煮10～15分<p> <hr><h1>5<h1><p>完成了<p> <hr><h1>6<h1><p><p> <hr>\']', '個、個、個、條、碗、個、小匙、ml、份、ml'),
(435, '泰式肉碎生菜包', '免治豬肉、蕃茄、生菜、蒜蓉、辣椒、九層塔、青檸、生抽、老抽、魚露、糖', '500、半、1、2、1、1、半、1、1、1、1', '435.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>生菜洗淨備用，蕃茄洗淨後切小塊，九層塔拔下葉子洗淨備用。<p> <hr><h1>2<h1><p>於平底鍋中加少許油，放入免治豬肉炒熟，再加入蒜蓉、辣椒及調味料同炒。<p> <hr><h1>3<h1><p>加入蕃茄炒一會後，把九層塔倒入炒至葉子變軟即可上碟。 \\n吃前加上青檸汁更開胃。<p> <hr>\']', 'g、個、棵、湯匙、條、棵、隻、湯匙、湯匙、湯匙、茶匙'),
(436, '泰式涼拌海鮮', '鮮蝦、透抽、洋蔥、甜椒、檸檬、香菜、蒜頭、糖、魚露、辣椒', '15、2、1、各半、2、1、3~5、3、2、1~2', '436.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>蒜頭/香菜/辣椒切末，洋蔥及甜椒切絲，檸檬擠汁備用。\\n（洋蔥絲泡水，中途可換水，去除洋蔥的辛辣味）<p> <hr><h1>2<h1><p>1.透抽洗淨去皮後，去除內臟再切開，表面斜刀刻花後，切成片狀。\\n2.蝦子去頭剝殼後，開背將泥腸挑出。<p> <hr><h1>3<h1><p>備一鍋水，水滾後，分別下透抽跟蝦子川燙一下（約30秒），撈出瀝乾倒入冰塊水中冰鎮備用。\\n【透抽川燙至呈現白色不透，蝦子川燙至彎曲頭尾相連】<p> <hr><h1>4<h1><p>將酸辣醬汁材料調合拌勻備用<p> <hr><h1>5<h1><p>把冰鎮後的蝦子與透抽加入洋蔥絲及甜椒絲，倒入酸辣醬汁拌勻，靜置20分鐘，待入味即可。<p> <hr>\']', '隻、隻、顆、顆、顆、小把、顆、大匙、大匙、條'),
(437, '泰式香辣檸檬魚', '市場買的單片魚排、泰式甜辣醬、泰式青木瓜沙拉醬、泰式魚露、葵花油', '2、2、2、1、1', '437.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>將市場買的魚片沖洗乾淨之後，用廚房紙巾徹底吸乾。 在不沾平底鍋裡面冷鍋放入1小匙的葵花油，即可把魚片放下去，之後開中大火 快速把表面煎熟<p> <hr><h1>2<h1><p>煎到兩面金黃的時候，把其中一片魚排放到另外一般準備做其他料理。這個時候鍋子裡面的魚油非常多，因為這種深海魚他的皮下脂肪比較厚，所以這個天然的魚油假設沒有腥味的話，我還蠻建議另外用一個乾淨的玻璃杯或碗裝好之後，可以拿來炒飯，或是做其他的料理。<p> <hr><h1>3<h1><p>將鍋裡的油徹底的倒出來或是紙中吸乾，盡量不要有太多油脂在鍋子裡面<p> <hr><h1>4<h1><p>鍋子轉中火，在鍋中放入泰式檸檬辣醬、泰式青木瓜沙拉醬、以及泰式魚露，之後開中大火充分的將這些調味汁不?淋在魚片上，讓它吸收差不多，收汁一半比例的時候，就可以起鍋了。喜歡的話上面可以裝飾一點香菜。<p> <hr>\']', '片、大匙、大匙、大匙、小匙'),
(438, '泰式香蕉煎餅', '過熟外皮發黑的香蕉、冷凍蛋餅皮、雞蛋、巧克力醬、煉乳', '一、兩、一、適量、適量', '438.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>平底鍋內塗上少許的食用油<p> <hr><h1>2<h1><p>放上一片冷凍的蛋餅皮<p> <hr><h1>3<h1><p>將過熟的香蕉切成薄片或是壓成泥狀均勻的鋪在蛋餅皮上\\n（ 切成薄片吃起來比較有口感）<p> <hr><h1>4<h1><p>將雞蛋打散倒在上面\\n（ 從中間開始倒蛋液比較不容易溢出來，注意蛋餅的周圍都要均勻地塗上才有辦法黏合餅皮）<p> <hr><h1>5<h1><p>蓋上另外一片冷凍的蛋餅皮<p> <hr><h1>6<h1><p>瓦斯爐用外圍最小火來煎香蕉煎餅<p> <hr><h1>7<h1><p>1.輕輕的按壓蛋餅的周圍利用蛋液將兩片蛋餅黏合\\n2. 等到周圍的蛋液都已經凝固了就可以翻面\\n3. 雙面煎至金黃即可起鍋<p> <hr><h1>8<h1><p>利用食物剪刀將煎好的香蕉煎餅切割成一口大小<p> <hr><h1>9<h1><p>淋上煉乳和巧克力醬就完成了\\n結論: 淋上煉乳的口味比較不會太死甜較受歡迎<p> <hr>\']', '根、片、顆、適量、適量'),
(439, '泰式醬燒松阪豬', '霜降豬肉、洋蔥、蕃茄、香菜、檸檬、燒肉醬、味醂、蜂蜜、柴魚醬油、魚露', '約250、40、1/4、二、1/4、適量、一、一、20、3-4', '439.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>將整片松阪豬肉洗淨汆燙約三分鐘（滾水後開小火才不易捲起）， 我準備這一片松阪豬肉太長了所以切成一半 ，瀝乾水份後平放到鋁箔紙上，雙面刷上烤肉醬，入烤箱220 °c每面烤個十分鐘，每一品牌烤箱力道不同，要隨時關心一下有沒有烤焦喔！<p> <hr><h1>2<h1><p>將洋蔥 蕃茄切碎和所有調味醬汁拌勻，我利用拉拉器省時又方便喲。<p> <hr><h1>3<h1><p>20分後烤箱停囉?松阪豬肉已經烤得琥珀色焦香完美了，再將肉斜切成薄片擺盤，淋上醬汁就完成啦，\\n豬肉烤的完美微焦香淋上醬汁，一定要立馬動筷子夾上一塊塞進嘴裡的??????，這時再來點清酒梅酒之類的，享受人生真的不過如此了，太幸福囉??<p> <hr>\']', '克、克、顆、小株、顆、適量、小匙、茶匙、cc、滴'),
(440, '泰式酸辣檸檬魚', '石斑魚（或鱸魚）、蔥、薑、米酒、鹽、檸檬汁、辣椒、香菜、魚露、糖、蒜頭', '1、2、5~8、少許、少許、1、1、1、2、1、3~4', '440.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>備料\\n1.辣椒、蒜頭、香菜切末\\n2.蔥切段，薑切片\\n3.檸檬擠好汁備用<p> <hr><h1>2<h1><p>1.在魚身兩面各斜切3刀後抹上少許的鹽及米酒，靜置10分鐘\\n2.放上薑片及蔥段，放入已煮沸的蒸鍋，中大火蒸10分鐘\\n（可用筷子刺入魚身最厚的地方，如果容易穿透表示已蒸熟）<p> <hr><h1>3<h1><p>將所有的酸辣醬汁材料全部調合一起並拌勻<p> <hr><h1>4<h1><p>魚蒸熟後，把薑與蔥挑出，再將酸辣醬汁淋上去即可<p> <hr>\']', '條、支、片、少許、少許、顆、條、小把、大匙、大匙、顆'),
(441, '泰式黃咖喱與熊熊蝶豆花籃飯', '蝶豆花、泰式香米、水、海苔片/起司片、泰式黃咖哩醬、椰漿、洋蔥、蒜頭、切塊雞腿肉、馬鈴薯、橄欖油、水、魚露/辣椒/小番茄', '10、2、3、各1、1、200、半、3、1、1、1、1、依個人喜好添加', '441.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>材料A的蝶豆花和水一起煮滾,待水變藍色後撈出蝶豆花,和洗好的泰式香米混合,放入電鍋蒸煮(?馬鈴薯也切塊處理好一起丟進去蒸)<p> <hr><h1>2<h1><p>鍋子放入橄欖油熱鍋,將雞腿的雞皮朝下煎到表面金黃,撈起備用<p> <hr><h1>3<h1><p>同鍋將蒜頭洋蔥,拌炒至洋蔥變透明<p> <hr><h1>4<h1><p>倒入黃咖哩醬和水,調整喜歡的濃稠度<p> <hr><h1>5<h1><p>放入備用的雞腿肉拌炒到熟<p> <hr><h1>6<h1><p>放入預先蒸軟的馬鈴薯繼續拌炒<p> <hr><h1>7<h1><p>煮滾後倒入椰漿拌勻(?這時候整鍋的味道就會讓你看到泰國了)依喜好可以再添加魚露,辣椒,小番茄或其他蔬菜,咖哩的部分完成！<p> <hr><h1>8<h1><p>蝶豆花飯趁熱捏成熊臉,再用花嘴或模型壓出圓形起司片,海苔片裝飾耳朵,眼睛和臉部,小熊藍飯完成！<p> <hr><h1>9<h1><p>搭配淋上泰式酸辣醬的水煮蛋和清涼順口的泰式珍奶，和家人好好享受南洋風情的餐桌時光吧????<p> <hr>\']', '朵、杯、杯、各片、包、g、顆、瓣、盒、顆、大匙、碗、依個人喜好添加'),
(442, '泰式優格蝦仁沙拉三明治', '全麥土司、蝦仁、大蒜、辣椒、生菜、花生、無糖優格、魚露、糖、檸檬汁、芫荽（香菜）', '1~2、10、1、一點點、2、5、1.5、1/4、1/2、1/6、1', '442.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>材料如圖，如果你使用有糖的原味優格就不用額外加糖了喔^\\u2006_\\u2006^<p> <hr><h1>2<h1><p>備料：\\n花生壓碎、大蒜切碎、辣椒切片（怕辣記得去籽）、芫荽切碎、美生菜切成細絲備用。接著把吐司拿去烤。<p> <hr><h1>3<h1><p>平底鍋加熱，用少許油爆香大蒜和辣椒。<p> <hr><h1>4<h1><p>放入蝦仁拌炒，轉紅就是熟了可以起鍋。<p> <hr><h1>5<h1><p>取小碗混合「酸辣優格」裡所有材料，加入炒好的蝦仁（大蒜和辣椒也要一起加才香喔）拌一拌。\\n??魚露是主要的鹹味來源，它本身很鹹，建議最後再加、邊試吃邊調整份量，就不會一時失手變太鹹。<p> <hr><h1>6<h1><p>像這樣。<p> <hr><h1>7<h1><p>烤好的吐司擺上生菜絲。<p> <hr><h1>8<h1><p>接著放上蝦仁優格，灑上芫荽、花生碎和辣椒稍加點綴，完成?\\n大家可以根據飢餓程度決定是否要再加一片吐司把它夾起來當三明治吃～<p> <hr>\']', '片、隻、瓣、一點點、片、顆、大匙、小匙、小匙、顆份、小株'),
(443, '月亮蝦餅', '蝦仁、偏肥牛絞肉、白胡椒粉、糖、鹽、地瓜粉、中筋麵粉、水、鹽、糖、白醋、魚露、辣油(或新鮮辣椒碎)', '450、100、適量、少許、少許、30、100、150、少許、30、30、少許、少許', '443.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>影音食譜：https://user91066.pics.ee/TMST5\\n更詳細的製作過程可以參考影片喔！<p> <hr><h1>2<h1><p>準備食材<p> <hr><h1>3<h1><p>先做餅皮，將麵粉與水攪拌均勻後加入一點點鹽巴，即完成麵糊<p> <hr><h1>4<h1><p>平底鍋擦上少許油，小火熱鍋後倒入麵糊，以刷子塗開，這裡動作不能太慢否則會凝固，盡量讓厚度平均，不過剛刷完長得很醜也不用太灰心，熟了之後就會變漂亮了<p> <hr><h1>5<h1><p>用小火慢慢加熱，需要一點耐心，直到餅皮邊邊翹起來就可以從旁邊慢慢掀起來，如果還有點黏請再給他一點時間，完全熟了的話應該要可以整張順利掀起來，餅皮的透明度也會降低。通常第一張都會比較失敗，不要太難過<p> <hr><h1>6<h1><p>來做蝦漿內餡，把蝦仁剁碎，我喜歡保留一點口感所以沒有剁很碎<p> <hr><h1>7<h1><p>找個大盆子，放入蝦漿、絞肉、白胡椒粉、地瓜粉、糖、鹽<p> <hr><h1>8<h1><p>把材料全部攪拌均勻<p> <hr><h1>9<h1><p>找個大盤子，放上餅皮，塗上厚厚一層蝦漿內餡<p> <hr><h1>10<h1><p>蓋上第二張餅皮、稍微壓一壓<p> <hr><h1>11<h1><p>找支叉子，把蝦餅兩面平均戳幾個洞，炸的時候才不會澎起來<p> <hr><h1>12<h1><p>氣炸鍋抹一點油，放入蝦餅，設定200℃、10分鐘，時間到拿出來翻面再設定200℃、5分鐘<p> <hr><h1>13<h1><p>等待時間來做醬汁，小鍋放入糖與白醋，以小火加熱<p> <hr><h1>14<h1><p>糖溶解後加入魚露與辣油，煮到半濃稠即完成！我是偷懶用辣油，如果有新鮮辣椒也可以切碎加進去，香氣更濃郁<p> <hr><h1>15<h1><p>擺盤上桌！這個食譜可以做出直徑15公分、厚度1公分的蝦餅2片，爽吃一波！<p> <hr>\']', 'g、g、適量、少許、少許、g、g、g、少許、g、g、少許、少許'),
(444, '泰式炒空心菜', '空心菜、辣椒 （再少辣就半條）、蒜（切成粒/蓉）、泰式黃豆漿/豆辦醬、素蠔油、米酒、椰糖', '約500、一、3、一、一、一、2', '444.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>先看看需要甚麼材料~<p> <hr><h1>2<h1><p>先預備材料： 辣椒切粒<p> <hr><h1>3<h1><p>蒜頭切粒<p> <hr><h1>4<h1><p>空心菜洗淨後，切成段 約 3\"( 為甚麼是3吋？可以看影片片就知道啦 ～）<p> <hr><h1>5<h1><p>將蠔油、米酒、豆辦醬 攪均備用<p> <hr><h1>6<h1><p>中火落油，先爆香蒜蓉及辣椒<p> <hr><h1>7<h1><p>聞到香味，加入已攪均的調味料<p> <hr><h1>8<h1><p>即轉大火，先加入莖部輕炒<p> <hr><h1>9<h1><p>再加入葉 （因為葉係快熟?，所以後加 ）<p> <hr><h1>10<h1><p>炒到大軟身，就可以熄火<p> <hr><h1>11<h1><p>再加入椰糖 炒均 （熄火後 熱力都好熱，糖可以自然煮熔）<p> <hr><h1>12<h1><p>最後就可以上碟啦，翠綠的泰式炒空心菜就這樣完成！太易啦吧 ~ 大家一定做到～<p> <hr>\']', 'g、條、粒、湯匙、湯匙、湯匙、茶匙'),
(445, '雲南大薄片', '豬頭皮、米酒、薑片、鹽巴、去皮花生、薄鹽醬油、白醋、水、糖、鮮味精、芝麻香油、辣油、蒜頭碎、大辣椒碎、薑絲碎、香菜碎', '500、少許、五、1、30、70、60、30、10、2、15、20、15、15、15、20', '445.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>首先豬頭皮冷水下鍋\\n放米酒薑片鹽巴煮滾<p> <hr><h1>2<h1><p>水滾後小火煮30分鐘讓皮稍微軟化<p> <hr><h1>3<h1><p>然後沖涼水<p> <hr><h1>4<h1><p>沖涼後開始考驗刀工\\n盡量切很薄的薄片<p> <hr><h1>5<h1><p>完成後備用<p> <hr><h1>6<h1><p>將醬汁攪拌均勻\\n淋在大薄片上抓勻<p> <hr><h1>7<h1><p>將花生敲成細碎狀<p> <hr><h1>8<h1><p>大薄片擺盤後灑上花生碎就完成囉<p> <hr><h1>9<h1><p>香香辣辣的大薄片帶一點咬勁\\n適合當小菜使用<p> <hr>\']', 'g、少許、片、匙、g、g、g、g、g、g、g、g、g、g、g、g'),
(446, '涼拌泰式海鮮', '臭抽、白蝦仁、番茄、紫洋蔥、檸檬、魚露、蒜頭、香菜、糖、辣椒', '1、1、1、1、4、2、5、少許、3、1', '446.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>1洋蔥切絲泡冰水（去辛辣），番茄切片，辣椒去籽切末，蒜頭切末香菜切小段\\n2把檸檬榨汁加入魚露跟糖攪拌均勻<p> <hr><h1>2<h1><p>臭抽切片刻花，白蝦可剖背可不剖，炒菜鍋燒水，水滾下臭抽跟白蝦仁，約10秒關火加蓋燜一下，撈起泡冰水<p> <hr><h1>3<h1><p>最後把洋蔥番茄鋪盤，放上海鮮再下所有調味醬汁蒜末辣椒末香菜拌勻，先進冰箱冰一下30分鐘後會更美味<p> <hr><h1>4<h1><p><p> <hr>\']', '尾、斤、顆、顆、顆、大匙、顆、少許、大匙、根'),
(447, '泰式打拋豬-超簡單', '豬絞肉、打拋豬調理包、小蕃茄、醬油膏、檸檬、九層塔、辣椒', '300、15、10、2、1/4、適量、適量', '447.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 0, 1, 0, 0, 3, '<hr><h1>1<h1><p>備料\\n小蕃茄對切，辣椒切圈<p> <hr><h1>2<h1><p>起油鍋，將絞肉小火翻炒至7分熟<p> <hr><h1>3<h1><p>加入小蕃茄一起翻炒一下，倒入調理包粉末均勻拌勻，敢吃辣的這時候辣椒也可以一起下囉<p> <hr><h1>4<h1><p>1.加2大匙的醬油膏後翻炒拌勻，試試味道，不夠鹹可再增加醬油膏或鹽\\n2.最後加入九層塔增加香氣\\n3.關火，起鍋前滴上少許的檸檬汁即可<p> <hr>\']', '公克、公克、顆左右、大匙、顆、適量、適量'),
(448, '泰式芒香涼拌', '豬梅花火鍋肉片、蝦子、洋蔥、香菜末、熟白芝麻、芒果丁、細砂糖、魚露、昆布醬油、蒜末、是拉差醬、辣椒末(可省略)、香菜梗、檸檬汁', '200、適量、100、適量、少許、半、2、2、2、1、20、少許、適量、15', '448.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>洋蔥切絲冰水冰鎮去辛辣味撈起<p> <hr><h1>2<h1><p>幾片薑加米酒將海鮮及肉片燙熟後，用洋蔥水冰鎮撈起<p> <hr><h1>3<h1><p>醬汁：\\n取調理機，放入蒜頭、魚露、檸檬汁、香菜梗、糖、醬油、是拉差醬打勻，完成醬汁<p> <hr><h1>4<h1><p>盆內放入冰鎮過的海鮮、肉片、是拉差醬汁、香菜末、芒果丁、小黃瓜片、洋蔥絲拌勻即完成。<p> <hr>\']', '公克、適量、公克、適量、少許、顆、大匙、大匙、大匙、大匙、cc、少許、適量、cc'),
(449, '泰式咖哩蝦', '蝦子、蔥、薑、蒜、辣椒、咖喱粉、薑黃粉、蠔油、鹽、糖、白胡椒、魚露、椰奶、蛋、香菜', '10-15、約一、約20、約3-5、約1-2、約1、約1/4、約1/2、適量、適量、約1、約1/2、約100、約1、約一', '449.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>準備食材<p> <hr><h1>2<h1><p>蝦子去殼、開背去泥腸<p> <hr><h1>3<h1><p>蔥切段，蒜拍一下或切片，薑切片，辣椒切段<p> <hr><h1>4<h1><p>加油可以稍微多一點，下蔥、薑、蒜、辣椒爆香<p> <hr><h1>5<h1><p>加咖喱粉和薑黃粉，咖哩粉不要炒太久<p> <hr><h1>6<h1><p>下蠔油<p> <hr><h1>7<h1><p>加入約半杯水煨煮，加入糖、鹽調味<p> <hr><h1>8<h1><p>蝦子放進去煮，加入魚露<p> <hr><h1>9<h1><p>煮到差不多熟度，加入椰奶<p> <hr><h1>10<h1><p>下蛋液關火<p> <hr><h1>11<h1><p>灑上香菜<p> <hr><h1>12<h1><p>完成<p> <hr>\']', '隻、隻、g、瓣、隻、大匙、匙、大匙、適量、適量、小匙、匙、ml、顆、小把'),
(450, '泰式時蔬炒雲耳', '薑絲、木耳、玉米筍、紅椒、甜椒、四季豆、泰式鮮檸醬', '少許、一、一、半、半、一、適量', '450.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>加入少許油，下薑絲爆香<p> <hr><h1>2<h1><p>將較硬的食材，如四季豆、玉米筍、甜椒，依序下鍋拌炒。<p> <hr><h1>3<h1><p>最後，再下木耳，再加入泰式鮮檸醬，稍微拌炒即可起鍋。<p> <hr>\']', '少許、盒、盒、顆、顆、盒、適量'),
(451, '泰奶口味戚風蛋糕', '8吋中空烤模、蛋黃、油、低粉、奶茶、茶粉、蛋白、糖、醋', '1、5、30、90、80、3-5、5、45、些許', '451.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>低粉過篩後拌入油裡面。<p> <hr><h1>2<h1><p>1.低粉和油稍微拌開後，加入蛋黃稍微攪拌後，再加入奶茶拌勻。\\n2.預先泡好奶茶80克。3克茶粉用60克熱水沖泡，再加入20克牛奶，這個比例茶味比較重，大家可以自行調整奶茶濃淡。<p> <hr><h1>3<h1><p>拌勻後，喜歡茶味重一點的，可再加入乾茶粉約3-5克。<p> <hr><h1>4<h1><p>完成蛋黃糊<p> <hr><h1>5<h1><p>製作蛋白霜。加些許白醋到蛋白液裡，高速打發蛋白，蛋白起泡後糖分成三次加入，以確保糖完全融入蛋白霜中。蛋白霜出現紋路後，改用中低速，打至蛋白霜拉起成彎鉤狀，蛋白霜不流動。<p> <hr><h1>6<h1><p>取1/3蛋白霜在蛋黃糊裡先拌勻，再把拌勻後的蛋黃糊倒入蛋白霜中，用切拌法拌勻。<p> <hr><h1>7<h1><p>倒入烤模，入烤箱前記得把裡頭的氣泡大力敲出。<p> <hr>\']', '個、顆、克、克、克、克、顆、克、些許'),
(452, '泰式炒時蔬', '高麗菜、油菜、竹筍絲、白花椰菜、胡蘿蔔（小）、鮮香菇、蒜、泰國辣椒、素蠔油、醬油、水、糖', '30、30、30、30、1、2-3、5、5、2、2、2、1', '452.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>胡蘿蔔去皮，切滾刀塊；蒜切碎；把油菜的梗和葉分開；香菇切片；辣椒用刀壓一下；其餘蔬菜切成一口大小<p> <hr><h1>2<h1><p>調味料和水拌勻<p> <hr><h1>3<h1><p>炒香蒜頭和辣椒，下菜梗和胡蘿蔔，炒約2分鐘<p> <hr><h1>4<h1><p>下花椰菜、香菇和高麗菜炒軟<p> <hr><h1>5<h1><p>下筍絲、油菜葉和調味料，炒軟<p> <hr>\']', '克、克、克、克、條、朵、瓣、條、大匙、大匙、大匙、茶匙'),
(453, '泰式檸檬鱈魚', '鱈魚、檸檬、泰式酸辣醬、米酒', '1、3-4、適量、2.5', '453.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>將鱈魚退冰後，吸乾水分，淋上食用米酒、及泰式酸辣醬，稍微塗抹均勻。<p> <hr><h1>2<h1><p>放入氣炸鍋，210度烤個7-10分鐘（看魚的薄厚度調整）。<p> <hr><h1>3<h1><p>烤好後再擺上檸檬片及完成～<p> <hr>\']', '片、片、適量、ml'),
(454, '打拋豬肉', '豬絞肉、檸檬、小蕃茄、九層塔、蒜頭、魚露、水、糖、醬油', '一、半、10~15、適量、適量、2、1、半、2', '454.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 3, '<hr><h1>1<h1><p>備料，蒜頭切瓣備用<p> <hr><h1>2<h1><p>調好醬汁備用：魚露2大匙+水1大匙+檸檬半顆擠成汁+糖0.5匙+醬油2大匙<p> <hr><h1>3<h1><p>小蕃茄前半備用；九層塔洗淨後瀝乾<p> <hr><h1>4<h1><p>熱鍋不下油，加入豬絞肉翻炒<p> <hr><h1>5<h1><p>豬肉變色後加入蒜頭及備好的醬汁<p> <hr><h1>6<h1><p>豬肉被醬汁染色後加入小蕃茄<p> <hr><h1>7<h1><p>最後加入九層塔炒軟即可上桌<p> <hr>\']', '盒、顆、顆、適量、適量、大匙、大匙、匙、大匙'),
(455, '創意打拋雞肉飯', '敏豆、彩椒、洋蔥、雞肉、醬油、米酒、白胡椒粉、太白粉、醬油、鹽巴、白胡椒粉、糖、月桂葉', '1、各半、半、1、1、1、適量、1、2、2、適量、1、2', '455.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 3, '<hr><h1>1<h1><p>食材切好備用\\n\\n我用了一盒敏豆，份量可以減半，喜歡口感脆脆的可以用一盒\\n\\n雞肉醃好備用（約30分鐘）<p> <hr><h1>2<h1><p>熱鍋熱油先炒雞肉<p> <hr><h1>3<h1><p>約7-8分熟撈起備用（雞肉部分呈現白色）<p> <hr><h1>4<h1><p>熱油鍋炒敏豆，加半杯水，再加入蒜末拌炒，加入鹽巴，周邊冒小泡泡後則再加入其他配料<p> <hr><h1>5<h1><p>加入其他的配料拌炒約3分鐘<p> <hr><h1>6<h1><p>加入月桂葉提升香氣，沒有也可以省略<p> <hr><h1>7<h1><p>最後加入半熟雞肉，加入調味料拌炒，試味道，ok則可以起鍋囉<p> <hr>\']', '盒、顆、顆、盒、大匙、大匙、適量、大匙、大匙、小匙、適量、小匙、片'),
(456, '泰式檸檬魚', '鱸魚、泰式甜辣醬、和風醬油、蒜頭、檸檬', '一、3、2、4～5、1', '456.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>將食材準備好。<p> <hr><h1>2<h1><p>蒜頭切末。加入甜辣醬跟醬油。\\n檸檬對切後，先切兩片後，其餘擠入醬汁內拌勻。<p> <hr><h1>3<h1><p>拌勻後的醬汁。<p> <hr><h1>4<h1><p>將鱸魚對切後，在魚皮表面畫幾道切痕。\\n將檸檬片夾入魚腹內。\\n將醬汁均勻灑在魚肉上。<p> <hr><h1>5<h1><p>600瓦微波4分半鐘即完成。\\n沒有微波爐就改用水蒸15分鐘。<p> <hr>\']', '條、匙、匙、顆、顆'),
(457, '超美味蔬食泰式綠咖哩', '馬鈴薯、香菇、杏鮑菇、玉米筍、紅蘿蔔、茄子、小黃瓜、腰果、九層塔、南薑、香茅、檸檬葉、咖哩粉、椰奶、鮮奶、鹽、糖', '1、5-6、4-5、10、半、2-3、1、適量、少許、1-2、適量、適量、16、1、300、適量、適量', '457.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>材料集合（食材其實不用這麼多，煮完發現食材過多），將馬鈴薯、茄子、玉米筍、香菇、杏鮑菇、小黃瓜切塊備用<p> <hr><h1>2<h1><p>腰果用烤箱烤香<p> <hr><h1>3<h1><p>先將菇類用中火炒到微焦，撈起來備用<p> <hr><h1>4<h1><p>南薑、檸檬葉、香茅用小火爆香，然後加入咖哩粉炒香<p> <hr><h1>5<h1><p>加入椰奶及牛奶，然後糖鹽調味<p> <hr><h1>6<h1><p>除了小黃瓜、九層塔、腰果外，加入所有的食材，煮滾後用小火悶煮到食材軟化<p> <hr><h1>7<h1><p>煮好前加入烤好的腰果、小黃瓜及九層塔後在稍微煮一下就完成了，搭配烤餅超好吃的！<p> <hr>\']', '顆、朵、根、根、條、根、根、適量、少許、片、適量、適量、g、罐、ml、適量、適量'),
(458, '隨便做泰式涼拌海鮮沙拉', '冷凍海鮮、泰式甜辣醬、市售檸檬汁、清水、洋蔥、雞粉、蒜頭、香菜、蟹肉棒', '包、大匙、匙、少許、顆、少許、瓣、隨意、隨意', '458.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>1. 海鮮下鍋燙熟\\n2. 撈起用冰水冰鎮\\n3. 洋蔥切細絲，涼水泡著除辛辣味<p> <hr><h1>2<h1><p>醬料～\\n\\n1. 蒜頭剁成泥，用小碗裝起加入甜辣醬、\\n    檸檬汁與雞粉和清水拌勻<p> <hr><h1>3<h1><p>擺盤～\\n\\n1. 準備漂亮的盆子，將海鮮先放入\\n2. 加入洋蔥絲與蟹肉棒（撕碎）\\n3. 香菜撒上\\n4. 醬料倒進去\\n5. 拌勻??拍照??，開吃<p> <hr>\']', '包、大匙、匙、少許、顆、少許、瓣、隨意、隨意'),
(459, '生酮月亮蝦餅', '蝦仁、花枝、雞蛋、蔥、胡椒粉、千張豆皮、米酒', '150、300、一、少許、少許、一些、些許', '459.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>花枝切塊\\n蝦仁如果太大也切塊\\n蔥切成蔥花\\n全部放進攪拌杯\\n灑上胡椒粉跟米酒（可去腥）<p> <hr><h1>2<h1><p>攪完之後鋪在千張上\\n我的千張尺寸約12*12公分\\n這樣的材料可以做成10片以上<p> <hr><h1>3<h1><p>下鍋煎熟就可以吃囉??<p> <hr>\']', '克、克、顆、少許、少許、一些、些許'),
(460, '泰國胡椒蝦', '泰國蝦、胡椒粉、米酒', '一、一、半', '460.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>泰國蝦洗乾淨 剪掉鬍子 換上新的一鍋水 燒開 倒入米酒去腥 煮熟蝦子<p> <hr><h1>2<h1><p>熟了以後 把水倒掉剩下非常少 倒入整包胡椒粉 開始攪拌均勻 開始小火悶滾<p> <hr><h1>3<h1><p>等到所有被悶乾 入味 鍋底焦了 就能裝盤上桌食用了<p> <hr>\']', '斤、包、瓶'),
(461, '鹽烤泰國蝦', '泰國蝦、粗鹽巴', '一、一', '461.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>泰國蝦買回來 清洗 剪掉鬍子 放在鍋子 放粗鹽 搖晃均勻 鹽巴多一點 避免不夠<p> <hr><h1>2<h1><p>然後開始烤 正面 反面 站立 倒立 烤的均勻<p> <hr><h1>3<h1><p>烤的很酥 焦香味出來 乾乾的 不要濕答答 會比較香 就能裝盤子了<p> <hr>\']', '斤、碗'),
(462, '打拋豬', '豬絞肉、大番茄、蒜、辣椒、檸檬、九層塔、醬油、魚露、糖、米酒', '1、1、6、一、1、適量、1.5、1.5、1.5、1', '462.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 3, '<hr><h1>1<h1><p>先將食材備好，蒜末、辣椒、蕃茄丁、九層塔、醬料<p> <hr><h1>2<h1><p>先將豬肉稍微炒到變色，再加入蒜、辣椒爆香、再加米酒去豬肉的腥味<p> <hr><h1>3<h1><p>加入醬油、魚露、糖和番茄一起拌炒<p> <hr><h1>4<h1><p>最後放入一大把九層塔，拌炒約3分鐘，炒太久菜會變黑<p> <hr><h1>5<h1><p>喜歡酸一點的人可以再加點檸檬喔<p> <hr><h1>6<h1><p>剩下的打拋豬還可以帶便當??<p> <hr>\']', '盒、顆、瓣、條、顆、適量、大匙、大匙、大匙、大匙'),
(463, '海鮮叻沙寬粉', '寬粉、小磨坊南洋叻沙醬、蝦子、蛤蜊、鮮干貝、小磨坊椰奶、胡椒粉、蔥綠、溏心蛋、米酒、蒜末、水、蝦頭及蝦殼、沙拉油', '2、1/2、3-4、3-4、2、4、適量、1、1、2大、1/2、1、3、1', '463.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>食材大集合。<p> <hr><h1>2<h1><p>將蝦子剝殼去頭，蝦頭與蝦殼留下準備煉蝦湯。<p> <hr><h1>3<h1><p>熱鍋，下一大匙沙拉油，下蝦頭及殼，炒至變紅。<p> <hr><h1>4<h1><p>倒入蒜末，再嗆入2大匙米酒。<p> <hr><h1>5<h1><p>加入一碗水，煮滾。<p> <hr><h1>6<h1><p>濾過蝦頭及殼和蒜末，即獲得蝦湯。<p> <hr><h1>7<h1><p>另起一鍋熱水，放入青蔥一支、薑片3-4片、鹽巴一匙、米酒一大匙（以上為食材外），將蝦仁及干貝燙熟備用。<p> <hr><h1>8<h1><p>將蛤蜊放入蝦高湯中燙熟撈出備用。<p> <hr><h1>9<h1><p>蝦及蛤蜊高湯放入兩把寬粉煮熟，讓寬粉吸收高湯的美味。<p> <hr><h1>10<h1><p>將寬粉撈出放入碗中，並先放入蔥綠末備用。<p> <hr><h1>11<h1><p>高湯中放入1/2碗水，再倒入1/2包小磨坊南洋叻沙?，拌勻，煮滾。<p> <hr><h1>12<h1><p>再加入3大匙小磨坊椰漿，拌勻煮滾即可。<p> <hr><h1>13<h1><p>將蝦仁，蛤蜊，干貝擺在寬粉上，再放入對半切開的溏心蛋，趁熱倒入步驟12的高湯。<p> <hr><h1>14<h1><p>好吃的叻沙海鮮寬粉上桌囉~??<p> <hr>\']', '份、包、隻、顆、顆、大匙、適量、大匙、顆、大匙、瓣、碗、隻、大匙'),
(464, '泰式椒麻杏鮑菇', '中等杏鮑菇、老薑末、生抽、糖、白醋、五香粉、麵粉、粗粒樹薯粉、香菜末、辣椒末、老薑末、白醋、糖、生抽、花椒油、香油', '5、1、2、2、2、少許、2、足量、一、一、一、1.5、1.5、1.5、1、1/2', '464.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>將杏鮑菇切除頭部<p> <hr><h1>2<h1><p>燙熟<p> <hr><h1>3<h1><p>加入冰塊水中漂涼<p> <hr><h1>4<h1><p>把杏鮑菇用刀片成片裝，中間多劃數刀，使得杏鮑菇趨向片狀。<p> <hr><h1>5<h1><p>兩面都可以劃上刀痕，盡量攤平，這樣看起來比較有菇排的感覺<p> <hr><h1>6<h1><p>依照上方醃料的食材製作出醃汁，注意糖需攪拌至融解<p> <hr><h1>7<h1><p>均勻抹上醃汁，移入冰箱冷藏15分鐘至半小時<p> <hr><h1>8<h1><p>把多餘的醃汁倒出，然後加入兩大匙麵粉抓勻<p> <hr><h1>9<h1><p>拍上粗粒樹薯粉，口感更加酥脆迷人\\n\\n*也可以拍上麵包糠<p> <hr><h1>10<h1><p>入油鍋炸至金黃酥脆<p> <hr><h1>11<h1><p>依上述配方調配好淋醬，並將杏鮑菇排切粗段，堆疊盛盤，再淋上少許醬汁，看起來就很養眼。\\n\\n吃進口裡，酸、甜、辣、香、麻、酥的滋味都有，而且醃過的杏鮑菇本身也有酸酸甜甜的感覺。<p> <hr><h1>12<h1><p>不切片就是整片菇排的感覺喔<p> <hr>\']', '條、大匙、大匙、大匙、大匙、少許、大匙、足量、株、條、大匙、大匙、大匙、大匙、小匙、小匙'),
(465, '泰式涼拌洋蔥', '洋蔥、小番茄、香菜、檸檬汁、魚露、辣椒末、大蒜末、冷開水、糖、橄欖油', '適量、適量、適量、適量、適量、適量、適量、適量、適量、一', '465.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>做法:\\n\\n1洋蔥逆紋切絲泡冷開水放冰箱一小時候瀝乾水份,怕辣的多泡一次.小番茄切半.香菜切末<p> <hr><h1>2<h1><p>2.檸檬汁.魚露.糖.辣椒末適量.大蒜一瓣切末.一湯匙冷開水.做成醬汁<p> <hr><h1>3<h1><p>3.12拌拌勻醬汁酸辣隨個人喜好<p> <hr>\']', '適量、適量、適量、適量、適量、適量、適量、適量、適量、小匙'),
(466, '涼拌泰式雞絲', '雞肉絲（吃剩的甘蔗雞肉）、黃紅甜椒絲、香菜、紅蔥頭、泰式甜辣醬、是拉差辣椒醬', '適量、各半、2、3、30、15', '466.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>將前一天吃不完的甘蔗雞從冰箱取出後不用加熱直接把雞皮去掉，雞肉剝絲<p> <hr><h1>2<h1><p>放入甜椒、香菜、紅蔥頭<p> <hr><h1>3<h1><p>倒入泰式涼拌辣醬30ml<p> <hr><h1>4<h1><p>倒入是拉差辣椒醬15ml<p> <hr><h1>5<h1><p>所有材料拌勻<p> <hr><h1>6<h1><p>完成<p> <hr>\']', '適量、顆、小段、顆、ml、ml'),
(467, '鮮蝦生菜沙拉', '綜合生菜葉、鮮蝦、番茄、玉米筍、水煮蛋、和風柚子醬', '150、8、1、3、2、適量', '467.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>將生菜葉洗乾淨浸泡冷開水後取出瀝乾水份,番茄和鮮蝦清洗乾淨,雞蛋用電鍋煮熟取出放涼備用.<p> <hr><h1>2<h1><p>煮一鍋水先將玉米筍煮熟後取出放涼後每根都斜切對拌.<p> <hr><h1>3<h1><p>再將鮮蝦放入煮熟放涼後再剝殼.<p> <hr><h1>4<h1><p>將雞蛋剝殼後切片.番茄切片備用.<p> <hr><h1>5<h1><p>將冰的脆脆的綜合生菜葉先放入餐盒裡,接著在疊上切片的番茄片.切好的水煮蛋片.去殼的新鮮蝦肉和玉米筍,食用前淋上和風柚子醬汁(或是自己喜歡的醬汁)即可<p> <hr>\']', '克、隻、顆、根、顆、適量'),
(468, '泰式燒汁豬肉MooWaan', '油、蒜頭(剁碎)、瘦豬肉、魚露、醬油、椰糖、水', '1、2、400、2、2、40、550-750', '468.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 0, 0, 3, '<hr><h1>1<h1><p>把豬肉切約拇指般大小塊<p> <hr><h1>2<h1><p>熱油鍋，把蒜茸爆香，然後加入豬肉炒2-3分鐘至轉色<p> <hr><h1>3<h1><p>加入椰糖、魚露及醬油，炒一下加入清水．加蓋以小火燜煮至肉軟，不時須攪拌以防止燒焦；煮至水乾起糖焦，調味後盛出，享用！<p> <hr>\']', '湯匙、瓣、g、湯匙、湯匙、g、ml'),
(469, '泰式風味酸辣醬佐舒肥嫩鯊魚肉', '鯊魚肉、玉米筍、皮蛋、香菇、紅蔥、蒜、大辣椒、九層塔、芹菜、糖、醬油、魚露、檸檬', '一、3、半、1、10、10、1、5、10、5、30、15、半', '469.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 0, 0, 3, '<hr><h1>1<h1><p>第一步驟先拿剝皮刀將魚皮從魚肉身上剝開來。如果沒有相關刀具或者不熟練的話，可以請魚販直接幫你剝好。<p> <hr><h1>2<h1><p>鯊魚皮的部分用刀子這樣斜斜的刮，能刮出很多類似沙子的物質，這些都要確實刮除等等舒肥時才不會跑到魚肉身上。<p> <hr><h1>3<h1><p>將鯊魚肉還有魚皮放入真空保鮮袋中，舒肥棒53度舒肥40分鐘。配料的部分如玉米筍、皮蛋等等可以入高湯或清湯川燙至熟。\\n\\n※當然實際舒肥時間依照你肉的大小數量有所差異，得自己調整。\\n※如果沒有舒肥條件的話，直接把鯊魚肉跟配料一起放到昆布湯中川燙至熟也可以。<p> <hr><h1>4<h1><p>把紅蔥、大辣椒、蒜、芹菜、九層塔通通切末，放進碗中。<p> <hr><h1>5<h1><p>下糖、醬油、魚露、檸檬汁，拌均勻。<p> <hr><h1>6<h1><p>舒肥時間到後魚肉切塊狀放盤，魚皮的部分用鐵製小湯匙輕輕刮，就能把黑色的魚皮刮除，保留富有膠質感的內層即可。<p> <hr><h1>7<h1><p>將泰式風味酸辣醬均勻的淋在鯊魚肉上，泰式風味酸辣醬與舒肥嫩鯊魚肉完成。<p> <hr>\']', '大塊、根、顆、朵、g、g、根、g、g、ml、ml、ml、顆'),
(470, '月亮蝦餅', '蝦仁、雞腿肉、麵粉、潤餅皮、白醋、糖、辣椒', '50、100、一、兩、兩、一、自由調整', '470.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>雞腿肉/蝦仁剁碎加入麵粉攪拌混合均勻，放在兩張潤餅皮中壓平<p> <hr><h1>2<h1><p>一湯匙油煎至兩面金黃（中火約五分鐘）<p> <hr><h1>3<h1><p>沾醬：兩茶匙白醋/一茶匙糖/些許辣椒\\n擺盤完成～<p> <hr>\']', '個、克、大匙、張、茶匙、茶匙、自由調整'),
(471, '泰式麻辣涼麵', '涼麵、小黃瓜紅蘿蔔切細絲、蛋細絲蝦子蟹肉棒、麻辣醬花生醬', '分、份、份、份', '471.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>1小黃瓜紅蘿蔔切細絲\\n2、煎蛋切細絲蝦子蟹肉棒煎熟<p> <hr><h1>2<h1><p>1涼麵冷溫水川燙\\n2麻辣醬花生醬檸檬汁醬油調好<p> <hr><h1>3<h1><p>擺好盤照相淋上醬汁<p> <hr>\']', '分、份、份、份'),
(472, '泰式大蝦青芒沙拉', '大蝦、青芒(大)、炸蒜片(氣炸)、炸乾蔥(氣炸)、芫茜、泰國蝦皮、椰糖水、羅望子醬、魚露、青檸汁、泰式辣椒粉、蒜蓉', '十多、1、半、半、2-3、半、5、2、2.5、2、一點點、2', '472.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>大蝦灼熟後待涼，之後去頭去殼備用<p> <hr><h1>2<h1><p>蒜、乾蔥去皮切片後，用鹽水浸15分鐘(去苦味！)<p> <hr><h1>3<h1><p>之後用廚房紙卷好吸乾，靜置15分鐘<p> <hr><h1>4<h1><p>180度預熱了5分鐘的氣炸鍋\\n炸10分鐘左右，每3-4分鐘打開看看翻翻，炸好備用<p> <hr><h1>5<h1><p>青芒去皮後刨絲備用<p> <hr><h1>6<h1><p>蝦皮白鑊炒香備用<p> <hr><h1>7<h1><p>芫茜洗淨切去根部，切碎備用\\n醬汁先拌勻<p> <hr><h1>8<h1><p>之後將所有材料拌勻即成<p> <hr>\']', '隻、個、小碗、小碗、棵、小碗、大匙、小匙、大匙、大匙、一點點、小匙'),
(473, '泰式風味涼拌雞雜', '去骨雞腿、雞心、小黃瓜、檸檬、泰式甜辣醬、和風醬油、辣椒粉、蒜頭、米酒', '1、1、1、1、3、2、1、6、1', '473.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 3, '<hr><h1>1<h1><p>小黃瓜洗淨切絲冰冰箱備用。\\n雞心去除白色脂肪後對切。\\n雞腿切小塊。<p> <hr><h1>2<h1><p>灑少許鹽巴跟一匙米酒拌勻後放入微波爐，以600瓦加熱4分鐘。<p> <hr><h1>3<h1><p>準備醬料。<p> <hr><h1>4<h1><p>檸檬對切後，切兩片薄片切成小三角形備用。\\n剩下檸檬汁全部擠入碗內。\\n蒜頭切末放入碗內。\\n倒入3大匙泰式酸辣醬，2大匙和風醬油，1匙辣椒粉。\\n拌勻後，再加入切好的小檸檬片稍微拌一下。<p> <hr><h1>5<h1><p>微波好的肉類以冷水沖涼瀝乾。\\n拿出小黃瓜絲。\\n備好醬料。<p> <hr><h1>6<h1><p>將食材組合在一起，最後倒入醬汁<p> <hr><h1>7<h1><p>拌勻後即可享用。<p> <hr>\']', '片、盒、條、顆、大匙、大匙、大匙、瓣、大匙'),
(474, '月亮蝦餅', '春捲圓皮、白刺蝦1盒 (約1斤)、魚漿、鹽、 胡椒粉、 米酒適量、辣椒、大蒜、檸檬汁、魚露、糖', '20、1、200、適量、1/2、2、1/2、1、1', '474.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>白刺蝦剝殼去腸泥, 剁碎但不要成泥狀, 要保有顆粒狀 ( 較有口感)<p> <hr><h1>2<h1><p>和魚漿混合一起備用<p> <hr><h1>3<h1><p>將一球蝦泥放在潤餅皮上, 蓋上另一片<p> <hr><h1>4<h1><p>用刀背輕輕拍成薄片, 同時蝦泥也會平均分配在裡面. 然後在表面上戳起個洞.<p> <hr><h1>5<h1><p>起油鍋, 少許油, 中小火放一片下去煎兩面金黃切片.<p> <hr><h1>6<h1><p>沾醬做法: 大蒜粒炒辣椒放適量水, 加點糖, 再加些檸檬汁及魚露即可, 可調出自己喜歡的甜酸度.<p> <hr><h1>7<h1><p>成品擺盤可享用<p> <hr>\']', '張、斤、公克、適量、碗、大匙、碗、大匙、大匙'),
(475, '泰式椒麻雞', '生菜、去骨雞腿肉、醬油、大蒜末、檸檬汁、魚露、蒜末、辣椒、細砂糖、水、醬油、香菜', '適量、2、2、2、4、2、2、1、2、2、3、10', '475.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 3, '<hr><h1>1<h1><p>生菜洗乾淨泡冰水冰冰箱備用，雞腿肉劃幾刀加入醬油跟大蒜放入冰箱醃漬至少兩小時<p> <hr><h1>2<h1><p>醬汁：除了香菜以外的所有調味料混合均勻就可以了<p> <hr><h1>3<h1><p>煎雞腿肉（帶皮那面先下鍋煎），雞肉快熟時，香菜切末，倒入醬汁中<p> <hr><h1>4<h1><p>生菜切絲舖盤底，放上切好的雞肉，淋上醬汁，就完成了！<p> <hr>\']', '適量、片、大匙、大匙、大匙、大匙、大匙、根、大匙、大匙、大匙、公克'),
(476, '泰式打拋豬', '豬絞肉、九層塔、辣椒、蒜末、醬油、檸檬魚醬、米酒、醬油、鹽', '1、適量、適量、6-7、2、3、適量、適量、1-2', '476.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 3, '<hr><h1>1<h1><p>1. 絞肉先加入少許米酒、醬油、鹽抓醃至產生黏性，靜置15分鐘以上\\n2. 蒜頭切成末\\n3. 檸檬魚露是在家樂福異國料理區買的，較方便<p> <hr><h1>2<h1><p>熱鍋後用中大火直接下絞肉，不要加油，若肉太瘦可加一點\\n鋪平後先放一分鐘左右讓他出油後開始翻炒\\n炒至約如圖中變色的樣子後下蒜末與辣椒拌炒<p> <hr><h1>3<h1><p>等到辣椒蒜末香氣出來後就可以加入醬油、檸檬魚露、九層塔了\\n炒至醬汁收至如圖中那樣的稠度就可以盛盤了喔<p> <hr><h1>4<h1><p>辣椒與九層塔的量不一定，我喜歡九層塔的味道，有加的比首圖多很多，怕辣辣椒就比較少，不會影響太多風味，大家可以隨自己的口味做增減。<p> <hr>\']', '盒、適量、適量、瓣、大匙、大匙、適量、適量、匙'),
(477, '芒果糯米飯', '糯米、水、椰漿、糖、鹽巴、芒果', '300、200、2、20、1/4、1', '477.png', 'https://icook.tw/recipes/', 0, 1, 0, 0, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>糯米泡水1個晚上<p> <hr><h1>2<h1><p>鋪平在容器中 蒸30分鐘<p> <hr><h1>3<h1><p>椰漿 水 糖 鹽混合<p> <hr><h1>4<h1><p>泡在熱水中攪拌至糖溶解<p> <hr><h1>5<h1><p>芒果去皮 切薄片<p> <hr><h1>6<h1><p>捲成花狀備用<p> <hr><h1>7<h1><p>糯米加入150毫升的椰漿拌勻<p> <hr><h1>8<h1><p>盛盤 放上糯米 放上芒果花 淋上剩下的椰漿<p> <hr><h1>9<h1><p>完成<p> <hr>\']', '克、毫升、大匙、克、茶匙、顆'),
(478, '泰式肉碎生菜包', '免治豬肉、紅?頭、蒜頭、香茅、檸檬葉、指天椒、唐生菜/萵苣、九層塔、生抽、魚露、黑胡椒粉、糖、生粉、油、青檸汁、魚露', '300、2、3、1、數片、兩、1-2、10、1、2、適量、1、2、2、少許、少許', '478.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>免治豬肉用醃料醃最少30分鐘<p> <hr><h1>2<h1><p>紅?頭、蒜頭去皮切末，指天椒切圈，香茅用刀背拍並切段，檸檬葉用手撕開一半。<p> <hr><h1>3<h1><p>熱鍋下油，爆香紅?頭、蒜蓉、香茅、檸檬葉。<p> <hr><h1>4<h1><p>以中大火炒熟免治豬肉，下辣椒圈炒香，加入青檸汁、魚露，豬肉熟透即可關火。關火後隨即灑下九層塔拌勻。<p> <hr><h1>5<h1><p>擺盤時可插入一株九層塔於中央伴碟。配搭生菜吃最對味，拌飯吃也最下飯！<p> <hr>\']', '克、顆、瓣、條、數片、條、棵、克、湯匙、湯匙、適量、茶匙、湯匙、湯匙、少許、少許'),
(479, '鮮蝦蔬菜綠咖哩', '盒裝綠咖哩、洋蔥、櫛瓜、茄子、鮮蝦', '1、1、1、1、6', '479.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>洋蔥櫛瓜茄子切塊，蝦子剝殼保留頭尾<p> <hr><h1>2<h1><p>熱鍋後加點油，放入洋蔥<p> <hr><h1>3<h1><p>炒到洋蔥香味出來，加入櫛瓜拌炒<p> <hr><h1>4<h1><p>炒到櫛瓜略軟，加入茄子，再炒到茄子也略軟，倒入綠咖哩湯包，拌勻一下，蓋上蓋子，煮5分鐘<p> <hr><h1>5<h1><p>時間到，放入蝦子，煮到蝦子變色熟了，即可關火，完成<p> <hr>\']', '盒、個、條、根、隻'),
(480, '泰式椰汁西米糕', '班蘭葉、西米、糖、椰奶、熱水、水、糖、鹽、生粉、?米（裝飾用）', '4、25、半、50、40、40、15、少許、13、數粒', '480.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>洗淨班蘭葉，然後將兩頭剪去<p> <hr><h1>2<h1><p>將班蘭葉只剩20 cm長，每4、8、12、16cm剪一刀至中間<p> <hr><h1>3<h1><p>摺盒子教學可到https://youtu.be/lLMe6hm19hE。用膠紙將盒子收口<p> <hr><h1>4<h1><p>西米加入滾水，煮5分鐘，熄火蓋焗20分鐘<p> <hr><h1>5<h1><p>西米過冷後再加熱，加糖拌勻<p> <hr><h1>6<h1><p>西米放入班蘭葉盒至60%滿<p> <hr><h1>7<h1><p>準備糖水及生粉水\\n糖水：將糖及鹽加入熱水拌勻\\n生粉水：將生粉加入水拌勻<p> <hr><h1>8<h1><p>椰奶用小火煮滾，先加入糖水，椰奶再煮滾後，將生粉水分三次加入。中間不停攪拌<p> <hr><h1>9<h1><p>將椰漿加入班蘭葉盒子<p> <hr><h1>10<h1><p>可加粟米作裝飾。放入雪櫃冷凍兩小時即可食用<p> <hr>\']', '條、g、茶匙、ml、ml、ml、g、少許、g、數粒'),
(481, '泰式椒麻雞', '雞腿肉、麵粉、地瓜粉、高麗菜絲、醬油、香油、糖、花椒油、辣椒、檸檬、九層塔、香菜、醬油、魚露、糖、熱水、大蒜', '2片、1/2杯、1/2杯、1/4顆、2大匙、1大匙、2大匙、1大匙、2根、1/2顆、適量、適量、2大匙、1大匙、2大匙、2大匙、3瓣', '481.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 3, '<hr><h1>1<h1><p>將醬油、麻油、糖加入攪拌盆中，製做成醃肉醬。<p> <hr><h1>2<h1><p>將雞腿放入醃肉醬中，並攪拌均勻，放入冰箱中靜置30分鐘。<p> <hr><h1>3<h1><p>製作淋醬：將大蒜，辣椒，羅勒，香菜等切碎，擠入檸檬汁，將剩餘的調味料加入。<p> <hr><h1>4<h1><p>在盤中倒入麵粉和地瓜粉，將醃製好的雞腿肉放在粉中，均勻裹粉。<p> <hr><h1>5<h1><p>再過中倒入油，等油熱後，將裹好粉的雞腿肉，放入鍋中炸至外表金黃。<p> <hr><h1>6<h1><p>料菜切絲，泡入冰水當中10分鐘，會使菜吃起來更脆。<p> <hr><h1>7<h1><p>將冰鎮後的高麗菜絲放在盤子底部，放上切好的雞排，淋上調製好的淋醬。<p> <hr>\']', '2片、1/2杯、1/2杯、1/4顆、2大匙、1大匙、2大匙、1大匙、2根、1/2顆、適量、適量、2大匙、1大匙、2大匙、2大匙、3瓣'),
(482, '泰式棕櫚果甜湯', '新鮮棕櫚果、棕櫚糖、水、班蘭葉', '1、50、850、適量', '482.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>買回來的棕櫚果要去皮.用小刀輔助將皮去掉.\\xa0<p> <hr><h1>2<h1><p>去掉皮後,棕櫚果好晶瑩剔透呀! 將它們中間剖半,切成小塊備用.<p> <hr><h1>3<h1><p>先將班蘭葉放入水中同煮,目的是希望有班蘭葉的香氣.<p> <hr><h1>4<h1><p>水煮開後,將班蘭葉撈出,再放入切好的棕櫚果和棕櫚糖.<p> <hr><h1>5<h1><p>將糖和棕櫚果放入水中,要將水重新煮滾.<p> <hr><h1>6<h1><p>煮滾就可以關火,放涼就可以吃了.<p> <hr><h1>7<h1><p>冰冰的更好吃.\\xa0<p> <hr>\']', '包、克、克、適量'),
(483, '泰式涼拌魚卵沙拉', '魚卵、文蛤、小黃瓜、小番茄、檸檬汁、糖、魚露、蒜蓉辣椒醬、香菜', '數塊、1、3、10、3、2、2、適量、適量', '483.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 0, 0, 3, '<hr><h1>1<h1><p>魚卵搓薄鹽、米酒，進電鍋蒸熟\\n放涼洗淨雜質後，進冰箱冰涼備用<p> <hr><h1>2<h1><p>等待過程中將醬料調和\\n小黃瓜、小番茄切丁備用<p> <hr><h1>3<h1><p>將魚卵用剪刀剪成小塊\\n依序把文蛤肉、小黃瓜、小番茄、魚卵放進容器\\n倒入醬汁拌勻後即可上桌<p> <hr>\']', '數塊、盒、條、個、顆、湯匙、湯匙、適量、適量'),
(484, '泰式海鮮酸辣湯泡飯', '香茅、檸檬葉、蝦頭、蝦子、菇類、蛤蜊、米酒、香菜少許、檸檬、椰汁、辣椒、洋蔥、紅蔥頭、小番茄、豌豆、泰式酸辣醬、魚露、米酒、檸檬', '1、7-10、10-15、5-10、隨意、5-10、些許、少許、一、1/2-2/3、半、1/2-1、2、10、些許切對半、3-4、1-2、隨意、1/2', '484.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>食材\\n香茅\\n檸檬葉\\n魚露\\n蝦子\\n蝦頭\\n洋蔥\\n紅蔥頭\\n辣椒\\n香菜\\n檸檬\\n菇類\\n泰式辣椒醬\\n椰汁\\n蛤蜊\\n米酒\\n小番茄<p> <hr><h1>2<h1><p>熱油鍋加入橄欖油<p> <hr><h1>3<h1><p>加入蝦頭<p> <hr><h1>4<h1><p>紅蔥頭片<p> <hr><h1>5<h1><p>辣椒片<p> <hr><h1>6<h1><p>加入洋蔥<p> <hr><h1>7<h1><p>香菜梗<p> <hr><h1>8<h1><p>香茅\\n梗切開\\n根扭轉出味道\\n好入味<p> <hr><h1>9<h1><p>加入香茅<p> <hr><h1>10<h1><p>過濾水<p> <hr><h1>11<h1><p>檸檬片<p> <hr><h1>12<h1><p>米酒<p> <hr><h1>13<h1><p>薑片\\n沒有南薑所以用一般的薑<p> <hr><h1>14<h1><p>加入切對半的豌豆<p> <hr><h1>15<h1><p>加入切對半的小番茄<p> <hr><h1>16<h1><p>加入菇類<p> <hr><h1>17<h1><p>蛤蜊<p> <hr><h1>18<h1><p>蝦子<p> <hr><h1>19<h1><p>泰式辣椒醬<p> <hr><h1>20<h1><p>加入泰式辣椒醬3-4T<p> <hr><h1>21<h1><p>滾了之後\\n撈出蝦頭<p> <hr><h1>22<h1><p>魚露1-1.5T<p> <hr><h1>23<h1><p>檸檬1/2 汁<p> <hr><h1>24<h1><p>撈起香料<p> <hr><h1>25<h1><p>滾7-10分鐘之後試試看味道\\n酸辣度依照自己喜好自行調整唷<p> <hr><h1>26<h1><p>加入椰漿\\n1/2-2/3小火滾\\n喇喇欸，熄火<p> <hr><h1>27<h1><p>完成<p> <hr><h1>28<h1><p>加上九層塔或是香菜葉\\n裝飾一下<p> <hr>\']', '根、片、個、個、隨意、個、些許、少許、顆、罐、條、顆、小顆切片、顆 對切、些許切對半、T、T、隨意、顆'),
(485, '正宗泰式打拋肉', '豬絞肉、打拋葉、蒜頭、朝天椒、長辣椒、魚露、醬油、椰糖 (二砂也可)', '300、適量、6-8、2-3、1、適量、2、1', '485.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 3, '<hr><h1>1<h1><p>朝天椒切末 (辣度可以自己調整)<p> <hr><h1>2<h1><p>長辣椒椒切片 (這是用來調色用，沒甚麼辣度)<p> <hr><h1>3<h1><p>蒜頭切成末<p> <hr><h1>4<h1><p>熱油先爆香辣椒跟蒜末，炒出香味<p> <hr><h1>5<h1><p>接下放入豬絞肉拌炒<p> <hr><h1>6<h1><p>等豬肉有點熟度後可先加一小匙椰糖，繼續拌炒讓糖融化，<p> <hr><h1>7<h1><p>陸續加入 魚露、醬油、等豬肉熟後，加入打拋葉拌炒約30秒就可以起鍋囉。<p> <hr><h1>8<h1><p>加入一顆太陽蛋，白飯立刻被掃光阿<p> <hr>\']', '克、適量、顆、條、條、適量、匙、小匙'),
(486, '泰式豬肉生菜包', '免治豬肉、蘿蔔、青豆（可用其他蔬菜）、生菜、羅勒葉、檸檬葉、蒜蓉、香茅、辣椒、蠔油、魚露、豉油、糖、青檸', '400、隨便、1、20、6、2、2、1、1.5、1.5、1、1、1', '486.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>用豉油、少許鹽及胡椒粉醃豬肉15分鐘<p> <hr><h1>2<h1><p>香茅切走兩頭及切開中間<p> <hr><h1>3<h1><p>撕碎檸檬葉<p> <hr><h1>4<h1><p>炒香蒜蓉、香茅、檸檬葉及辣椒1分鐘?<p> <hr><h1>5<h1><p>加入豬肉再炒數分鐘至金黃色<p> <hr><h1>6<h1><p>加入蔬菜<p> <hr><h1>7<h1><p>加入調味料?試味<p> <hr><h1>8<h1><p>熄火，加入羅勒葉及青檸汁<p> <hr><h1>9<h1><p>拿掉香茅便可上碟<p> <hr>\']', '克、隨便、個、g、片、片、茶匙、條、條、湯匙、湯匙、湯匙、茶匙、個'),
(487, '冬陰功湯TomYunGoong', '白蝦、香茅、南薑、辣椒、草菇、魚露、檸檬葉、檸檬汁、椰奶', '300、8、6-8、1、100、4-5、4-5、1.5、適量', '487.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 0, 1, 1, 1, 3, '<hr><h1>1<h1><p>(準備) 白蝦去頭去殼，頭部去蝦囊、開背去腸泥後抓鹽醃漬; 南薑洗淨後去皮切薄片; 辣椒斜切; 香茅取尾端(紫色部分)1/2份量斜切，其餘以刀背拍打; 草菇洗淨後對切; 檸檬榨汁備用。<p> <hr><h1>2<h1><p>鍋內放入少量橄欖油，將蝦頭、蝦殼入鍋拌炒，以炒勺擠壓蝦殼釋出蝦膏，待鍋內橄欖油成紅色、蝦頭蝦殼變色後，將蝦頭蝦殼取出，接著放入拍打過的香茅與800-1,000c.c.滾水熬煮20分鐘。<p> <hr><h1>3<h1><p>放入斜切的香茅，並將南薑、辣椒、草菇入鍋，湯滾後慢慢加入魚露調味。<p> <hr><h1>4<h1><p>味道OK後，加入檸檬葉(入鍋前可以稍微撕開)、白蝦，待白蝦熟成後，最後再加入檸檬汁與椰奶調整味道，就可以上桌囉!!（也可依喜好放入麵條、冬粉，就成為主食囉！）<p> <hr>\']', 'g、支、片、支、g、大匙、片、顆、適量'),
(488, '泰式咖哩炒螃蟹', '螃蟹、洋蔥、芹菜葉、紅辣椒、蒜、蔥、罐頭三花奶、醬油、蠔油、砂糖、咖哩粉、泰式辣椒醬、雞蛋、胡椒粉', '1、1、適量、2、5-6、2-3、1、1、1、1、4、2、3、少許', '488.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>先將買回來的螃蟹剝掉蟹殼及腮,仔細洗乾淨.<p> <hr><h1>2<h1><p>將大蒜切成蒜末,蔥和芹菜洗淨,芹菜主要是用葉子,洋蔥切絲,辣椒去籽切段.<p> <hr><h1>3<h1><p>爆香蒜末.<p> <hr><h1>4<h1><p>接著下螃蟹拌炒.<p> <hr><h1>5<h1><p>螃蟹炒的時候會出水,要花點時間確定螃蟹熟,螃蟹中的水收乾.<p> <hr><h1>6<h1><p>趁著螃蟹在鍋中煮的時間,將炒蟹的醬汁調好.先將三花奶倒入碗中<p> <hr><h1>7<h1><p>再將醬油,蠔油,泰式辣椒醬,炒螃蟹用的咖哩粉,加到三花奶中.<p> <hr><h1>8<h1><p>醬油,蠔油,泰式辣椒醬,咖哩粉和奶充分混合後,接著將蛋加入攪拌均勻,這時可以試一下味道,適時調整,因為這碗醬汁會決定最後整道菜的味道.<p> <hr><h1>9<h1><p>螃蟹炒到收汁時,可以加洋蔥和辣椒.<p> <hr><h1>10<h1><p>接著將調好的咖哩蛋汁全部倒到鍋裏,大火快炒.<p> <hr><h1>11<h1><p>看到咖哩蛋汁開始結塊,就可以關火,撒上蔥段和芹菜葉,讓芹菜葉的香氣隨著鍋氣散發出來,這樣就完成啦!<p> <hr>\']', '公斤、顆、適量、支、瓣、支、杯、茶匙、茶匙、茶匙、茶匙、茶匙、個、少許'),
(489, '月亮蝦餅', '蛋餅皮、魚漿、蝦子、花枝、醋、糖、蒜頭碎、辣椒碎、蛋白、鹽巴、太白粉、胡椒粉', '2、適量、10、適量、斟酌、斟酌、3、1、1、適量、適量、適量', '489.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>蒜頭.辣椒（洗淨切碎）<p> <hr><h1>2<h1><p>醋+糖+（剛切好的蒜頭.辣椒碎）\\n大火煮滾????（完成）<p> <hr><h1>3<h1><p>蝦子（洗淨+去腸泥+剁碎）\\n花枝（洗淨+切丁）\\n\\n蝦漿 花枝漿 魚漿（混合漿）\\n\\n鹽巴+胡椒+蛋白+太白粉+混合漿<p> <hr><h1>4<h1><p>取兩張蛋餅皮\\n\\n均勻塗抹混合漿\\n\\n小心翼翼將麵糊塗抹四周（防爆開）<p> <hr><h1>5<h1><p>耐心等候（??）<p> <hr><h1>6<h1><p>切八等分（完成）\\n\\n\\n\\n好吃到停不下了<p> <hr>\']', '張、適量、尾、適量、斟酌、斟酌、顆、條、顆、適量、適量、適量'),
(490, '打拋豬肉', '豬絞肉、大蕃茄、辣椒切末、蒜頭切末、醬油、魚露、糖、檸檬、九層塔、米酒', '約300、半、1、5、1.5、1、1、半、約10、1', '490.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 1, 0, 0, 3, '<hr><h1>1<h1><p>蕃茄切小塊，約一口大小，辣椒和蒜頭切末備用。<p> <hr><h1>2<h1><p>先下一點點點油以中大火將蒜頭和辣椒爆香，因為豬肉會出油，所以不需要很多油，只需一點能爆香香料就好，等聞到蒜香就可以把豬絞肉放入鍋，平鋪於鍋中，變色就可以翻面。<p> <hr><h1>3<h1><p>之後加入蕃茄翻炒，等蕃茄軟了之後，倒入米酒，去一下豬肉的腥味，然後醬油，醬油要炒過才會香，再把魚露，糖加入拌炒，之間要用鍋鏟把絞肉切一切，讓絞肉分開，因為絞肉會黏在一起。<p> <hr><h1>4<h1><p>起鍋前加入九層塔和檸檬汁翻炒至有九層塔的香味就好了。<p> <hr>\']', 'g、顆、根、瓣、大匙、大匙、大匙、顆、片、大匙'),
(491, '泰式檸檬魚', '鱸魚、香菜、紅辣椒、蒜頭、薑、魚露、檸檬汁、砂糖', '1、適量、2、1、1、1、1/2、1', '491.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>準備好食材.<p> <hr><h1>2<h1><p>蒜頭和薑片都切成末末後再和魚露.檸檬汁.砂糖一起攪拌均勻,紅辣椒切末,香菜切段.檸檬半顆擠檸檬汁,另外半顆切薄片備用.<p> <hr><h1>3<h1><p>將魚洗淨劃刀,抹上鹽與米酒去腥,把薑片擺在魚上,入鍋蒸8分鐘左右.<p> <hr><h1>4<h1><p>8分鐘後,將薑片夾出丟棄,湯汁倒掉,淋上調好的醬汁,再回鍋蒸2分鐘讓醬汁入味.<p> <hr><h1>5<h1><p>將蒸好的魚小心端出來,擺上香菜與檸檬片即可上桌.<p> <hr>\']', '尾、適量、根、顆、片、大匙、顆量、大匙'),
(492, '泰式油條PaTongGo', '麵粉、蛋、糖、泡打粉、小蘇打粉、水、油', '300、1、30、6、4、145、10', '492.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>1-1.除了油,將所有材料倒入盆中,揉成一麵團,因為蛋有大有小,建議水分次加,成麵團後,若還有水沒加完也沒關係.\\xa0\\xa0\\n\\n1-2.麵團上抹油後,放入塑膠袋中(塑膠袋中也可抹一些油),放到冰箱靜置至少8小時.建議前一晚上揉好麵團,第二天早上起來炸.\\xa0<p> <hr><h1>2<h1><p>(第二天)將靜置好的麵團從冰箱取出,回溫30分鐘.不要再揉麵,而是將麵團分塊,桿成寬約10公分,厚約0.2公分薄片.\\xa0<p> <hr><h1>3<h1><p>為了炸出來的Pa Tong Go好看,將桿好的麵切掉不整齊的四邊,再切成等狀的長方形.切下來的麵捏在一起,等一下桿平再炸.\\xa0<p> <hr><h1>4<h1><p>鍋中倒入油,中火加熱幾分鐘後,取一小塊麵團丟到油中,若麵團很快就浮起,就可以開始炸了.<p> <hr><h1>5<h1><p>將長條狀的麵片兩片一疊,中間用筷子壓成一條線,再用雙手從兩頭拿起壓好的Pa Tong Go麵團,順便將兩頭也捏緊.<p> <hr><h1>6<h1><p>將準備好的Pa Tong Go 放入鍋中炸.一遇熱就澎起來了,這時候還是中火.\\xa0<p> <hr><h1>7<h1><p>兩面上色後,開大火逼油,將一條條炸好的Pa Tong Go夾出,瀝油後再盛盤.<p> <hr><h1>8<h1><p>炸好啦!發的很漂亮.<p> <hr>\']', '克、顆、克、克、克、克、克'),
(493, '泰式檸檬魚', '蒜末、薑末、香菜、辣椒、蔥、檸檬、魚露、水、糖', 'ㄧ、ㄧ、兩、1/2～1、ㄧ、半、3、3、1/3', '493.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>蒜頭，薑、香菜莖，辣椒、蔥切末。將檸檬，魚露，水，糖加入調勻。香菜葉洗淨備用。<p> <hr><h1>2<h1><p>魚片洗淨後放入盤中，淋入醬汁，蒸約10分鐘<p> <hr><h1>3<h1><p>準備起鍋前撒入香菜葉，再蒸個約一分鐘。筷子可穿透魚肉就熟了~完成!!<p> <hr>\']', '大匙、小匙、株、支、支、個、小匙、大匙、小匙'),
(494, '氣炸鍋料理', '鱈魚、米酒、青蔥、薑片、粗黑胡椒、義大利香料、檸檬椒鹽、辣椒、蒜頭、黃檸檬、味醂、鰹魚露、白砂糖、白醋', '一、一、一、兩、適量、適量、適量、一、兩、半、兩、一、一、一）', '494.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>鱈魚洗淨後用廚房紙巾兩面按乾，\\n置盤淋上一大匙米酒（15ml）去腥味。<p> <hr><h1>2<h1><p>蒜頭、辣椒切末，\\n青蔥、薑片切絲，\\n黃檸檬切兩薄片（裝飾用），其餘全部擠成汁。<p> <hr><h1>3<h1><p>取一小碗將步驟2的蒜末、辣椒末、檸檬汁全部裝入，再加入調味料混合拌勻備用。<p> <hr><h1>4<h1><p>氣炸鍋炸籃放鋁箔紙（亮面朝下），將步驟1的鱈魚放進去。<p> <hr><h1>5<h1><p>用小湯匙將步驟3小碗中的調味料淋在鱈魚上，再灑上適量檸檬椒鹽、義大利香料、粗黑胡椒，最後將步驟2切好的薑絲均勻撒上。\\n（檸檬片建議先不要放進去避免焦黑）<p> <hr><h1>6<h1><p>氣炸第一次200度8分鐘後，拉開再氣炸第二次180度5分鐘（倒數1-2分鐘時拉開將青蔥絲撒上去溫熱），全程無需翻面。<p> <hr><h1>7<h1><p>將炸籃中鋁箔紙小心拿出，放在大盤中，再放上檸檬片裝飾即完成。\\n（也可以不裝盤直接吃）<p> <hr>\']', '片、大匙、根、片、適量、適量、適量、根、瓣、顆、大匙、大匙、小匙、大匙'),
(495, '泰奶雪花糕（含影音連結）', '泰奶茶葉、牛奶、黃砂糖、玉米粉、椰絲', '2、700、70、90、依個人喜好', '495.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>鍋子內加入牛奶，砂糖，玉米粉，攪拌均勻。\\n放入泰奶茶包，用中火加熱並不時攪拌<p> <hr><h1>2<h1><p>持續攪拌，感覺變濃稠時轉小火，再繼續攪拌以防底部燒焦，此時可以取出茶包<p> <hr><h1>3<h1><p>加熱到如照片般落下有明顯痕跡時即刻熄火<p> <hr><h1>4<h1><p>容器抹層薄油防沾。將雪花糕糊倒入容器，放涼置冰箱直到完全凝固<p> <hr><h1>5<h1><p>切割成適量大小，刀子在每次切割間沾水可防沾哦！<p> <hr><h1>6<h1><p>沾上椰絲，即完成！<p> <hr><h1>7<h1><p>冰冰涼涼，入口即化的泰奶雪花糕真的好銷魂啊～\\n?? 實作影音連結：bit.ly/2AiQTqc<p> <hr>\']', '茶匙、克、克、克、依個人喜好'),
(496, '泰式椰汁雞湯(TomKhaGai)', '雞胸肉、蘑菇、香茅、檸檬葉、南姜、耶奶、香菜、魚露、糖、小辣椒、檸檬汁、鹽', '2、250、2、5-6、1、400、一、2、1、1-2、1、少許', '496.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>雞胸肉 2塊 切丁\\n蘑菇  250g  切塊\\n香茅  2根  切段\\n檸檬葉 5-6片\\n南姜 1小塊  切大片\\n耶奶 400ml\\n香菜 一小把 根切下煮湯\\n魚露 2大匙\\n糖 ( 椰糖)  1大匙 \\n小辣椒 ( 不吃辣可不加)  1-2根\\n檸檬汁 1顆\\n鹽 少許<p> <hr><h1>2<h1><p>用少許魚露及玉米粉或太白粉醃一下 \\n\\n醃是為了讓肉入味, 粉是為包裹雞肉，煮時裹住雞肉水分不致乾柴<p> <hr><h1>3<h1><p>將香茅 ，檸檬葉 ，南姜 及香菜根放入鍋中用一小碗水煮１０分鐘<p> <hr><h1>4<h1><p>倒入一半耶奶煮滾<p> <hr><h1>5<h1><p>放入雞肉丁用中火煮微滾後，關小火煮５分鐘\\n加入調味料，魚露 ,椰糖 ( 辣椒,不吃辣得人可不加)<p> <hr><h1>6<h1><p>加入蘑菇及剩下一半的耶奶中火煮約5分鐘<p> <hr><h1>7<h1><p>加入檸檬汁攪拌後試味道看鹹甜以及酸度是否足夠,依個人口味調整不足的調味料即可關火,<p> <hr><h1>8<h1><p>上桌前撒上香菜 \\n在泰國,會把湯跟泰國香米伴著一塊吃<p> <hr>\']', '塊、g、根、片、小塊、ml、小把、大匙、大匙、根、顆、少許'),
(497, '泰式海鮮沙拉', '蝦仁、軟絲、小蕃茄、小黃瓜、杏鮑菇、芹菜、香菜、紫洋蔥、蒜頭、泰式辣椒、魚露、檸檬汁、和風醬油、糖', '20、中型一、15、一、一、半、一、小型一、2、2、2、2、1、1', '497.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 0, 0, 3, '<hr><h1>1<h1><p>大蝦仁清洗乾淨滾水川燙顏色變紅撈起放檸檬冰水冰鎮降溫後瀝乾水份備用<p> <hr><h1>2<h1><p>中型軟絲一隻清洗乾淨滾水快速川燙再次水滾撈起放檸檬冰水冰鎮降溫後瀝乾水份備用<p> <hr><h1>3<h1><p>1、小蕃茄對半切開備用\\n2、小黃瓜切斜條狀滾水放鹽川燙一分鐘撈起放冰水冰鎮降溫後瀝乾水份\\n3.芹菜滾水放油川燙再次水滾撈起放冰水冰鎮降溫後瀝乾水份<p> <hr><h1>4<h1><p>1.紫洋蔥滾水川燙再次水滾撈起放冰水冰鎮降溫後瀝乾水份\\n2.杏鮑菇滾刀切塊滾水放鹽川燙再次水滾撈起放冰水冰鎮降溫後瀝乾水份<p> <hr><h1>5<h1><p>3.香菜清洗乾淨，冷開水浸泡後瀝乾水份切小段備用<p> <hr><h1>6<h1><p>醬料食材：\\n蒜頭切碎\\n泰式辣椒醬\\n魚露\\n檸檬汁\\n和風醬油\\n糖\\n全部拌均勻<p> <hr><h1>7<h1><p>找一大容器放入所有備用食材、醬料食材，帶手套拌均勻裝盤，冷藏保存，最好當天食用。<p> <hr>\']', '隻、隻、顆、條、個、把、小把、顆、片、T、T、T、T、T'),
(498, '泰式綠咖喱', '綠咖喱醬、雞肉、椰奶、檸檬葉、紅椒、糖、魚露', '50、200、500、5-6、1、一、一', '498.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>炒拌椰奶至椰子油和椰子分離<p> <hr><h1>2<h1><p>椰子油分離出後，加入綠咖喱醬<p> <hr><h1>3<h1><p>加入雞肉，等到雞肉7、8分熟後，加入剩下的椰奶<p> <hr><h1>4<h1><p>雞肉、蔬菜熟後加入糖和魚露<p> <hr><h1>5<h1><p>最後加入紅椒和檸檬葉，就可以上菜囉～<p> <hr>\']', '克、克、毫升、片、個、匙、匙'),
(499, '泰式酸辣湯Tomyum', '胡蘿蔔、馬鈴薯、番茄、洋蔥、金針菇、水、素食Tom yum醬包、椰奶coconut milk', '1、1、1、1、1、600、1、250', '499.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>《食材備料》\\n胡蘿蔔、馬鈴薯、番茄切塊狀\\n洋蔥切條狀\\n金針菇切段，每段約5cm\\n素食Tom yum醬料包（可到東南亞超市選購）\\n椰奶250cc<p> <hr><h1>2<h1><p>鍋子裝滿500cc水，煮沸後放入胡蘿蔔塊和橄欖油（約1湯匙），蓋鍋蓋悶煮直至胡蘿蔔軟化。<p> <hr><h1>3<h1><p>放入番茄塊、金針菇、馬鈴薯塊、洋蔥，繼續以中火悶煮，直至食材軟化。<p> <hr><h1>4<h1><p>確認食材皆軟化後，放入Tom yum醬包，並充分攪拌，使其與湯料混合均勻。<p> <hr><h1>5<h1><p>醬料均勻融入湯汁後，加入椰奶250cc。<p> <hr><h1>6<h1><p>煮沸後，酸酸辣辣的泰式酸辣椰奶醬料就完成囉！<p> <hr>\']', '條、顆、顆、顆、包、cc、包、cc'),
(500, '月亮蝦餅', '蝦仁、玉米粉、豬板油、魚漿、鹽巴、高鮮味精、糖、胡椒粉、潤餅皮、泰式甜辣醬', '400、40、40、100、一、5、10、兩、6、適量', '500.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>蝦仁剁成泥\\n豬板油煉出豬油\\n其餘材料準備好<p> <hr><h1>2<h1><p>所有材料混合攪拌至黏稠狀<p> <hr><h1>3<h1><p>潤餅皮上放蝦泥大約冰淇淋勺兩球的量<p> <hr><h1>4<h1><p>另一張潤餅皮放上去\\n先用手按壓開\\n再用菜刀或平坦的器具拍打<p> <hr><h1>5<h1><p>拍扁均勻後切掉毛邊\\n兩面都戳上幾個洞避免熱空氣膨脹<p> <hr><h1>6<h1><p>用稍微多的油在平底鍋上半煎半炸的方式\\n小火慢煎兩面約各三分鐘<p> <hr><h1>7<h1><p>完成瀝油用紙巾稍微擦拭\\n再切兩個十字即完成<p> <hr><h1>8<h1><p>此份量約可做三片\\n想吃厚一點可以分成兩片拍打\\n最後沾上泰式甜辣醬就跟餐廳吃到的一樣囉！<p> <hr>\']', 'g、g、g、g、茶匙、g、g、茶匙、片、適量'),
(501, '泰式打拋雞', '雞胸肉、打拋葉、羅勒、九層塔、泰式辣醬、蒜、辣椒、紅蔥頭、打拋醬、魚露、水', '300、50、1、適量、適量、適量、一、一、100', '501.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>爆香蒜、辣椒、紅蔥頭<p> <hr><h1>2<h1><p>加入雞肉炒熟<p> <hr><h1>3<h1><p>加入泰式辣醬炒勻<p> <hr><h1>4<h1><p>加入調味料<p> <hr><h1>5<h1><p>加入九層塔\\n停止加熱\\n繼續拌到九層塔呈現你要的柔軟度即可上菜<p> <hr>\']', 'g、g、大匙、適量、適量、適量、匙、大匙、ml'),
(502, '泰式涼拌檸檬鮮蚵佐粉絲', '蚵仔、泰式酸辣醬、檸檬、泡水後的冬粉、蒜頭、蔥、辣椒、小番茄、香菜梗、砂糖', '1、3、0.25、1、1、1、0.3、5、8、1', '502.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>備料！\\n\\n用泰式甜辣醬、檸檬、糖當主要調味，香菜、蒜頭、蔥、辣椒就看個人喜愛調整即可。<p> <hr><h1>2<h1><p>兩杯水清煮冬粉，依喜愛煮3-5分，再把冬粉瀝乾取出放在盤中備用。<p> <hr><h1>3<h1><p>等冬粉煮熟的同時，把醬料調好，砂糖、檸檬會增加酸甜度，均可依照自己喜愛調整。<p> <hr><h1>4<h1><p>香料切碎，拌入醬料中。<p> <hr><h1>5<h1><p>冬粉取出後，鍋內放1小匙鹽，放入小番茄、蚵，煮3分，泡著2-3分後再撈出。（煮水先不要倒掉）<p> <hr><h1>6<h1><p>煮過的番茄切成四塊，混入醬料拌勻。再把醬料放在蚵與粉絲上。<p> <hr><h1>7<h1><p>如果覺得冬粉太乾，可以加一匙剛才煮蚵的水！完成！好清爽好適合夏天～<p> <hr><h1>8<h1><p>肥美的鮮蚵搭配小番茄與酸甜醬汁，很夢幻的夏日氣息～???<p> <hr>\']', '大碗、匙、顆、把、瓣、根、根、顆、根、匙'),
(503, '泰式打拋豬', '豬絞肉、小番茄、九層塔、辣椒、大蒜、魚露、醬油、沙拉油、糖、米酒、檸檬、洋蔥', '300、15、一、1-2、8、1.5、一、5、兩、一、一、1/4', '503.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 3, '<hr><h1>1<h1><p>1. 九層塔清洗  留下嫩葉\\n2. 小番茄??對切\\n3. 蒜\\U0001f9c4。拍碎 去膜，洋蔥 切小丁\\n4. 調味料組- 魚露1.5 大匙， 醬油一小匙、米酒一大匙、蔗糖或白糖兩小匙、檸檬??半顆壓汁 另削些檸檬片 切碎<p> <hr><h1>2<h1><p>1. 準備油少許。約5cc ，炒香洋蔥 及半份蒜末\\n2. 倒入豬絞肉300克\\n3. 中火??大約炒3-4分鐘至焦香\\n4. 加入 一小匙辣椒???及對切的15顆小番茄 ??繼續中火拌炒90秒\\n5. 倒入調味料組 繼續拌炒 1分鐘<p> <hr><h1>3<h1><p>6. 關火 放入一大盤九層塔 、剩餘之蒜末及檸檬皮碎末，繼續拌炒約30秒\\n7.  盛盤上桌囉<p> <hr>\']', '克、顆、包、根、瓣、大匙、小匙、cc、小匙、匙、顆、顆'),
(504, '泰式打拋豬', '瘦的豬絞肉、小番茄、九層塔、蔥、蒜頭、米酒、醬油、胡椒粉、檸檬、醬油、魚露、紅砂糖、水、白胡椒粉', '1、2、1、1、1-2、半、半、適量、半、2、2、2、半、隨喜愛', '504.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 0, 0, 3, '<hr><h1>1<h1><p>備料。\\n\\n番茄不要太少，番茄炒過會縮水，而且幫助軟化肉質，我抓兩把大概17-18顆。<p> <hr><h1>2<h1><p>肉先抓醃。\\n\\n全聯的絞肉有瘦跟肥的可以選，我是選瘦肉，因為有番茄跟醬汁，炒起來不會乾。<p> <hr><h1>3<h1><p>一顆番茄切成四小塊，香料切末備用。\\n\\n先把醬料調好（檸檬汁、醬油、魚露、紅糖），稍微試一下味道，看是否要更酸還是要更甜。我不喜歡太重的魚露味，醬油是滿湯匙，魚露則只放八分滿。<p> <hr><h1>4<h1><p>中火，少油，讓蒜頭、蔥白先炒香；再加入番茄拌炒。<p> <hr><h1>5<h1><p>炒到番茄有點縮水，把番茄推到一旁，放入絞肉，倒入一瓶蓋米酒在肉上，轉大火炒肉。\\n\\n絞肉剛開始會因為受熱結塊，所以要邊炒邊推開肉末。<p> <hr><h1>6<h1><p>炒到肉熟、番茄縮水變形，倒入醬汁拌炒，持續大火，注意翻動、不要燒焦。<p> <hr><h1>7<h1><p>試個味道！～看自己喜歡的味道偏酸還是鹹，再補放少許醬油、魚露或檸檬、糖。\\n喜歡肉沾滿醬料的話，可以不要放醬油而補放一匙醬油膏，會有點勾芡的效果。\\n\\n撒上胡椒粉（喜歡辣可以多一點），九層塔、辣椒、蔥末，熄火～利用餘溫拌炒。<p> <hr><h1>8<h1><p>炒好後，再擠上一點新鮮檸檬汁會更好吃！<p> <hr><h1>9<h1><p>完成！<p> <hr><h1>10<h1><p>簡單吃飯，炒一盤打拋豬，再配個燙青菜就可以囉～<p> <hr>\']', '盒、把、大把、根、瓣、瓶蓋、瓶蓋、適量、顆、大匙、中匙、大匙、匙、隨喜愛'),
(505, '泰式雞肉河粉', '河粉、韭菜、豆干、豆芽、雞柳、紅蔥頭、蒜頭、雞蛋、醬油、蠔油、魚露、檸檬', '300、50、6、約50、200、10、10、2、1、1、2、1/4', '505.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>河粉泡水<p> <hr><h1>2<h1><p>韭菜切段 豆干對切再切條<p> <hr><h1>3<h1><p>雞柳切條 蒜頭 紅蔥頭切末<p> <hr><h1>4<h1><p>爆香蒜 紅蔥頭後加入雞肉拌炒<p> <hr><h1>5<h1><p>加入豆干炒勻<p> <hr><h1>6<h1><p>加入河粉炒熟 打入兩顆雞蛋拌炒<p> <hr><h1>7<h1><p>醬油 蠔油 魚露調味後 加入豆芽與韭菜炒熟<p> <hr><h1>8<h1><p>起鍋盛盤<p> <hr>\']', '克、克、片、克、克、克、克、顆、大匙、大匙、大匙、顆'),
(506, '泰式炒河粉', '河粉、芥蘭、雞肉(任何肉類)、蒜頭、雞蛋、醬油、蠔油、魚露、水、砂糖', '兩、5、半、3、一、三、兩、兩、兩、兩', '506.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>準備好食材。<p> <hr><h1>2<h1><p>下一大匙油。蒜頭爆香。加入雞肉。炒到半熟。加入芥蘭梗。<p> <hr><h1>3<h1><p>加入全部的芥蘭。炒熟後移到旁邊。\\n下一顆蛋，把蛋打散。混合食材快炒。裝盤備用。<p> <hr><h1>4<h1><p>下一大匙油。 加入河粉及醬汁炒3-5分鐘。<p> <hr><h1>5<h1><p>把剛剛備用的食材加入。均勻拌炒即可!<p> <hr>\']', '人份、把、碗、瓣、顆、大匙、大匙、小匙、小匙、小匙'),
(507, '泰式炒河粉', '河粉、豬肉 (任何肉類)、蔥、香菜、花生、豆芽菜、紅糖、檸檬汁、醬油、魚露、番茄醬、薑、辣椒', '兩、少許、兩、少許、少許、一、三、兩、兩、兩、一、少許、少許', '507.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 0, 0, 0, 3, '<hr><h1>1<h1><p>準備食材。<p> <hr><h1>2<h1><p>加入少許油。熱鍋。下肉絲。<p> <hr><h1>3<h1><p>肉絲炒半熟之後加入河粉。\\n加入醬汁。<p> <hr><h1>4<h1><p>隨後加入豆芽菜。炒熟之後關火。<p> <hr><h1>5<h1><p>最後灑上青蔥，香菜，花生即可。\\n也可以多加一點檸檬汁調味。<p> <hr>\']', '人份、少許、根、少許、少許、碗、大匙、大匙、大匙、大匙、大匙、少許、少許'),
(508, '泰式酸辣鮮蝦紅咖哩', '泰式紅咖哩醬（太多的話會很辣）、薑、洋蔥、蒜、蔥、魚露、九層塔、檸檬、檸檬葉、麻油、椰漿（看自己口味調整）、蝦子（雞肉、牛肉或是豬肉都可）、花椰菜、蘑菇、豆子', '兩、適量、1/4、4、一、1、1、一、10、一、250、15、一、8、一些', '508.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>食材全部先準備好<p> <hr><h1>2<h1><p>洋蔥 蒜頭 薑爆香<p> <hr><h1>3<h1><p>把蝦子炒到8分熟後拿出來備用<p> <hr><h1>4<h1><p>原鍋不用洗加入一點黑麻油<p> <hr><h1>5<h1><p>先把咖喱醬炒香 \\n把蘑菇和豆子炒一炒有一點軟後把蝦子加回去<p> <hr><h1>6<h1><p>加入椰漿 如果你喜歡比較湯汁多的咖喱就加多一點<p> <hr><h1>7<h1><p>加檸檬葉<p> <hr><h1>8<h1><p>加一點魚露\\n還可以加鹽巴調味<p> <hr><h1>9<h1><p>加入事先有煮過的花椰菜<p> <hr><h1>10<h1><p>最後加入九層塔和擠入檸檬汁<p> <hr><h1>11<h1><p>好吃的泰式鮮蝦紅咖哩就好了\\n順口好吃超級下飯 配上糙米飯多纖維健康又美味<p> <hr>\']', '大匙、適量、個、瓣、根小蔥、大湯匙、大把、顆、片、小匙、毫升、隻、朵、個、一些'),
(509, '泰式綠咖哩雞', '雞胸肉、泰國綠圓茄（紫茄可）、椰漿1罐、九層塔、小番茄（可不加）、油、水、玉米粉、魚露、棕櫚糖（二砂可）、辣椒', '200、150、400、約30、4、1、100、1、1、15-20、隨喜', '509.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 3, '<hr><h1>1<h1><p>雞胸肉逆紋切成薄片，以玉米粉抓醃，置於冰箱30分鐘。綠咖喱鹹度已夠，雞肉不需再額外調味。<p> <hr><h1>2<h1><p>圓茄洗淨後去除蒂頭。若買不到圓茄也可使用一般茄子或是任何您喜愛的蔬菜。<p> <hr><h1>3<h1><p>小顆茄子對切，較大的則切成4等份。茄子切開很快就變色，可置於醋水中備用。<p> <hr><h1>4<h1><p>鍋中下一大匙油，與綠咖喱先拌炒出香氣。<p> <hr><h1>5<h1><p>產生香氣後加入1/3罐椰漿煮3分鐘（中小火）。<p> <hr><h1>6<h1><p>3分後再加入1/3罐椰漿及茄子計時7分鐘。若使用其他蔬菜時間請再自行調整，此時蔬菜約煮至7、8分熟即可。<p> <hr><h1>7<h1><p>7分鐘後加入剩餘椰漿、水、糖、魚露、雞胸肉，若喜歡吃辣此時可加入???，並計時4分鐘後熄火。\\n??糖的量建議先下一半，再依口味慢慢增加。<p> <hr><h1>8<h1><p>起鍋前加入九層塔及小番茄（可不加）即可盛盤。<p> <hr><h1>9<h1><p>一般綠咖喱比較少放番茄，但因為剛好手邊沒了辣椒，卻又想配色好看，所以加了些許。為了不影響原始風味，番茄不需煮，和九層塔一同下鍋約10秒即可熄火。番茄微酸的味道吃進嘴裡，其實會讓咖喱整體更清爽。<p> <hr>\']', 'g、g、ml、片、顆、大匙、cc、小匙、小匙、g、隨喜'),
(510, '泰式椒麻雞', '雞腿肉、低筋麵粉、地瓜粉、鹽、胡椒、辣椒粉、醬油、魚露、黑醋、檸檬汁、糖、碎辣椒、蒜末、香菜', '1、適量、適量、半、適量、1、3、2、1、1、1、適量、1-2、適量', '510.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>碗中放入低筋麵粉、地瓜粉、鹽、胡椒、辣椒粉拌均勻，接著將雞腿肉放入並均勻沾上麵粉，沾好後放著等它反潮約5分鐘。<p> <hr><h1>2<h1><p>辣椒、香菜、大蒜切丁，加入上面的醬汁，照著上面的比例調好。比例也可以根據個人口味調整。<p> <hr><h1>3<h1><p>開小火，鍋中倒入多一點油。將雞腿排雞皮一面先朝下開始煎，兩面煎至金黃色，用鍋鏟敲雞皮有酥脆的聲音即可出鍋。<p> <hr><h1>4<h1><p>將雞肉切塊。<p> <hr><h1>5<h1><p>雞肉淋上醬汁即可完成～配上白飯和其他菜就可以當成一餐囉～<p> <hr>\']', '片、適量、適量、匙、適量、匙、匙、匙、匙、匙、匙、適量、瓣、適量'),
(511, '酸辣打拋豬', '豬絞肉、辣椒、蒜頭、四季豆、小番茄、九層塔、味霖、醬油、鰹魚粉、檸檬汁', '250、4、4、一、10、適量、適量、1.5、1、適量', '511.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>食材準備:\\n1.小番茄切半\\n2.四季豆切段\\n3.辣椒切段\\n4.蒜頭切丁\\n5.九層塔洗淨只留葉片備用<p> <hr><h1>2<h1><p>熱油後，辣椒及蒜頭下鍋爆香<p> <hr><h1>3<h1><p>下豬絞肉炒熟<p> <hr><h1>4<h1><p>加一點味霖去除豬騷味<p> <hr><h1>5<h1><p>用醬油、鰹魚粉、檸檬調打拋豬醬汁<p> <hr><h1>6<h1><p>將醬汁倒入炒好的豬絞肉內，並加入四季豆炒熟<p> <hr><h1>7<h1><p>加入小番茄拌炒至皮稍微皺皺的<p> <hr><h1>8<h1><p>即可加入九層塔，在鍋內攪拌後起鍋<p> <hr><h1>9<h1><p>酸辣下飯的打拋豬即可上桌囉～<p> <hr>\']', 'g、根、顆、把、顆、適量、適量、匙、匙、適量'),
(512, '番茄打拋豬', '大蒜、辣椒、豬絞肉、小番茄、九層塔、油、米酒、醬油、魚露、赤藻醣醇、檸檬汁', '5、適量、175、50、10、1、1、1、1、1、1', '512.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>熱鍋下油爆香大蒜和辣椒<p> <hr><h1>2<h1><p>下豬絞肉拌炒<p> <hr><h1>3<h1><p>加米酒<p> <hr><h1>4<h1><p>豬絞肉炒熟後（肉變白），加入小番茄，炒至小番茄變軟<p> <hr><h1>5<h1><p>加入醬油<p> <hr><h1>6<h1><p>加入魚露<p> <hr><h1>7<h1><p>加入赤藻醣醇<p> <hr><h1>8<h1><p>加入檸檬汁拌勻<p> <hr><h1>9<h1><p>起鍋前加入九層塔炒勻就完成囉！<p> <hr>\']', 'g、適量、g、g、g、小匙、小匙、大匙、小匙、小匙、大匙'),
(513, '氣炸泰式椒麻雞', '去骨雞腿、高麗菜絲、青蔥、蒜末、辣椒、薑末、檸檬、香菜末、醬油、砂糖、米酒、花椒粉、白胡椒粉、醬油、魚露、糖、水、烏醋', '2、100、2、5、1、4、2、5、2、2、2、1、1、3、1、2、2、1', '513.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 3, '<hr><h1>1<h1><p>將各項材料備妥<p> <hr><h1>2<h1><p>雞腿肉前一晚用(醬油1+米酒1+砂糖1)先醃漬，醃好後放入氣炸鍋中185度烤18分<p> <hr><h1>3<h1><p>烤雞腿肉的同時，將洗淨泡過冰水的高麗菜切絲<p> <hr><h1>4<h1><p>將調味料及辛香料等拌勻並試味道<p> <hr><h1>5<h1><p>烤好之後將雞腿肉取出<p> <hr><h1>6<h1><p>切塊後撲放在高麗菜絲上<p> <hr><h1>7<h1><p>淋上醬汁，椒麻雞腿就完成了<p> <hr>\']', '支、g、根、瓣、根、片、顆、大匙、匙、匙、匙、匙、匙、匙、匙、匙、匙、小匙'),
(514, '綠咖哩打拋雞', '洋蔥、小番茄、黃金雞胸肉、九層塔、大蒜粒、椰奶、鹽、白醋、魚露、糖、泰式綠咖哩', '半、120、100、20、1、20、少許、1、1、1、2', '514.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>起油鍋+少許油，熱鍋後蒜頭拌炒<p> <hr><h1>2<h1><p>蒜著色後雞肉拌炒，雞肉稍微上色後加入洋蔥拌炒<p> <hr><h1>3<h1><p>洋蔥炒至透明後，再加入番茄拌炒\\n並加入綠咖哩拌開<p> <hr><h1>4<h1><p>加入魚露.些許糖.少許鹽.白醋.提味<p> <hr><h1>5<h1><p>炒勻後加入九層塔，炒至軟化即可關火\\n盛盤加入椰奶即完成料理\\nhttps://www.youtube.com/watch?v=9HPOJEGt0lM<p> <hr>\']', '個、g、g、g、小匙、g、少許、大匙、大匙、小匙、匙'),
(515, '泰式打拋魷魚', '魷魚、九層塔、大蒜、辣椒、Ray特製泰式打拋醬', '三、適量、三、兩、一', '515.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>準備食材<p> <hr><h1>2<h1><p>熱油將辣椒&蒜爆香<p> <hr><h1>3<h1><p>加入一湯匙的打拋醬<p> <hr><h1>4<h1><p>倒入魷魚大火快炒30秒<p> <hr><h1>5<h1><p>加入九層塔快炒30秒<p> <hr><h1>6<h1><p>擺盤上桌！完成<p> <hr>\']', '條、適量、瓣、根、湯匙'),
(516, '泰式打拋雞肉', '雞胸肉、黑木耳、小番茄、紅蔥頭、辣椒（可不加）、九層塔、酪梨油、醬油、魚露、羅漢果糖、葵果打拋粉（全聯）', '250、100、8、4、2、20、15、10、5、5、適量', '516.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 0, 0, 3, '<hr><h1>1<h1><p>雞胸肉可以找市場熟識的肉商請他幫您絞成絞肉，或是自行切小塊後以調理機攪打。小番茄對半切、辣椒紅蔥頭切成細末、木耳切成小丁狀。<p> <hr><h1>2<h1><p>起油鍋，將紅蔥頭炒至變色後加入雞絞肉。肉末炒熟後加入辣椒、打拋肉調味粉、醬油均勻拌炒，並將肉末產生的水份炒乾。<p> <hr><h1>3<h1><p>放入小番茄及木耳，將番茄炒至微軟即可，不要久炒會容易出水！<p> <hr><h1>4<h1><p>最後以魚露、羅漢果糖調味，加入九層塔快炒30秒，起鍋完成。<p> <hr>\']', 'g、g、粒、瓣、跟、g、cc、cc、cc、g、適量'),
(517, '鮮蝦打拋豬炒麵', '麵條、豬絞肉、洋蔥丁、大蒜、青蔥、去殼蝦or蝦仁、荷包蛋、醬油、蠔油、米酒、冰糖、胡椒粉、茴香粉、辣椒、油', '約100、40、1/4、1、1、2、1、適量、適量、1、1、適量、適量、適量、適量', '517.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 3, '<hr><h1>1<h1><p>水煮滾後將麵條放入鍋中煮約5-10分鐘至麵條煮熟，煮熟後撈起來放在一旁。我用的是一般臺式麵條，建議用泰國板條。<p> <hr><h1>2<h1><p>麵條煮好前將豬絞肉和蝦放入適量醬油、蠔油、胡椒粉、茴香、辣椒，還有切碎的蒜末等，還有一匙的冰糖和一匙的米酒醃一陣子，醃的時候可以先把洋蔥切成丁。<p> <hr><h1>3<h1><p>開中火把豬絞肉和蝦放下去一起炒，因為餔肉本身有豬油，所以不必加油。<p> <hr><h1>4<h1><p>肉炒好後先拿起來，用剩下的豬油和洋蔥丁一起開大火快速拌炒至焦黃色。<p> <hr><h1>5<h1><p>開中火，鍋中加入適量的油，不要太少，將麵條、洋蔥、和肉一起放入鍋中拌炒，同時也在麵條上加入適量的醬油和蠔油，可自行衡量適合自己的口味決定醬料的量。<p> <hr><h1>6<h1><p>快好時加入青蔥小火辦炒均勻拌炒就好了～<p> <hr><h1>7<h1><p>煎一顆蛋放在一旁，稍微擺盤一下就好了～<p> <hr>\']', '公克、公克、顆、辦、把、隻、顆、適量、適量、匙、匙、適量、適量、適量、適量');
INSERT INTO `allrec` (`ID`, `name`, `ing`, `num`, `img`, `link`, `heartattack`, `pneumonia`, `diabetes`, `Lower_respiratory_tract`, `hypertension`, `Nephritis`, `Liver`, `total`, `type`, `step`, `unit`) VALUES
(518, '泰式絞肉煎蛋KaiJeawMooSaap', '全蛋、豬絞肉、蔥、優質鮮榨橄欖油、鹽、胡椒粉、魚露、醬油、檸檬汁、棕櫚糖、飲用水、朝天椒、香菜', '3、80、2、30、1.5、少許、1、1/3、1/2、2、2、2、少許', '518.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 3, '<hr><h1>1<h1><p>蔥洗淨擦乾，切蔥花；<p> <hr><h1>2<h1><p>泰式絞肉煎蛋，需要多用點油，讓蛋白炸的香酥，所以當需要用油的時後，就要選擇優質好油，保證不油膩，而且吃起來還很清爽喔～<p> <hr><h1>3<h1><p>將蛋、蔥花、絞肉都放在一起；<p> <hr><h1>4<h1><p>加入鹽和胡椒粉，<p> <hr><h1>5<h1><p>混勻。<p> <hr><h1>6<h1><p>待油燒熱到略微冒煙時；<p> <hr><h1>7<h1><p>將蛋液ㄧ次全倒入鍋中；<p> <hr><h1>8<h1><p>用筷子攪拌中間的蛋液，幫助煎蛋表面熟成的均勻點；轉中火慢慢煎燒到金黃；<p> <hr><h1>9<h1><p>可以試著甩鍋翻面，也可以用盤子或鏟子將蛋翻面，續煎到另一面也金黃即可。<p> <hr><h1>10<h1><p>將沾醬的辣椒切圈狀，香菜略切，放入魚露、醬油、糖和檸檬汁及水便可。<p> <hr>\']', '顆、g、根、g、茶匙、少許、湯匙、湯匙、顆、茶匙、湯匙、根、少許'),
(519, '泰式雞醬排骨酥', '排骨、蔥、地瓜粉、鹽、醋、香油、糖、泰式雞醬', '2、2、適量、2、半、半、半、半', '519.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 3, '<hr><h1>1<h1><p>1、排骨洗淨\\n2、蔥切細末加入\\n3、加入鹽、糖、醋、香油\\n4、醃製30分鐘<p> <hr><h1>2<h1><p>1、排骨外層裹上地瓜粉<p> <hr><h1>3<h1><p>1、油鍋加熱，用中小火把排骨酥炸熟<p> <hr><h1>4<h1><p>2種吃法：\\n1、酥炸排骨酥：炸熟的排骨單純沾胡椒粉吃，也很美味哦！\\n2、泰式雞醬排骨酥作法：將炸排骨的油倒出，將炸熟的排骨酥倒鍋中，加入雞醬拌炒一下就可以起鍋上菜了<p> <hr>\']', '斤、支、適量、小匙、碗、碗、碗、碗'),
(520, '簡易泰式炒粿條-PadThai', '蝦或雞肉、豆腐、紅洋蔥、豆芽菜、韭菜、蛋、粿條、魚露、糖、油、萊姆、花生米、辣椒粉、份量外 糖', '300、半、半、1、適量、2、半、2、3、適量、1/4、適量、1、1', '520.png', 'https://icook.tw/recipes/', 1, 1, 0, 0, 0, 1, 1, 0, 3, '<hr><h1>1<h1><p>浸泡粿條於溫水中至軟 約20分鐘<p> <hr><h1>2<h1><p>備料- 豆腐切塊、去蝦殼及腸泥/雞肉切片、洋蔥切絲<p> <hr><h1>3<h1><p>倒入適量油熱鍋 加入豆腐煎至金黃<p> <hr><h1>4<h1><p>依序加入洋蔥（炒至軟）、蝦/雞肉（炒至半熟）、粿條及適量水（燜煮至熟）<p> <hr><h1>5<h1><p>蛋打至另一個鍋 炒至熟透 再加入步驟4<p> <hr><h1>6<h1><p>炒勻 加入調味料：魚露、糖<p> <hr><h1>7<h1><p>加入豆芽菜及韭菜 起鍋<p> <hr>\']', 'g、盒、顆、包、適量、顆、包、大匙、大匙、適量、顆、適量、小匙、小匙'),
(521, '泰式牛肉乾', '牛肉、魚露、醬油、糖、芫荽籽粉、鹽', '約1、4、2、4、2、1', '521.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 3, '<hr><h1>1<h1><p>牛肉逆紋切成條狀（約手指的粗度）有點肥的牛肉特別好吃，加入所有醃料，用手拌勻讓牛肉吸收醃料<p> <hr><h1>2<h1><p>將牛肉條放在烤網上，每一條留有空間，不要疊在一起，可用2-3個烤網同時放入焗爐烤<p> <hr><h1>3<h1><p>放入焗爐以低溫烘最少5小時以上，如有風扇功能請一同開啟能加速烘乾時間，我的焗爐調了70度，烘了五小時，可中途取出，用手指測試夠不夠乾身，如按下是軟的，就要繼續烘，不要以高溫把牛肉烤熟，只要一點點溫度模擬太陽曬的狀態<p> <hr><h1>4<h1><p>曬乾後，可以存放雪櫃分次食用，食之前不用解凍，直接煎/炸香<p> <hr><h1>5<h1><p>完成<p> <hr>\']', '公斤、匙、匙、匙、匙、匙'),
(522, '日式牛肉烏龍麵', '洋蔥、火鍋牛肉片、小松菜、蛋、海苔、烏龍麵、鰹魚高湯、醬油、味精、清酒', '1/2、1/2、1/2、一、兩、一、700、一、一、一', '522.png', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>洋蔥切條，小松菜切掉根部洗淨。<p> <hr><h1>2<h1><p>水煮沸，加入鰹魚粉煮成鰹魚高湯，取600cc備用。(一小匙搭配600cc的水）<p> <hr><h1>3<h1><p>用剩餘的高湯將小松菜燙熟約3分鐘，取出備用。再放入雞蛋，煮約7-9分鐘，盛起沖冷水降溫。<p> <hr><h1>4<h1><p>熱平底鍋，加點油，炒香洋蔥，加入牛肉片，炒至肉70%熟，先將肉盛起。<p> <hr><h1>5<h1><p>加入600cc高湯，加入醬油、味?和料酒，煮沸。<p> <hr><h1>6<h1><p>加入烏龍麵，煮至想要的熟度，一般約3-5分。再加入牛肉片煮至全熟。<p> <hr><h1>7<h1><p>將麵先盛入碗中，放上牛肉片、撥好切半的半熟蛋、小松菜和切碎的海苔，加入湯汁，上菜。<p> <hr>\']', '顆、份、包、顆、片、包、mL、大匙、大匙、大匙'),
(523, '日式燒肉丼', '醬油、味霖、清酒、蘋果、薑、蒜頭、柴魚、白芝麻、糖、白胡椒、牛小排', '約6、約4、約4、約1/4、約10、約2、約一、約一、約4、約1、約2', '523.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 4, '<hr><h1>1<h1><p>準備材料，也可以加水梨，把蘋果、薑、蒜磨成泥或打成泥，或切末<p> <hr><h1>2<h1><p>把除了白芝麻和柴魚其他都加到鍋子裡可以加點水，煮滾後關火再放入柴魚和白芝麻，或是只煮滾味霖加清酒再加入其他東西<p> <hr><h1>3<h1><p>醬汁放涼後，倒一些來醃肉，大概1個小時以上就可以<p> <hr><h1>4<h1><p>用碳火烤最好??但也可以用煎的或是180度氣炸鍋烤3-5分鐘<p> <hr><h1>5<h1><p>盛一碗飯鋪上滿滿的肉淋上一些醬汁，灑上蔥花，完成<p> <hr>\']', '匙、匙、匙、顆、g、瓣、小把、小匙、匙、匙、人份'),
(524, '東京起士蛋糕佐日式乳酪條', '奇福餅乾、無鹽奶油、烤模、奶油乳酪、砂糖、室溫雞蛋、雞蛋、優格、無鹽奶油、香草精、巧克力', '144、72、1、336、60、2、3、36、36、5、15', '524.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 1, 1, 0, 4, '<hr><h1>1<h1><p>烤模底部包覆1層烘焙紙\\n餅乾放入塑膠袋中,用?麵棍敲打?壓成粉碎狀\\n無鹽奶油隔熱水融化成液狀，倒入餅乾碎中混合均勻再將餅乾碎均勻壓在烤模底部,用力壓緊最後放進冰箱冷藏30分鐘冰硬備用。<p> <hr><h1>2<h1><p>烤箱預熱至150度c再將恢復室溫的奶油乳酪+無鹽奶油用打蛋器打成乳霜狀<p> <hr><h1>3<h1><p>加入細砂糖攪拌均勻後再將打散的蛋液及蛋黃分次加入攪拌均勻再依序將原味優格及香草精加入奶油乳酪中攪拌均勻(每一次都要攪拌均勻才加下一樣)<p> <hr><h1>4<h1><p>塊狀巧克力切碎使用隔水加溫融化，加入1茶匙的乳酪糊混合均勻,狀入塑膠袋中\\n（巧克力融化的溫度要控制好，若太稠可以多加一點乳酪糊調整）<p> <hr><h1>5<h1><p>完成的乳酪糊倒入模子中再將巧克力乳酪糊用塑膠袋裝好，前端剪一個小洞<p> <hr><h1>6<h1><p>在乳酪糊表面左右淋灑出線狀條紋<p> <hr><h1>7<h1><p>用竹籤垂直線狀條紋來回劃直線做出花紋<p> <hr><h1>8<h1><p>放入已經預熱到150度c的烤箱中烘烤20分鐘,然後將溫度調整成為120度c烘烤25分鐘即可\\n出爐完全涼透放冰箱冷藏<p> <hr><h1>9<h1><p>可放至冷凍，切好條狀後要包裝比較好包裝<p> <hr><h1>10<h1><p>此照為東京no.1起士蛋糕，與日式乳酪條的口感比較，起士蛋糕的口感較綿密、起士味道較濃郁\\n，兩者都屬重乳酪蛋糕也都好吃??喜歡吃乳酪蛋糕的人兩款都可以嘗試做做看！包裝起來送人也非常適合喔！<p> <hr>\']', 'g、g、個、g、g、個、個、g、g、cc、g'),
(525, '生吐司', '鹽、糖、奶粉、鮮奶油、鮮奶、水、優格、高筋麵粉、速發酵母', '3、20~30、15、100、40、40、40、250、3', '525.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 4, '<hr><h1>1<h1><p>食材「依序」加入打麵機（或手揉皆可），打約20分至有薄膜<p> <hr><h1>2<h1><p>噴水蓋布，發酵60分鐘<p> <hr><h1>3<h1><p>將麵糰等分成三份，整圓、噴水、蓋布，鬆弛15分鐘<p> <hr><h1>4<h1><p>將麵團?成長條，捲向自己，收口捏平。再重複一次。<p> <hr><h1>5<h1><p>將三個麵團放入吐司模，噴水、蓋布，發酵60分鐘至九分滿<p> <hr><h1>6<h1><p>烤箱預熱180度，烤約29分40秒（視每台烤箱情況而定，我的是日立水波爐） ＊第十分鐘快速開箱蓋上錫箔紙，以防表面過黑）<p> <hr><h1>7<h1><p>出爐倒出吐司放涼（至少1.5小時）即可享用牽絲的生吐司嚕 ＊最佳狀態是麵包不切，放入袋中密封好，放約四小時最好吃，邊邊非常軟喔）<p> <hr>\']', 'g、g、g、g、g、g、g、g、g'),
(526, '日式蕎麥麵', '昆布醬油、蕎麥麵、雞胸肉、雞蛋、海苔', '少許、2、1、2、數片', '526.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p><p> <hr><h1>2<h1><p>炎熱的夏天，是很適合吃蕎麥麵的月份<p> <hr><h1>3<h1><p>準備好食材，準備開始囉<p> <hr><h1>4<h1><p>洋蔥切絲<p> <hr><h1>5<h1><p>海苔剪絲，這邊因為不是商業用，也不用買一大包海苔絲那種，可以買家人們愛吃的海苔，沒用完的也可以當零嘴唷<p> <hr><h1>6<h1><p>打個蛋八!增加蛋白質攝取量<p> <hr><h1>7<h1><p>可以用烤箱烤個香魚，增加主食豐富性，補充蛋白質營養均衡<p> <hr><h1>8<h1><p><p> <hr><h1>9<h1><p>煮蕎麥麵時間<p> <hr><h1>10<h1><p><p> <hr><h1>11<h1><p>煮麵時間旁邊就間個蛋八<p> <hr><h1>12<h1><p>蕎麥麵煮完過個冰水一下<p> <hr><h1>13<h1><p>完成!!!<p> <hr><h1>14<h1><p><p> <hr><h1>15<h1><p><p> <hr>\']', '少許、把、塊、顆、數片'),
(527, '日式高麗菜捲', '高麗菜葉、牛絞肉、鹽、黑胡椒粉、薑末、太白粉、水、鹽、白胡椒粉、太白粉、牙籤', '6、350、1、1、1/2、1、5、1/2、少許、1、6', '527.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>取下整片高麗菜葉後，洗淨放入微波爐微波 3 - 4 分鐘讓菜葉變軟，取出待涼<p> <hr><h1>2<h1><p>高麗菜梗比較硬，因此用刀子把硬梗去除，讓菜柔軟可以捲<p> <hr><h1>3<h1><p>絞肉加入鹽，黑胡椒粉，薑末跟太白粉拌勻醃漬 10 -20 分鐘<p> <hr><h1>4<h1><p>取出一片高麗菜葉，把等份的絞肉放上去捲起來，用牙籤固定<p> <hr><h1>5<h1><p>牙籤固定方式<p> <hr><h1>6<h1><p>全部捲好的高麗菜捲先放一旁<p> <hr><h1>7<h1><p>取出平底鍋，放入高麗菜捲，加入水，鹽，白胡椒粉，蓋上蓋子蒸煎時間約 15 分鐘左右，確認絞肉熟了之後，再放入太白粉水勾芡即可<p> <hr>\']', '片、g、tsp、tsp、tsp、tbsp、tbsp、tsp、少許、tbsp、根'),
(528, '日式滑蛋嫩雞親子丼', '海苔、薄鹽醬油、味醂、七味粉、鮮味炒手、青蔥、洋蔥、雞胸肉、鮭魚、雞蛋、鴻喜菇', '1、1、1、1、1、1、1、2、1、3、1', '528.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>準備好配料<p> <hr><h1>2<h1><p>準備好食材<p> <hr><h1>3<h1><p>洋蔥不用切太薄<p> <hr><h1>4<h1><p>處理鴻喜菇<p> <hr><h1>5<h1><p>青蔥綠色切段再切絲<p> <hr><h1>6<h1><p>青蔥白色部分之後與洋蔥一起當基底煮<p> <hr><h1>7<h1><p>泡冰水的細絲<p> <hr><h1>8<h1><p>撒上鹽巴按摩的鮭魚，靜置10分鐘。<p> <hr><h1>9<h1><p>舒肥雞胸肉，冰凍切就比較俐落<p> <hr><h1>10<h1><p>3顆雞蛋打散<p> <hr><h1>11<h1><p>調製丼飯的醬汁比例<p> <hr><h1>12<h1><p>白開水-2匙先味炒手-醬油-味醂<p> <hr><h1>13<h1><p>煮到變色<p> <hr><h1>14<h1><p>烤鮭魚，不用另外加油沒問題<p> <hr><h1>15<h1><p>用小烤箱的全魚模式，烤出來比較濕潤，\\n喜歡吃比較乾的朋友們，\\n可以用烤魚乾的模式。<p> <hr><h1>16<h1><p><p> <hr><h1>17<h1><p>如果怕熱量太高的朋友們，\\n可以將白米飯換成\\n五穀紫米+花椰菜米，\\n這樣熱量就可以降低許多了唷<p> <hr><h1>18<h1><p>燈冷~~~~\\n完成!!是不是很美味壓\\n海苔可以買喜歡的品牌，剪成一絲一絲鋪上。<p> <hr><h1>19<h1><p><p> <hr><h1>20<h1><p><p> <hr><h1>21<h1><p><p> <hr><h1>22<h1><p><p> <hr>\']', '包、罐、罐、罐、罐、把、顆、塊、塊、顆、包'),
(529, '日式醬煮茄子', '薑末、蒜末、蔥末、羅勒葉、茄子、食用油、醬油、味霖、芝麻油、水、鹽', '1、1、少許、3、2 、1、1、1/2、1、3、1', '529.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>茄子先切斜紋再對半切，切完的茄子泡入鹽水避免氧化變色。熱鍋加入食用油，爆香薑末與蒜末。<p> <hr><h1>2<h1><p>把茄子的皮朝下入鍋，先用油煎茄子皮定色。<p> <hr><h1>3<h1><p>確認茄子皮定色後，加入醬汁煮，稍微翻一下讓茄子入味，最後加入新鮮羅勒葉增加香氣，上桌前再灑上蔥末。<p> <hr>\']', 'tsp、tsp、少許、片、根、tbsp、tbsp、tbsp、tsp、tbsp、tsp'),
(530, '日式紫蘇秋葵', '秋葵、紫蘇葉、酒、味霖、醬油、昆布柴魚高湯', '70、2、1、1/2、1/2、20', '530.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>秋葵灑鹽(分量外)搓揉沖洗瀝乾斜切,紫蘇葉切絲備用.<p> <hr><h1>2<h1><p>取小鍋子,倒入酒,味霖及醬油煮滾出香氣,續倒入昆布柴魚高湯.<p> <hr><h1>3<h1><p>再滾,放入步驟1的秋葵,邊拌邊加熱煮至收乾,起鍋前撒步驟1的紫蘇攪拌即可.<p> <hr>\']', 'g、張、小匙、小匙、小匙、cc'),
(531, '日式半月燒', '鬆餅粉、蛋、紅豆、砂糖、奶油、宇治抹茶粉、砂糖、糯米粉、牛奶、奶油', '1、1、2、酌量、酌量、2、酌量、酌量、酌量、酌量', '531.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>紅豆泡水一整天，隔日用水中小火慢慢熬煮，煮到差不多軟綿的狀態。<p> <hr><h1>2<h1><p>加人砂糖、奶油（一點點就好）繼續拌均勻慢慢收汁成照片狀態。\\n\\n抹茶醬：將牛奶、抹茶粉倒入鍋中小火煮並和勻，加入糯米粉、砂糖一起攪拌。<p> <hr><h1>3<h1><p>把trader joe’s的ube mochi pancake mix（紫薯鬆餅粉）加蛋、水和勻，倒一湯勺滿至鍋中製作餅皮（速度要快，表皮容易顏色過深）<p> <hr><h1>4<h1><p>用餅皮包兩種內餡，完成了！????<p> <hr><h1>5<h1><p>在超市買的紅豆、和家裡現成的抹茶粉，熬煮的兩款內餡，做成了半月燒！\\n\\n（沒有做兩片合起來的銅鑼燒是因為想每次吃一口塞，份量比較小好入口，就做成了半月的形狀）<p> <hr><h1>6<h1><p>做出來完成品真的很漂亮，裝成盒送朋友也很討喜～<p> <hr>\']', '包、顆、人份、酌量、酌量、人份、酌量、酌量、酌量、酌量'),
(532, '日式烏龍沾麵', '市售烏龍麵、柴魚醬油、紫蘇梅、味霖、蔥花、山葵、柴魚片、昆布、水', '2、適量、2、少許、少許、適量、15、1、約兩', '532.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>首先燒一鍋熱水\\n烏龍麵下鍋燙熟後冰鎮<p> <hr><h1>2<h1><p>有冰鎮過口感較Q彈\\n冰好撈起備用<p> <hr><h1>3<h1><p>將柴魚湯的材料煮滾小火兩分鐘\\n\\n※沒有材料可以燒一鍋水加鰹魚粉<p> <hr><h1>4<h1><p>過濾掉昆布及柴魚後冰鎮<p> <hr><h1>5<h1><p>紫蘇梅切碎備用<p> <hr><h1>6<h1><p>冰鎮好再加入柴魚醬油、味霖及紫蘇梅碎\\n比例大約一小碗高湯加3~4瓶蓋柴魚醬油及1瓶蓋味霖即可<p> <hr><h1>7<h1><p>依喜好加入磨碎山葵\\n亦可用市售山葵醬<p> <hr><h1>8<h1><p>麵條灑一點海帶絲配色\\n醬汁灑一點蔥花就完成囉<p> <hr><h1>9<h1><p>冰冰涼涼的烏龍麵配上有點嗆的柴魚醬汁\\n再配上啤酒夏天最高享受<p> <hr>\']', '球、適量、顆、少許、少許、適量、g、小片、碗'),
(533, '牛丼', '洋蔥 （切薄片）、牛肉片（火鍋薄片）、蒜蓉、薑蓉、日式高湯、醬油、清酒、味醂、糖、白飯、蔥（伴碟）', '1、250、1、1、150、2、1、1、1、兩、適量', '533.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 1, 0, 0, 4, '<hr><h1>1<h1><p>備料。洋蔥順紋切絲，薑磨蓉，蒜切碎。將高湯、清酒、味醂、醬油和糖混合。<p> <hr><h1>2<h1><p>將洋蔥下鍋，用少量油炒直到洋蔥輕微焦糖化。<p> <hr><h1>3<h1><p>例入加入湯汁，用中火煮約5分鐘。<p> <hr><h1>4<h1><p>加入生薑及蒜蓉，煮約一分鐘。然後加入牛肉，大約5分鐘後牛肉應該已經煮熟，汁也會變得香濃。\\n\\n這時候可以試試味，有需要可加鹽/糖調整。\\n\\n（又忘了拍牛肉的照片啦）<p> <hr><h1>5<h1><p>準備熱熱騰騰的米飯，然後上蓋多汁的牛肉及洋蔥。 灑一點青蔥就可以上菜了。<p> <hr>\']', '個、克、茶匙、茶匙、毫升、湯匙、湯匙、湯匙、茶匙、碗、適量'),
(534, '日式食蔬咖哩飯', '洋蔥、紅蘿蔔、馬鈴薯、美白菇、雞胸肉、XO醬、玉米筍、花椰菜、雞蛋、咖哩塊', '一、一、三、一、一、二、一、一、一、4', '534.png', 'https://icook.tw/recipes/', 1, 1, 0, 0, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>紅蘿蔔，馬鈴薯，洋蔥切塊\\n雞胸肉切斜刀塊\\n美白菇去蒂頭，洗淨瀝乾\\n竹輪，幾片，裝飾用<p> <hr><h1>2<h1><p>紅蘿蔔不易軟爛，先下水煮<p> <hr><h1>3<h1><p>雞丁先下鍋炒白<p> <hr><h1>4<h1><p>洋蔥塊下鍋炒香，加馬鈴薯\\n倒入紅蘿蔔鍋中一起煮<p> <hr><h1>5<h1><p>中小火，先煮20分軟化<p> <hr><h1>6<h1><p>加入咖哩塊熬煮\\n喜歡綿密口感煮半小時\\n習歡咬感的，拿筷子搓馬鈴薯\\n如果能穿過就可以<p> <hr><h1>7<h1><p>玉米筍和花椰菜下滾水燙熟<p> <hr><h1>8<h1><p>煎蛋，蔬菜擺盤，完成<p> <hr>\']', '個、個、個、包、個、大匙、份、個、個、個'),
(535, '日式雞肉親子丼', '去骨雞腿排、雞蛋、洋蔥、蔥、白飯 、醬油、七味粉、柴魚高湯、味醂、醬油、米酒、味醂', '1、2、1、適量、2、2、適量、4、2、2、2、2', '535.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>首先處理食材：將洋蔥切絲、雞腿肉去皮後切成小塊<p> <hr><h1>2<h1><p>將雞腿肉以醃料(醬油 2大匙、味醂 2大匙、米酒 2大匙) 醃漬10分鐘讓雞腿肉入味<p> <hr><h1>3<h1><p>熱鍋不加油，直接將雞皮煸出雞油後取出雞皮丟棄<p> <hr><h1>4<h1><p>鍋中加入一點橄欖油，加入洋蔥炒至半透明後加入雞肉拌炒，接著加入調味料(醬油 2大匙、味醂 2大匙、柴魚高湯 4大匙)將雞肉煨煮至熟<p> <hr><h1>5<h1><p>打兩顆蛋並攪拌均勻，先倒入一半的蛋液至鍋內，待鍋中蛋液熟成後(8分熟即可)關閉爐火，再倒入剩下一半的蛋液並蓋上鍋蓋燜15秒後即可盛盤(2次下蛋液都要記得攪拌)<p> <hr><h1>6<h1><p>盛上一碗飯，鋪上香噴噴的雞肉，最後撒上七味粉，超好吃又難以抗拒的日式雞肉親子丼就這樣完成囉！自己動手做，健康又快樂！<p> <hr>\']', '片、顆、顆、適量、碗、大匙、適量、大匙、大匙、大匙、大匙、大匙'),
(536, '韭黃炒味噌烏龍麵', '韭黃、紅蘿蔔絲、豬梅花肉絲、蘑菇、玉米筍、急凍熟烏龍麵、雞高湯、減鹽味噌、白味噌、醬油、米酒', '半、半、一、7、8、2、50、1、2/3、一、一', '536.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 0, 0, 4, '<hr><h1>1<h1><p>肉絲用醃料先醃製10至15分鐘，等待的同時將食材洗淨並切好，味噌和雞高湯可先攪拌均勻。<p> <hr><h1>2<h1><p>起油鍋，先將紅蘿蔔絲炒軟。<p> <hr><h1>3<h1><p>加入蘑菇，炒至香氣出來。<p> <hr><h1>4<h1><p>再加入豬梅花肉絲，此時可轉成中小火，預防沾鍋。豬肉絲一定要炒熟喔！<p> <hr><h1>5<h1><p>確定豬梅花肉絲炒熟後加入玉米筍，繼續拌炒。<p> <hr><h1>6<h1><p>接下來就可加入烏龍麵，並將攪拌好的味增及雞高湯倒入鍋內，並加上約100c.c左右的飲用水，即可蓋上鍋蓋煮約8分鐘(這邊可以看個人對麵體的要求，依個人喜好自行調整時間)<p> <hr><h1>7<h1><p>掀開鍋蓋就可將韭黃加入拌炒個兩分鐘。(韭黃很容易熟)<p> <hr><h1>8<h1><p>最後加上蔥花就可關火，完成。<p> <hr>\']', '包、根、盒、朵、根、塊、cc、大匙、匙、小匙、小匙'),
(537, '日式親子燒', '雞胸肉、雞蛋、洋蔥、鴻喜菇、糙米飯、味噌湯、柴魚片、醬油、黑胡椒', '一、一、一、半、一、一、一、適量、少許裝飾就好', '537.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>備料-\\n\\n1.雞胸肉切丁\\n2.洋蔥切絲\\n3.菇洗淨<p> <hr><h1>2<h1><p>開伙-\\n\\n1.熱油鍋下洋蔥炒至金黃微軟爛\\n2.下雞肉丁炒至表面熟透\\n3.下菇菇炒至雞肉表面微金黃\\n4.入醬油與淹至炒料1/2的水（醬油視鹹度調整），蓋鍋蓋悶至雞肉全熟\\n5.打散雞蛋，迅速倒入鍋中，蓋上鍋蓋數10秒後熄火。<p> <hr><h1>3<h1><p>上菜-\\n\\n1.熄火後再數10-15秒，雞蛋微熟，盛盤。\\n2.盛一碗飯，煮味噌湯，溫暖上菜 。<p> <hr>\']', '片、顆、小顆、包、碗、碗、把、適量、少許裝飾就好'),
(538, '香腸玉子燒', '雞蛋、熟香腸、蔥、柴魚醬油、胡椒粉', '2、1、1、1、少許', '538.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>熟香腸對切再切片，雞蛋打入碗中，加入柴魚醬油和1大匙冷開水，蔥切成蔥花加入蛋汁中，撒點胡椒粉，打散<p> <hr><h1>2<h1><p>鍋燒熱後刷點油，倒入蛋汁，然後鋪上香腸片<p> <hr><h1>3<h1><p>接著把上面的蛋往下蓋住香腸，然後往前推，翻個面<p> <hr><h1>4<h1><p>再煎一下下即可起鍋，切片裝盤，完成<p> <hr>\']', '個、根、支、小匙、少許'),
(539, '免揉日式咖喱麵包', '麵粉、酵母粉、鹽、糖、蛋、溫牛奶、橄欖油、洋蔥、波蘭香腸、馬鈴薯、紅蘿蔔、玉米、奶油、麵粉、咖哩醬、糖、牛奶', '2?、3、1/4、2、1、1、1、1/2、1、1/4、1/4、1/4、1、2、3、2、1/2', '539.png', 'https://icook.tw/recipes/', 0, 1, 0, 0, 0, 0, 1, 0, 4, '<hr><h1>1<h1><p>將麵粉、糖、酵母粉、鹽、蛋、橄欖油、溫牛奶全部放入攪拌盆中，用刮到攪拌均勻成麵團。<p> <hr><h1>2<h1><p>在攪拌盆上方蓋上保鮮膜和毛巾，進行第一次室溫發酵1~2小時，膨脹至兩倍大。<p> <hr><h1>3<h1><p>將洋蔥和香腸切丁後，放入鍋中和奶油一起炒香。<p> <hr><h1>4<h1><p>加入馬鈴薯、紅蘿蔔、玉米，一起拌炒2~3分鐘。<p> <hr><h1>5<h1><p>麵粉、牛頭牌咖哩醬、糖、牛奶加入，拌炒2~3分鐘後熄火，放涼備用。<p> <hr><h1>6<h1><p>將發酵完成的麵糰分割成８份，每一份都滾成圓球狀。<p> <hr><h1>7<h1><p>將每一份麵糰中都包入咖哩餡料。<p> <hr><h1>8<h1><p>將每一顆包好的麵包放入蛋液中，然後外層裹上麵包粉。<p> <hr><h1>9<h1><p>將麵糰放入氣炸鍋(烤箱)，以355°F/180°C 氣炸 12分鐘(烤箱需要20分鐘)。<p> <hr><h1>10<h1><p>將表皮烤成金黃色的麵包放涼後就可以吃啦！<p> <hr>\']', '杯、茶匙、茶匙、大匙、顆、杯、大匙、顆、杯、杯、杯、杯、大匙、大匙、大匙、大匙、杯'),
(540, '日式米漢堡', '白飯、生菜、番茄、牛奶、麵包粉、洋蔥、牛絞肉、鹽、蛋、牛頭牌沙茶醬、奶油、蘑菇、黑胡椒、糖、牛頭牌咖哩炒醬', '4、數片、數片、1/4、1/2、1/2、400、1/2、1、1、1、10、1、1、2', '540.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>牛奶倒入麵包粉中，靜置5分鐘讓麵包粉吸收水分。<p> <hr><h1>2<h1><p>將洋蔥切碎後炒至焦糖化，變成金黃色後取出。<p> <hr><h1>3<h1><p>牛絞肉、洋蔥、鹽、蛋、麵包粉、牛奶全部攪拌在一起。<p> <hr><h1>4<h1><p>加入一匙牛頭牌沙茶醬，用筷子快速攪拌3分鐘，直到肉變黏稠。<p> <hr><h1>5<h1><p>做好的漢堡肉捏成肉餅的形狀，放入平底，以小火鍋煎至兩面金黃。<p> <hr><h1>6<h1><p>奶油放入平底鍋中融化，放入切好的蘑菇片。<p> <hr><h1>7<h1><p>加入牛頭牌咖哩炒醬、糖、黑胡椒，拌炒1分鐘後就完成了。<p> <hr><h1>8<h1><p>保鮮膜上撒一點水，放上1/2杯煮熟的白飯，捏塑成漢堡麵包形狀。<p> <hr><h1>9<h1><p>將白飯麵包放入氣炸鍋中，噴上一層油，氣炸(煎)10分鐘至表面金黃。(此步驟也可以改用平底鍋煎至米飯兩面金黃)<p> <hr><h1>10<h1><p>將米麵包、生菜、番茄、漢堡肉、蘑菇醬組裝在一起，米漢堡就完成囉！<p> <hr>\']', '杯、數片、數片、杯、杯、顆、g、茶匙、顆、大匙、大匙、顆、茶匙、大匙、大匙'),
(541, '牛小排日式烏龍麵', '烏龍麵、柴魚片、醬油、牛小排、花椰菜、紅蘿蔔、小乾香菇、雞蛋、鹽巴', '1、適量、適量、2、數朵、1/3、3、1、適量', '541.png', 'https://icook.tw/recipes/', 0, 1, 0, 0, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>牛小排從冰箱拿出，兩面抹鹽，置於室溫等候約10分鐘<p> <hr><h1>2<h1><p>花椰菜洗淨、切小朵，紅蘿蔔削皮切片<p> <hr><h1>3<h1><p>製作烏龍麵醬汁：柴魚用熱水泡開成為高湯，以一匙高湯和適量醬油混合作為醬汁（鹹度可自行調整）<p> <hr><h1>4<h1><p>滾水中放入烏龍麵煮至Q彈，順便丟入香菇煮軟後撈起<p> <hr><h1>5<h1><p>熱鍋少許油將牛小排煎至喜歡的熟度，起鍋後置於盤中先不切開。（等候3-5分鐘再切）<p> <hr><h1>6<h1><p>同鍋將紅蘿蔔片、花椰菜炒熟。（花椰菜也可以用燙的）<p> <hr><h1>7<h1><p>烏龍麵與醬汁混合後依序擺上材料即可。<p> <hr>\']', '人份、適量、適量、小片、數朵、根、朵、顆、適量'),
(542, '沖繩塔可飯', '牛絞肉、洋蔥、美生菜、小番茄、起司絲、蛋、米、蕃茄醬、辣椒醬', '400、1、1/4、13、適量、2、1、適量、適量', '542.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>完整詳細作法可參考影音食譜：https://user91066.pics.ee/UXSBP<p> <hr><h1>2<h1><p>準備食材，開始其他動作前先把米洗好放下去煮。<p> <hr><h1>3<h1><p>洋蔥切細末<p> <hr><h1>4<h1><p>美生菜切細絲<p> <hr><h1>5<h1><p>小番茄切對半<p> <hr><h1>6<h1><p>來炒肉醬，熱油鍋後先放洋蔥<p> <hr><h1>7<h1><p>中火炒到洋蔥呈焦糖色<p> <hr><h1>8<h1><p>把洋蔥撥到邊邊，下絞肉，絞肉盡量鋪平後先不翻動，煎出一點焦香<p> <hr><h1>9<h1><p>將絞肉跟洋蔥翻炒均勻<p> <hr><h1>10<h1><p>加入蕃茄醬與辣椒醬或任何其他喜歡的醬料。因為塔可飯本來就是混搭料理，重點是這些食材搭配起來很好吃，肉醬我就不做太複雜的調味。<p> <hr><h1>11<h1><p>醬料拌炒均勻後可以試吃看看，不夠鹹的話再放點鹽巴。<p> <hr><h1>12<h1><p>小火上蓋稍微燜5分鐘，讓醬料更入味<p> <hr><h1>13<h1><p>簡單的肉醬就完成了！<p> <hr><h1>14<h1><p>換平底鍋來煎太陽蛋，中火熱油鍋後打入兩顆蛋。一定要熱了再打才會漂亮喔！<p> <hr><h1>15<h1><p>油夠熱的話，蛋下去會有滋滋聲，蛋白會開始冒泡泡，很快就能看到邊邊有微微的焦色，用手指搓一點點鹽在蛋上面，然後轉小火上蓋。從頭到尾都不要拿鍋鏟動他們喔。<p> <hr><h1>16<h1><p>可以透過鍋蓋觀察蛋黃熟度，喜歡生一點的話，看到蛋白變不透明就可以起鍋了。我們習慣吃比較熟，就等蛋黃也變白色再起鍋，其實裡面也還沒全熟，會是濕濕的但不會流動的熟度，我自己滿喜歡這個熟度的！<p> <hr><h1>17<h1><p>接著就是組合時間啦！依序擺上白飯、美生菜、肉醬、起司絲、太陽蛋、小番茄。<p> <hr><h1>18<h1><p>家裡有玉米片的話可以搭著吃，還有酸奶也很搭！塔可飯沒有一定的組合，有些人會加莎莎醬，或是做成歐姆蛋、水波蛋，可以依照自己喜好做變化，反正最後這些東西加在一起就會出現好吃魔法！<p> <hr>\']', 'g、顆、顆、顆、適量、顆、杯、適量、適量'),
(543, '日式照燒棒棒腿', '棒棒腿、鹽、胡椒、糖、醬油、味醂、燒酒、蜂蜜', '8、少許、少許、1、2、2、2、1', '543.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>將棒棒腿退冰，撒上胡椒、鹽，醃個10分鐘<p> <hr><h1>2<h1><p>鍋中放點油，有皮的面朝下煎<p> <hr><h1>3<h1><p>煎到兩面為焦黃<p> <hr><h1>4<h1><p>倒入照燒醬汁煮到收汁<p> <hr><h1>5<h1><p>超適合配飯一起吃<p> <hr>\']', '根、少許、少許、大匙、大匙、大匙、大匙、小匙'),
(544, '薑汁燒肉', '洋蔥、薑、豬五花、醬油、水、糖、鹽巴', '1/2、適量、1、少許、適量、少許、少許', '544.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>洋蔥切絲，薑磨成薑泥備用<p> <hr><h1>2<h1><p>起油鍋炒薑泥<p> <hr><h1>3<h1><p>洋蔥炒軟<p> <hr><h1>4<h1><p>放入豬肉<p> <hr><h1>5<h1><p>加少許醬油<p> <hr><h1>6<h1><p>加適量的水<p> <hr><h1>7<h1><p>蓋上鍋蓋悶煮一下<p> <hr><h1>8<h1><p>鹽巴調味<p> <hr><h1>9<h1><p>糖調味<p> <hr><h1>10<h1><p>薑燒豬肉完成～～<p> <hr>\']', '顆、適量、盒、少許、適量、少許、少許'),
(545, '大阪燒', '高麗菜、麵粉、蛋、起司條、培根、日式蛋黃醬（美乃滋）、蝦子、水、烹大師柴魚粉、鹽、番茄醬、醬油、醋、味霖、糖、味增、蘋果泥', '少許、50、1、少許、2、少許、5-6、100、少許、少許、80、30、15、30、15、15、30', '545.png', 'https://icook.tw/recipes/', 0, 1, 1, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>先將烹大師放入水裡製作高湯<p> <hr><h1>2<h1><p>高麗菜洗過並切成小段<p> <hr><h1>3<h1><p>將麵粉放入高湯拌勻<p> <hr><h1>4<h1><p>加入鹽、蛋拌勻<p> <hr><h1>5<h1><p>將蝦子去殼、去腸泥後，切成絞肉，放入麵糊<p> <hr><h1>6<h1><p>將起司條拌入麵糊<p> <hr><h1>7<h1><p>加入切好的高麗菜拌勻<p> <hr><h1>8<h1><p>平底鍋放入少許油，加入麵糊，並鋪上切好的培根。總共煎9分鐘，第一面煎三分鐘後，翻面煎3分鐘，最後再翻面一次煎三分鐘<p> <hr><h1>9<h1><p>煎的時候一邊製作豬排醬：將所有醬料混合，另放入一個鍋子，煮滾5分鐘後，加入太白粉水勾芡，即完成起鍋。<p> <hr><h1>10<h1><p>將豬排醬淋在煎好的大阪燒上，再淋上蛋黃醬<p> <hr>\']', '少許、g、顆、少許、片、少許、隻、ml、少許、少許、ml、ml、ml、ml、g、g、g'),
(546, '壽喜燒涮涮鍋', '清酒、味醂、昆布醬油、昆布/鰹魚湯、牛油、砂糖、肥牛、豆腐、蒟蒻、金菇、娃娃菜、蛋、洋蔥、京蔥', '60、60、60、100、適量、1-2、適量、適量、適量、適量、適量、適量、適量、適量', '546.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>洗淨食材，洗淨和切好大小待用。<p> <hr><h1>2<h1><p>牛油開鍋。<p> <hr><h1>3<h1><p>炒香洋蔥、京蔥，然後加入湯底，再放入其他非肉類食材。<p> <hr><h1>4<h1><p>最後放入牛肉，上菜時可以再加蛋。<p> <hr>\']', '毫升、毫升、毫升、毫升、適量、茶匙、適量、適量、適量、適量、適量、適量、適量、適量'),
(547, '溫泉蛋牛肉飯', '肥牛、洋蔥、米飯、蛋、日式昆布/鰹魚醬油、味醂、糖、水/鰹魚湯、油、蔥花、芝麻', '300、1、2、1、4、2、0.5-1、50、適量、適量、適量', '547.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 4, '<hr><h1>1<h1><p>肥牛放室溫待用。<p> <hr><h1>2<h1><p>米飯煮好待用。<p> <hr><h1>3<h1><p>洋蔥切絲待用。<p> <hr><h1>4<h1><p>下油開鍋，加洋蔥炒熟至變軟。<p> <hr><h1>5<h1><p>用另一個鍋子煮蛋，水滾後煮約5-6分鐘。（可參考溫泉蛋圖）<p> <hr><h1>6<h1><p>洋蔥變軟開始散發甜味，加入所有調味料拌勻。<p> <hr><h1>7<h1><p>平均地加入肥牛。<p> <hr><h1>8<h1><p>煮熟後即可鋪在米飯上上菜了。<p> <hr>\']', '克、個、碗、隻、湯匙、湯匙、湯匙、毫升、適量、適量、適量'),
(548, '照燒金菇肥牛卷', '肥牛、金針菇、料理酒、昆布醬油、味醂、糖', '適量、適量、2、2、2、0.5-1', '548.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 4, '<hr><h1>1<h1><p>金菇切走根部，洗淨，分成小份待用。<p> <hr><h1>2<h1><p>用肥牛把金菇卷起。<p> <hr><h1>3<h1><p>下油開鍋，將金菇肥牛卷開口向下平放。<p> <hr><h1>4<h1><p>用中小火煎1分鐘，並倒入醬汁。<p> <hr><h1>5<h1><p>反轉金菇肥牛卷，再合蓋煎1分鐘。<p> <hr><h1>6<h1><p>1. 喜歡多汁可加一點水。\\n2. 喜歡濃稠可加一點粟粉。<p> <hr>\']', '適量、適量、湯匙、湯匙、湯匙、湯匙'),
(549, '姜汁燒肥牛', '肥牛、昆布醬油、味醂、料理酒、薑汁、糖', '適量、2、2、1、1、0.5-1', '549.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 4, '<hr><h1>1<h1><p>肥牛放室溫待用。<p> <hr><h1>2<h1><p>用工具將薑磨成茸及磨出薑汁。<p> <hr><h1>3<h1><p>用工具將薑磨成茸及磨出薑汁。<p> <hr><h1>4<h1><p>米飯煮好待用。<p> <hr><h1>5<h1><p>洋蔥切絲待用。<p> <hr><h1>6<h1><p>下油開鍋，加洋蔥炒熟至變軟。<p> <hr><h1>7<h1><p>洋蔥變軟開始散發甜味，加入所有調味料拌勻。<p> <hr><h1>8<h1><p>平均地加入肥牛。<p> <hr><h1>9<h1><p>煮熟後即可鋪在米飯上上菜了。<p> <hr>\']', '適量、湯匙、湯匙、湯匙、湯匙、湯匙'),
(550, '牛丼飯', '洋蔥、薑蓉、肥牛、味?、日本醬油、日本清酒、砂糖', '半、一、一、半、小半、半、4', '550.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 0, 1, 1, 0, 4, '<hr><h1>1<h1><p>半個洋蔥切成條狀//洗好薑切皮磨成蓉狀<p> <hr><h1>2<h1><p>落清酒、味?大火煮至滾，再落日式醬油、糖攪拌，落洋蔥煮2-3分鐘至半透明。<p> <hr><h1>3<h1><p>再落肥牛煮2-3分鐘。\\n上碟淋汁即成。<p> <hr>\']', '個、茶匙、盒、碗、碗、碗、茶匙'),
(551, '迷迭香咖哩蛋包飯', '馬鈴薯、紅蘿蔔、咖哩塊、雞胸肉、洋蔥、蛋、飯、迷迭香粒', '3、1、3、200、半、4、兩、少許', '551.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>（咖哩的部分備料）將洋蔥、馬鈴薯、紅蘿蔔、雞胸肉切丁<p> <hr><h1>2<h1><p>雞胸肉用滾水川燙一下避免肉質老。\\n熱鍋加入少許油洋蔥炒香，等洋蔥微軟放入紅蘿蔔、馬鈴薯拌炒。\\n加入水燉煮到紅蘿蔔、馬鈴薯軟。<p> <hr><h1>3<h1><p>等馬鈴薯、紅蘿蔔軟加入佛蒙特咖哩塊邊攪拌，直到咖哩塊融化。（咖哩的部分就完成嘍~）<p> <hr><h1>4<h1><p>把煮好的飯盛到盤子中備用，\\n將2顆蛋打勻（因為是兩人份所以4顆蛋唷），平底鍋抹一點點油\\n倒入一半，轉小火慢慢的煎成蛋皮<p> <hr><h1>5<h1><p>最後將煎好的蛋皮平鋪在飯上，倒入剛煮好的咖哩，最後在撒上迷迭香粒就完成啦~~<p> <hr>\']', '顆、條、小塊、g、顆、顆、人份、少許'),
(552, '日式咖哩湯烏龍', '烏龍麵、橄欖油、豬排骨、紅蘿蔔、洋蔥、玉米筍、蔥花、鰹魚粉、咖哩塊、味淋、水', '1、少許、8、適量、半、四、適量、適量、1、10、1000', '552.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>排骨洗淨、汆燙後備用<p> <hr><h1>2<h1><p>紅蘿蔔切薄片小塊\\n洋蔥切丁\\n玉米筍斜切小塊\\n蔥切蔥花<p> <hr><h1>3<h1><p>少許橄欖油先將排骨、洋蔥、紅蘿蔔、玉米筍炒過，加入少許水煮一下將其煮熟煮軟。\\n加入咖哩塊再一起燉煮至完全融化。<p> <hr><h1>4<h1><p>倒入1000cc水入鍋，加入味淋、鰹魚粉調味，再加入烏龍麵，待煮滾後關火。\\n起鍋後撒上蔥花完成。<p> <hr>\']', '包、少許、小塊、適量、顆、根、適量、適量、小塊、cc、cc'),
(553, '大阪燒', '雞肉、高麗菜、凍豆腐、雞蛋、水、黑胡椒、烹大師', '1、適量、3、3、適量、適量、一', '553.png', 'https://icook.tw/recipes/', 0, 1, 0, 0, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>高麗菜切絲（不用太細<p> <hr><h1>2<h1><p>雞肉切小塊\\n加入黑胡椒.烹大師（不用加鹽）<p> <hr><h1>3<h1><p>加入3顆蛋,凍豆腐切小塊<p> <hr><h1>4<h1><p>將步驟3倒入平底鍋,中火等蛋微微成形<p> <hr><h1>5<h1><p>在倒入高麗菜，之後開大火,如果怕焦，在加些水<p> <hr><h1>6<h1><p>裝盤，加上自己喜歡的醬料或配料<p> <hr>\']', '盒、適量、塊、顆、適量、適量、茶匙'),
(554, '日式章魚燒', '燙過的章魚（或透抽）切塊、高麗菜絲、章魚燒醬、低粉、酥炸粉、鰹魚粉、水、醬油、味醂、牛奶 ( 可省略）', '一些、一、適量、60、40、2、200、一點、少許、20', '554.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>加熱烤盤塗油，倒入五六分麵糊<p> <hr><h1>2<h1><p>投入主角（章魚或是透抽）\\n也可以更換自己想吃的食材<p> <hr><h1>3<h1><p>鋪滿高麗菜，再倒入麵糊<p> <hr><h1>4<h1><p>等到七分熟，劃井線用竹籤轉麵糊整型收口<p> <hr><h1>5<h1><p>淋上章魚燒醬、美奶滋、灑上柴魚片完成<p> <hr>\']', '一些、碗、適量、g、g、g、ml、一點、少許、ml'),
(555, '誠實日式乳酪蛋糕', '奶油乳酪、砂糖、鮮奶油、希臘優格50、奶油、全蛋、低筋麵粉、檸檬汁、香草豆莢 (可省略）', '200、80、120、50、100、2、30、15、1/4', '555.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 0, 0, 4, '<hr><h1>1<h1><p>將奶油乳酪隔熱水放入碗裡，使溫度提升，再與糖放進攪拌盆中充分攪勻均勻。<p> <hr><h1>2<h1><p>將鮮奶油和希臘優格放入另一個碗中，並用橡皮刮刀使之拌勻。<p> <hr><h1>3<h1><p>將雞蛋分成三次逐步添加到步驟（2）裡，每次都要用攪打器充分攪拌均勻。接著加入檸檬汁和低筋麵粉混合。<p> <hr><h1>4<h1><p>奶油放入小鍋中、香草豆莢種子也放入用中火加熱，沸騰後就停止加熱。<p> <hr><h1>5<h1><p>將步驟（4）添加到步驟（1）的材料中，並用攪打器混合。接著加入步驟（3）成品並混合攪拌直至光滑，然後過篩之後，倒入模具中。<p> <hr><h1>6<h1><p>將烤盤加入2-3公分熱水，蛋糕模具以錫箔紙包好完全隔絕水。\\n\\n7. 放入180℃的烤箱中25分鐘，然後將其降溫至150℃再烘烤20分鐘。最後放到冷藏庫冷卻4小時就完成了。<p> <hr>\']', 'g、g、g、g、g、顆、g、g、條'),
(556, '日式照燒雞腿', '去骨雞腿肉、醬油、鰹魚醬油、味霖、糖、清酒(米酒)、昆布、蒜頭、薑', '200、40、40、40、10、80、1、5、5', '556.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>蒜頭、薑磨成末狀<p> <hr><h1>2<h1><p>熱鍋，將照燒醬汁的所有食材放入鍋中燒開，沸騰後轉小火續滾5分鐘，之後觀火放涼<p> <hr><h1>3<h1><p>雞腿肉切條不斷皮<p> <hr><h1>4<h1><p>將切好的雞腿肉與照燒醬汁放如盒中或袋中醃，雞肉務必全部都浸泡到，醃製至少一天時間<p> <hr><h1>5<h1><p>醃好取出雞肉退冰，熱鍋，下少許油，6成熱後雞肉表皮朝下煎，中小火<p> <hr><h1>6<h1><p>表皮成微焦狀翻面，倒入照燒醬汁，開蓋煮滾，煮到收汁即可盛盤完成。<p> <hr>\']', 'g、g、g、g、g、g、小片、g、g'),
(557, '蒲燒鰻魚飯', '鰻魚兩條（已有醬汁）、洋蔥、日本雞蛋、味琳、黑糖、水、日本醬油、薯粉、日本米', '一、一、五、二、一、兩、二、適量、二', '557.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 0, 1, 1, 0, 4, '<hr><h1>1<h1><p>將鰻魚早一晚放到雪櫃解凍，烹飪前半小時拿出來，用水沖洗一下鰻魚，因為上面的醬汁非常鹹，沖水的過程目的也是令到魚吸收適當的水份。<p> <hr><h1>2<h1><p>焗爐盤上先放上焗紙，將二條鰻魚的皮向上，然後放在焗爐盤上。各放一湯匙的味醂，可以令鰻魚更鮮甜。然後上面再?上錫紙，可以保存鰻魚水份。放入焗爐用180度焗10分鐘，然後將鋪面的錫紙取走，再焗2分鐘。<p> <hr><h1>3<h1><p>將洋蔥切條<p> <hr><h1>4<h1><p>將五隻雞蛋打好放少許鹽，加一湯匙味醂。<p> <hr><h1>5<h1><p>下一湯匙油，將洋蔥炒熟，加少許鹽和胡椒粉。<p> <hr><h1>6<h1><p>再加少許油再將蛋漿倒在洋蔥裏略炒，用小火炒約1分鐘後蓋上鑊蓋關火，焗2分鐘。<p> <hr><h1>7<h1><p>焗了2分鐘後的雞蛋變得很滑，取大碗放適當的白飯，然後將蛋鋪在飯面。<p> <hr><h1>8<h1><p>將鰻魚切成一小段一小段，放在飯面上。<p> <hr><h1>9<h1><p>用兩湯匙味醂，二湯匙水，一茶匙日本醬油，一茶匙黑糖，煮成醬汁。可以用半茶匙薯粉收汁。<p> <hr><h1>10<h1><p>將醬汁淋在鰻魚和蛋上，完成了????<p> <hr>\']', '包、個、隻、湯匙、茶匙、湯匙、茶匙、適量、人份'),
(558, '快速親子丼', '唐揚雞炸雞塊、洋蔥、蛋、白飯、醬油、味醂、米酒、鹽、水', '5-6、1/4、1、適量、1、1、0.5、一點點、1.5', '558.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>白飯用隔夜飯或是現煮的都可以\\n炸雞看個人喜歡吃什麼口味的都可以\\n洋蔥切細絲\\n蛋打散\\n醬汁混合均勻<p> <hr><h1>2<h1><p>炸雞先用氣炸鍋200度7分鐘，時間到後拿出來搖一搖翻個面再5分鐘，或是要用烤的、炸得都可以，只是要把炸雞表皮弄出酥脆感<p> <hr><h1>3<h1><p>鍋中放一匙的油後放入洋蔥，用中火炒軟變成有點褐色即可<p> <hr><h1>4<h1><p>倒入醬汁\\n如果有喜歡的青菜也可以放進來一起煨煮\\n但這樣水就要多放點囉<p> <hr><h1>5<h1><p>炸好的雞塊放進來\\n淋上蛋液\\n蓋上鍋蓋燜到收汁（約1-2分鐘）\\n開蓋熄火\\n淋到白飯上\\n完工～<p> <hr>\']', '塊、顆、顆、適量、大匙、大匙、大匙、一點點、大匙'),
(559, '四色丼', '米、薑黃粉、鮭魚、鹽、清酒或米酒、牛絞肉、豬絞肉、洋蔥、醬油：水、冰糖、清酒或米酒、蛋、牛奶、砂糖、四季豆、蒜碎、鹽', '4、一、一、適量、適量、150、150、一、1:1.5、適量、適量、三、20、兩、100、一、一小撮', '559.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 1, 0, 4, '<hr><h1>1<h1><p>《鮭魚鬆》\\n鮭魚兩面抹鹽和清酒\\n放入180-200度烤箱烤熟\\n中間記得翻面\\n熟後用筷子一邊將魚刺挑掉\\n一邊將魚肉撥碎\\n最後將烤盤上的魚油淋上<p> <hr><h1>2<h1><p>《絞肉鬆》\\n洋蔥碎與絞肉炒熟\\n我習慣使用豬牛1:1\\n牛絞肉香氣夠但有點柴\\n豬絞肉油脂夠但不夠香\\n醬油水清酒冰糖加入炒到收汁<p> <hr><h1>3<h1><p>《蛋鬆》\\n的食材攪拌均勻\\n砂糖可用味霖取代\\n中火熱油鍋（不要太熱的狀態就下蛋液）\\n蛋液下去用四五根筷子握在一起\\n不停畫圈不停畫圈\\n鍋子太熱的話 蛋的口感不佳\\n因為加了牛奶\\n黏鍋是正常的\\n不停畫圈到蛋鬆沒有濕潤的感覺\\n就可以離火\\n繼續攪到碎碎的 （手好酸）<p> <hr><h1>4<h1><p>《四季豆》\\n熱水加鹽一撮川燙\\n起鍋過冰水加蒜碎拌勻<p> <hr>\']', '人份、湯匙、片、適量、適量、克、克、顆、1:1.5、適量、適量、顆、克、湯匙、克、湯匙、一小撮'),
(560, '日式炒麵', '洋蔥、紅蘿蔔、高麗菜、五花肉、雞蛋、日式炒麵醬、糖', '半、少許、1/4、100、一、兩、少許', '560.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 0, 1, 1, 0, 4, '<hr><h1>1<h1><p>1.先將油麵用熱水燙過，把油分帶走<p> <hr><h1>2<h1><p>中火，倒入少許油，先將麵煎至金黃色<p> <hr><h1>3<h1><p>煎五花肉，把油逼出來，煎至9分熟，因為之後會再混炒，以免肉過老<p> <hr><h1>4<h1><p>炒紅蘿蔔及洋蔥，洋蔥炒至透明，加入高麗菜，快炒<p> <hr><h1>5<h1><p>將炒好的五花肉倒回鍋內，再將煎好的麵蓋在肉上，倒下炒麵醬，翻鍋快炒，醬汁均勻分布麵條上，即可起鍋<p> <hr><h1>6<h1><p>煎顆半熟蛋，灑上海苔及日式美奶芝即可。<p> <hr>\']', '顆、少許、顆、g、顆、大匙、少許'),
(561, '暖心”牛肉壽喜燒', '洋蔥、杏鮑菇、板豆腐、豆皮（濕）、青蔥、高麗菜、鴻禧菇、玉米筍、雪花牛、壽喜燒醬汁(萬家香）、水、鰹魚粉（烹大師）、醬油、黃砂糖、無鹽奶油', '2、3、1/2、3、3、1/4、1、6、200、400、1200、一、一、5、40', '561.png', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>先將切好塊狀的杏鮑菇/板豆腐/豆皮 ，依序乾煎 雙面皆呈現金黃色即可裝盤配用。<p> <hr><h1>2<h1><p>洋蔥切絲後，加少許油與蔥白段拌炒，表面呈焦糖色後，擺鍋邊緣中間空出來，小火 下無鹽奶油加入牛五花炒出鍋氣（這步驟一定要記得，湯底會香氣十足）<p> <hr><h1>3<h1><p>牛肉炒半熟後撈起，下調配好的醬汁開中火，蔬菜配料與乾煎好的食材依序放入，煮滾後約6分鐘放入牛肉煮熟，準備開動囉！<p> <hr><h1>4<h1><p>大家動手試試看吧！在家也能煮出餐廳的風味唷????<p> <hr>\']', '顆、支、塊、塊、根、個、包、根、g、ml、ml、茶匙、茶匙、g、g'),
(562, '家常天婦羅', '新鮮大香菇、青蔥、秀珍菇、洋蔥、四季豆、糯米茄、金針菇、冷凍大白蝦、去骨雞腿排', '15、1、15、1、1、1、2、1、5', '562.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>備料。麵糊可購買天婦羅用酥炸粉依照比例調水。<p> <hr><h1>2<h1><p>蔬菜 : 新鮮香菇雕花、四季豆頭尾扯去粗纖維、金針菇切去底部有木屑處、青蔥洗淨切長段、洋蔥環切1cm厚、糯米茄斜切1cm寬。<p> <hr><h1>3<h1><p>去骨雞腿肉切塊、以日式燒肉醬醃漬。<p> <hr><h1>4<h1><p>冷凍大白蝦去殼清洗後擦乾。<p> <hr><h1>5<h1><p>食材表面沾上麵糊在下油鍋以180度油炸，鮮香菇可以切去蒂頭。<p> <hr><h1>6<h1><p>利用美繕雅電子溫空油炸機，最低使用油量600cc即可。<p> <hr><h1>7<h1><p>將炸好的天婦羅透過廚房紙巾吸油。<p> <hr><h1>8<h1><p>調配天婦羅醬汁，新鮮白蘿蔔磨成泥後加入柴魚醬油混合即可。<p> <hr><h1>9<h1><p>組合擺盤。<p> <hr><h1>10<h1><p>沾醬食用。<p> <hr><h1>11<h1><p>沾醬食用。<p> <hr><h1>12<h1><p>沾醬食用。<p> <hr>\']', '朵、把、朵、顆、把、條、包、盒、片'),
(563, '廣島燒', '麵粉、水、雞蛋、麵條、肉片、紅蘿蔔、高麗菜', '一、一、2、一、6、數片、適量', '563.png', 'https://icook.tw/recipes/', 0, 1, 0, 0, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>將水、麵粉、雞蛋混合攪勻\\n並將其他食材準備妥當<p> <hr><h1>2<h1><p>起油鍋先加入一瓢麵糊\\n待半熟<p> <hr><h1>3<h1><p>往上鋪陳想吃的食材<p> <hr><h1>4<h1><p>再頂部再淋上一層麵糊<p> <hr><h1>5<h1><p>兩面煎至金黃色<p> <hr><h1>6<h1><p>起鍋後加上海苔片\\n或是美乃芝、柴魚片或醬油膏等調味料\\n美味隨意搭配<p> <hr>\']', '杯、杯、顆、碗、片、數片、適量'),
(564, '一魚兩吃濃郁日式牛蒡魚', '白肉魚( 7分熟)、日式醬油、干貝醬油、玉泉清酒、味霖、辣椒(去籽切成絲)、蔥段(切成絲)、牛蒡(大約8公分)', '1、1、1、1、1、1、1、1', '564.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>冷鍋冷油先把魚片煎到七分熟之後， 鍋中的油大概瀝干剩下1大匙左右， 開始做下一道動作。<p> <hr><h1>2<h1><p>在煎魚的同時順便切一下牛蒡， 其實切法很簡單，大概把8公分的牛蒡先切一半，然後再把這個圓柱立起來之後對切，對切之後看實際的大小，是要切成4分之1或是6分之1，全部切完後，差不多於魚煎好可以進行下一個動作。<p> <hr><h1>3<h1><p>利用鍋中剩下大約1大匙的魚油，把牛蒡快速的煎上色。那因為我剛好前一個料理是在做焦糖香蕉，所以這些鍋子表面焦糖也剛好會黏在牛蒡上，如果很喜歡焦糖顏色的話可以在這個步驟放大約1小匙的二砂糖， 但是魚可能要先拿起來以免煎過熟 。<p> <hr><h1>4<h1><p>差不多間到牛蒡表面有一點稍稍的焦香感，就是表面有一種硬硬的一層膜的感覺，這個時候就差不多可以進行下一個步驟。<p> <hr><h1>5<h1><p>準備調味料:日式醬油、干貝醬油、玉泉清酒及味霖， 比例是1比1比1比1。 當然如果家裡沒有日本醬油或是干貝醬油的話，建議就是可以用一般的醬油稍微加一點鰹魚粉，或者是干貝素這種調味料，讓醬汁有一種魚香味。<p> <hr><h1>6<h1><p>用中大火稍微把醬汁煮滾的狀況之下，不斷的用湯匙淋在牛蒡以及魚片上，可以不斷地吸收這個醬汁。如果火太大的話可以關小一點，或稍微加一點水，讓醬汁持續的滾煮大概兩3分鐘。<p> <hr><h1>7<h1><p>魚煮好之後關火，稍微放在鍋中等一下，讓醬汁也可以慢慢地透過餘溫吸進去的時候，稍微切一下白髮蔥及辣椒絲。\\n白髮蔥盡量就是挑蔥白比較多的部分，然後去除老皮不要，之後順著?的中心直徑大概先切一半，然後再細細的用刀慢慢的順著圓心切，有比較粗的部分再挑出來切成大概0.01公分左右，散開就是白髮蔥。<p> <hr>\']', '片、大匙、大匙、大匙、大匙、支、支、份'),
(565, '日式蕃茄秋葵', '秋葵、蕃茄果肉、蒜碎、辣椒、酒、味霖、味噌(鹽分10%)、昆布柴魚高湯', '6、30、1、1、1、1/2、1/2、30', '565.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 4, '<hr><h1>1<h1><p>秋葵去蒂,斜切三等分,蕃茄果肉切塊備用.<p> <hr><h1>2<h1><p>取小鍋子,放入蒜碎,辣椒,酒,味霖及味噌,味噌溶化後開火煮滾出香氣,續放入步驟1裹調味料.<p> <hr><h1>3<h1><p>倒入昆布柴魚高湯,再滾加蓋轉小火煮至秋葵呈現翠綠感.<p> <hr><h1>4<h1><p>開蓋,邊拌邊加熱收汁即可.<p> <hr>\']', '枝、g、顆分、根、小匙、小匙、小匙、cc'),
(566, '日式關東煮', '白蘿蔔、昆布、魚餅、竹輪、蟹柳、清水、鰹魚粉、日式醬油、味醂、料理酒、砂糖、鹽', '一、40、180、120、六、2、18、6、4、4、3、適量', '566.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>將水煲滾，加入調味料<p> <hr><h1>2<h1><p>蘿蔔切小件<p> <hr><h1>3<h1><p>先將白蘿蔔和昆布放落湯汁，大火滾起後，轉小火煮近兩小時<p> <hr><h1>4<h1><p>加入其他材料煮約半小時，即成<p> <hr>\']', '條、g、g、g、條、L、g、湯匙、湯匙、湯匙、湯匙、適量'),
(567, '日式胡麻味噌涼拌', '胡蘿蔔、小松菜or菠菜、金針菇、油豆腐(可加可不加)、白芝麻、醬油、味淋、味噌', '10、1、50、6、6、1、2、1', '567.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>胡蘿蔔切薄片。準備一鍋水，放入胡蘿蔔後等水滾，加入金針菇燙30秒後取出，胡蘿蔔煮至軟後也拿出來。繼續燙小松菜，先燙莖再燙葉，燙30秒後取出泡冰水備用。稍微燙一下油豆腐去除油分，取出備用。<p> <hr><h1>2<h1><p>將白芝麻研磨至半粉狀，加入醬油、味淋、味噌拌勻。<p> <hr><h1>3<h1><p>將蔬菜捏出多餘水分幫助入味，金針菇也吸乾水份。將所有食材切長條狀，與味噌胡麻醬拌勻，完成。<p> <hr>\']', 'g、把、g、個、匙、匙、匙、匙'),
(568, '和風鰹魚風味豚肉壽喜燒', '豬梅花肉、金針菇、蔥、洋蔥、水(或柴魚昆布高湯)、醬油、鰹魚醬油、味霖、清酒(或米酒)、糖、堅魚粉、可食用生鮮雞蛋', '200、100、2、1/4、100、50、50、75、50、15、1、1～2', '568.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 1, 0, 4, '<hr><h1>1<h1><p>先調配壽喜燒醬汁，鰹魚粉可以不加，調好用火煮開，沸騰後關火靜置放涼<p> <hr><h1>2<h1><p>豬肉切薄片，切好後放入壽喜燒醬醃製40分鐘<p> <hr><h1>3<h1><p>洋蔥切片泡冷水去嗆，青蔥切段，金針菇切段分條，<p> <hr><h1>4<h1><p>熱鍋下油，七分熱放入洋蔥和青蔥蔥白的部分，中大火爆出香味<p> <hr><h1>5<h1><p>帶蔥白外表成微焦，放入蔥綠與金針菇，中火炒<p> <hr><h1>6<h1><p>金針菇超出水後，下肉，肉的外表半熟後倒入壽喜燒醬，煮滾即可食用<p> <hr><h1>7<h1><p>雞蛋打勻當醬汁<p> <hr>\']', 'g、g、支、顆、cc、cc、cc、cc、cc、g、匙、顆'),
(569, '日式料理照燒雞扒', '雞扒、昆布醬油、味醂、糖、粟粉、白胡椒、白芝麻', '2、45、15、2-3、2、適量、適量', '569.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 4, '<hr><h1>1<h1><p>雞扒洗淨後用紙巾抹乾水份。用刀把筋和脂肪切去，在厚肉的地方淺切幾刀。（可省略）將所有調味料混合，醃雞扒１小時。<p> <hr><h1>2<h1><p>開火熱鍋（可以不加油)，雞皮朝下煎到金黃色，倒入調味料並合上蓋。再翻面煎雞扒至金黃色，如喜歡有照燒汁可以加一點水，最後煮到醬汁濃稠收汁。<p> <hr><h1>3<h1><p>最後可加一點白芝麻在雞扒上會更好看呢！<p> <hr><h1>4<h1><p>1. 根據口味，自由加減糖，鹽和醬油。\\n2. 可加少少老抽令雞扒更金黃。<p> <hr>\']', '塊、毫升、毫升、茶匙、茶匙、適量、適量'),
(570, '日式芥末拌青蔥', '青蔥、柚子果肉、芥末粉、水、白米醋、酒、味霖、醬油、昆布柴魚高湯', '5、30、1/2、少許、少許、1、1/2、1/2、20', '570.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>芥末粉加水攪拌,在桌上倒扣靜置15分鐘.水量沒看到粉就好.再放入白米醋拌勻備用.<p> <hr><h1>2<h1><p>青蔥分蔥青蔥白,蔥青段切,蔥白斜切.柚子果肉切塊備用.<p> <hr><h1>3<h1><p>取小鍋子,倒入酒,味霖及醬油煮滾出香氣,續倒入昆布柴魚高湯.<p> <hr><h1>4<h1><p>再滾放入步驟1的蔥白,呈現透明感續放入蔥青,邊拌邊加熱煮至蔥青夠熟盛盤待涼.<p> <hr><h1>5<h1><p>食用時,步驟4裡面放入步驟2柚子果肉,淋步驟1芥末醬即可.<p> <hr>\']', '枝、g、小匙、少許、少許、小匙、小匙、小匙、cc'),
(571, '日式唐揚雞蓋飯', 'G腿肉、太白粉、米酒、醬油、蛋、蒜末、糊椒粉、油', '1、4、1、1、1、適量、適量、適量', '571.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>把肉切丁將米酒、醬油、蒜、胡椒加入攪拌，靜置30分鐘讓肉入味<p> <hr><h1>2<h1><p>醃好的雞肉加入蛋、太白粉攪拌<p> <hr><h1>3<h1><p>因為是溼炸方式，沒有再額外再沾粉，所以油量要多一點，避免沾鍋，但炸的過程結塊是正常的，再把肉撥開，等炸至金黃色就可起鍋。<p> <hr><h1>4<h1><p>最後擺盤看自己喜好做調整喔！<p> <hr>\']', '隻、大匙、大匙、大匙、顆、適量、適量、適量'),
(572, '超簡單的親子丼', '雞蛋、雞腿肉、洋蔥、醬油、味霖、水、鰹魚粉(ex.烹大師)', '1-2、1、半、適量、適量、適量、可有可無', '572.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>備料-\\n將洋蔥切成條狀\\n雞腿排切小塊\\n將蛋液打散準備好<p> <hr><h1>2<h1><p>備料2-調醬汁\\n醬油+水+味霖+烹大師混合\\n我通常是用醬油2匙+味霖1匙+水2-3匙\\n烹大師適量(約0.5-1小匙)<p> <hr><h1>3<h1><p>用中小火熱鍋\\n將雞肉下鍋，皮朝下煎\\n雞皮帶油，就不用另外加油了<p> <hr><h1>4<h1><p>雞肉表面變色後就能把洋蔥和醬汁一起下鍋煮\\n煮至洋蔥和雞肉熟透<p> <hr><h1>5<h1><p>這時候就可以到入蛋液啦\\n可以分兩次倒入\\n稍微拌一下讓蛋液均勻於鍋中\\n能蓋上鍋蓋燜一下\\n蛋液稍微凝固就可以關火起鍋了<p> <hr><h1>6<h1><p>把配料淋上白飯就完成了！\\n也能灑上蔥花、白芝麻或是海苔裝飾<p> <hr>\']', '顆、片、顆、適量、適量、適量、可有可無'),
(573, '日式壽喜燒', '高麗菜（片）、絲瓜（片）、洋蔥（絲）、菇、豆腐、豬肉片、蔥（段）、粉絲、醬油、味霖、水、糖、洋蔥（末）、烤肉醬、水、七味粉', '1/4、半、1/3、100、1/3、1、1、1、4、4、300、2、10、2、1、1', '573.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 4, '<hr><h1>1<h1><p>備料<p> <hr><h1>2<h1><p>油鍋加洋蔥，蔥白，炒到洋蔥變透明<p> <hr><h1>3<h1><p>加入壽喜燒湯汁，將材料放入即可<p> <hr>\']', '個、條、個、g、盒、盒、根、個、大匙、大匙、cc、匙、g、大匙、大匙、大匙'),
(574, '日式料理滑蛋鰻魚飯', '蒲燒鰻魚、雞蛋、洋蔥、油、鹽、醬油、味醂、水、?花、鰹魚碎/ 蝦乾/ 魚乾', '1、2、0.5-1、0.5、0.3、0.5-1、30、70、適量、適量', '574.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>洋蔥切絲，待用。鰻魚切件，待用。將蝦乾/ 魚乾加水煮滾，然後加入所有調味料。<p> <hr><h1>2<h1><p>加蛋，微微打發。<p> <hr><h1>3<h1><p>下油開鍋，加洋蔥絲爆香。把滑蛋鋪在白飯上。<p> <hr><h1>4<h1><p>洋蔥炒至軟身。將已調味的蛋液緩緩倒入。用中小火煮至理想熟的程度。<p> <hr><h1>5<h1><p>用同一個鍋子將鰻魚煎熱，然後鋪在蛋上。<p> <hr><h1>6<h1><p>最後灑上鰹魚碎和?花，大功告成。<p> <hr><h1>7<h1><p>蛋液比例難控制，視乎雞蛋大小；最完美是蛋：水約1：1.5。如果難掌握，寧願稀一點慢慢用小火蒸發走水份至理想的滑蛋程度。<p> <hr>\']', '條、隻、個、湯匙、茶匙、湯匙、ml、ml、適量、適量'),
(575, '炙烤日本干貝', '日本干貝、橄欖油、鹽', '100、10、4', '575.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>將干貝洗淨，水分吸乾，備用。<p> <hr><h1>2<h1><p>在下鍋前才能灑上一點海鹽，\\n以免干貝將鹽分都吸入，導致口味過鹹。<p> <hr><h1>3<h1><p>使用中小火，煎至表面上色即可。<p> <hr>\']', '公克、公克、公克'),
(576, '日式鱈魚肝小菜～', '鱈魚肝、小黃瓜、紫洋?、白醋（600cc）、細白砂糖、柴魚、昆布、新鮮柳丁汁、檸檬、醬油、蒜頭', '2、1、1、1、7、1、1、1、1、一點點、3', '576.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>醬汁食材。\\nps：準備一個玻璃瓶裝。\\n# 依個人需要去增減等比例的量。\\n如果沒有新鮮柳丁汁，也可以用每日C柳橙汁。<p> <hr><h1>2<h1><p>把蒜頭去頭去皮，檸檬壓汁，和其餘食材一起放入玻璃瓶內，拌勻，冷藏三天後再使用。\\nps：醬油只需一點點配色。<p> <hr><h1>3<h1><p>三天後過濾出醬汁，即可用於自己喜歡的涼拌沙拉內。\\nps：若吃得慢，可以過濾後分裝入冷凍保存。<p> <hr><h1>4<h1><p>（1）紫洋蔥切絲，冰鎮一下。\\n（2）小黃瓜切滾刀塊，冰鎮一下。\\n（3）鱈魚肝冷藏待用。\\nps：小黃瓜也可以切圓片狀，依個人喜愛口感而決定。<p> <hr><h1>5<h1><p>鱈魚肝打開後如照片，如果不希望含太多油，可以先把它夾出放?房紙上再用，鱈魚肝很軟嫩，夾的時候要小心點。\\nps：作者喜歡來自冰島的老船長品牌鱈魚肝，百貨公司超市可買到。<p> <hr><h1>6<h1><p>取一盤，依序先放上冰鎮後的小黃瓜、冷藏後的鱈魚肝、冰鎮後紫洋蔥絲，享用前再淋上醬汁。\\nps：如果有白蘿蔔，可以磨些泥，壓乾水，放入醬汁內，白蘿蔔泥吸附醬汁再搭配吃更棒。<p> <hr>\']', '盒、支、小塊、瓶、兩、小把、小片、杯、粒、一點點、瓣'),
(577, '【厚生廚房】日式酒蒸文蛤', '文蛤、蒜頭、辣椒、青蔥、檸檬、奶油、白酒、醬油', '300、3、適量、1、1、1、約100、1', '577.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>文蛤拆封後先泡水5分鐘；蒜頭、辣椒、青蔥切細。<p> <hr><h1>2<h1><p>鍋熱後，取一匙奶油，加入蒜、蔥、辣椒爆香。<p> <hr><h1>3<h1><p>放入文蛤，略炒一下，淋上兩匙白酒，蓋上鍋蓋燜至文蛤全開。<p> <hr><h1>4<h1><p>淋上些許醬油，奶油拌勻。起鍋前擠上檸檬汁。<p> <hr>\']', '克、瓣、適量、根、小匙、小塊、cc、大匙'),
(578, '日式乾燒蝦仁丼飯', '白蝦、紫洋蔥、雞蛋、醬油、糖、白胡椒、美生菜、海苔', '100、半、2、一、少許、少許、一、適量', '578.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>蝦子撥殼，煎熟後取出，接著放入紫洋蔥，炒到熟透明後，再加入醬油、糖跟高湯拌炒後，接著放入剛剛的蝦子拌炒一下，就可起鍋<p> <hr><h1>2<h1><p>將1000cc水燒開後，再加入300cc冷水，放入生雞蛋，等待8分鐘，把蛋取出，就煮好溫泉蛋了<p> <hr><h1>3<h1><p>將飯及蝦仁裝盤後灑上海苔片、切一片黃檸檬放盤邊，即可上菜<p> <hr><h1>4<h1><p>附上食材及購買明細<p> <hr>\']', '克、顆、顆、小匙、少許、少許、片、適量'),
(579, '嫩煎里肌親子丼', '雞里肌、洋蔥、蛋、醬油、味霖、糖、過濾水', '300、1、3、2、2、1、150', '579.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>雞里肌切成適口大小，洋蔥切絲、蛋打散備用。\\n熱鍋加少許油，雞里肌入鍋煎至變色即可起鍋備用。<p> <hr><h1>2<h1><p>原鍋再加少許油，下洋蔥拌炒至變色。<p> <hr><h1>3<h1><p>將雞肉再度下鍋。<p> <hr><h1>4<h1><p>醬油、味淋、糖、過濾水拌勻後入鍋煮至水滾。<p> <hr><h1>5<h1><p>下蛋液後即可關火，因家有幼兒所以多煮一會兒確認全熟。淋在飯上即成美味親子丼。\\n可依個人口味添加七味粉或黑胡椒。<p> <hr>\']', 'g、顆、顆、大匙、大匙、小匙、cc'),
(580, '日式料理-天津飯', '白飯、雞蛋、蟹肉棒、香菇、豬肉絲、蝦仁、洋蔥絲、水or雞高湯、蠔油、醬油、米酒、糖、太白粉水', '1、3、3、1、40、5、少許、200、15、5、10、1、適量', '580.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 0, 0, 4, '<hr><h1>1<h1><p>蟹肉棒剝絲\\n香菇切絲\\n其餘食材準備好<p> <hr><h1>2<h1><p>雞蛋打散\\n白飯先用裝在碗上倒蓋置盤子上備用<p> <hr><h1>3<h1><p>使用小型的平底鍋小火慢煎雞蛋液<p> <hr><h1>4<h1><p>用筷子快速攪拌一下然後等待底下定型成滑蛋<p> <hr><h1>5<h1><p>滑蛋淋在白飯上成蛋包飯備用<p> <hr><h1>6<h1><p>起鍋少許油先爆香洋蔥絲及香菇<p> <hr><h1>7<h1><p>其餘食材炒熟後加入醬汁煮滾<p> <hr><h1>8<h1><p>最後使用太白粉水勾芡成濃稠狀淋在蛋包飯上完成<p> <hr><h1>9<h1><p>一道快速方便的天津飯就完成囉<p> <hr>\']', '碗、顆、隻、朵、g、隻、少許、g、g、g、g、茶匙、適量'),
(581, '日式燒肉杏鮑菇', '火鍋肥牛肉片（豬肉也可以）、杏鮑菇、洋蔥、蒜頭、蔥、日式燒肉醬、鹽、黑胡椒粉、日式燒肉醬、黑胡椒粉、玉米粉或太白粉', '350、2、1、2、3、1/2、1/2、少許、2、少許、2', '581.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>日式燒肉利用帶油的肥牛或五花肉片或雞腿肉都很好吃喔～<p> <hr><h1>2<h1><p>肉片用燒肉醬汁、黑胡椒粉和玉米粉抓醃ㄧ下。<p> <hr><h1>3<h1><p>蔥洗淨切蔥花，杏鮑菇擦乾淨切片；蒜拍扁去皮切片；洋蔥切薄片；<p> <hr><h1>4<h1><p>鍋燒熱，放少許油，將杏鮑菇片排入，撒上少許鹽及黑胡椒粉一起煎；<p> <hr><h1>5<h1><p>煎到兩面上色，即可先起鍋備用；<p> <hr><h1>6<h1><p>原鍋放少許橄欖油，下洋蔥絲、蒜片炒出香味；<p> <hr><h1>7<h1><p>將炒香的洋蔥和蒜片撥到一邊，放入醃好的肉片煎香煎上色；<p> <hr><h1>8<h1><p>煎炒到肉片都上色後；<p> <hr><h1>9<h1><p>放上杏鮑菇，並倒入日式燒肉醬，適量的鹽（使用量取決於燒肉醬的鹹度）；<p> <hr><h1>10<h1><p>撒上蔥花拌炒均勻即可。<p> <hr>\']', 'g、根、顆、瓣、根、杯、茶匙、少許、湯匙、少許、茶匙'),
(582, '【家常菜】日式南瓜佃煮', '南瓜、味醂、醬油、砂糖', '400、2、3、2', '582.png', 'https://icook.tw/recipes/', 1, 1, 0, 0, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>南瓜不去皮切成小塊，皮朝下放入鍋中<p> <hr><h1>2<h1><p>鍋中先加入20cc左右的水後加入所有調味料<p> <hr><h1>3<h1><p>加水淹至7分滿，蓋上鍋蓋煮15-25分鐘<p> <hr><h1>4<h1><p>打開鍋蓋煮至收汁就可以了<p> <hr>\']', 'g、大匙、大匙、小匙'),
(583, '簡易版hayashirice', '薄牛肉片、洋蔥（中型）、鴻喜菇、鮮香菇、蒜、番茄糊、伍斯特醬、紅酒、高湯、月桂葉、奶油、麵粉、鹽和胡椒', '200、1、150、4、2、1、1、150、400、2、1、2、少許', '583.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 0, 0, 4, '<hr><h1>1<h1><p>洋蔥切絲；蒜切碎；香菇切片；鴻喜菇去掉不能吃的部分，很快用水沖一下，瀝乾<p> <hr><h1>2<h1><p>先炒軟蔬菜和蒜，下牛肉炒到變色，放一邊備用<p> <hr><h1>3<h1><p>用同一個鍋子溶化奶油，下麵粉拌成糊狀，下酒拌勻，下高湯和其餘的調味料，攪拌均勻<p> <hr><h1>4<h1><p>把牛肉和蔬菜放回鍋裡，拌勻，蓋上鍋蓋，小火燉煮30-40分鐘<p> <hr><h1>5<h1><p>在米飯上淋上做好的醬汁<p> <hr>\']', '克、個、克、朵、瓣、大匙、大匙、亳升、毫升、片、大匙、大匙、少許'),
(584, '日式茶碗蒸', '雞蛋、魚板、蝦子、香菇、柴魚高湯、醬油露(小撇步)、米酒(無可略)、鹽', '2、2、2、2、250、1、1、1/2', '584.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>食材備齊，蝦子這次使用的是白蝦，好大隻又鮮甜，香菇魚板都切成薄片，如果沒有柴魚高湯可以用市售罐頭雞湯，或是鰹魚調味粉依包裝說明去調成高湯，雞蛋泡在常溫水中退冰10分鐘。<p> <hr><h1>2<h1><p>冷凍的蝦子直接在流水下沖，很快就能退冰。<p> <hr><h1>3<h1><p>蝦子剪去頭部，剝殼，留不留蝦尾均可，牙籤從頭部算起第二、三節插入，挑出腸泥，然後加入份量外的1/4小匙鹽(等於輕捏1小撮)，和1/2小匙酒醃漬10分鐘。<p> <hr><h1>4<h1><p>重點來了，高湯請微波或以其他方式加熱至約40度左右的溫度，摸起來覺得微熱就可以。\\n\\n將蛋先大略打散，然後一邊攪拌一邊加入溫熱的高湯，這樣的方式可以讓蛋充分攪散，而不會留下很多蛋白蛋筋，等等過篩時都會浪費掉。<p> <hr><h1>5<h1><p>接著加入調味料，攪拌至鹽充分溶解。<p> <hr><h1>6<h1><p>將蛋液反覆過濾至少兩次，然後倒入蒸碗中，這邊注意的地方是：如果你喜歡魚板等配料都在上面很漂亮，那就先倒入8-9成蛋液，如果不在乎美觀，可以直接加入所有配料於碗裡。<p> <hr><h1>7<h1><p>在鍋中加入200ml(約1米杯多)的水，放入茶碗蒸，我使用的是有蓋子的蒸碗可以直接蓋上，如果沒有蓋子，可在碗上加蓋耐熱保鮮膜，或是夾一根不鏽鋼筷，也可以折一小塊厚厚的鋁箔紙於鍋蓋與鍋子間，這樣才能防止水蒸氣滴下，破壞表面平整。\\n\\n我的蒸碗較大只能裝兩份，小一點的蒸碗可以裝到3-4份。<p> <hr><h1>8<h1><p>蓋上蓋子後以中火加熱約4分鐘，水沸騰後轉小火，繼續加熱4分鐘，暫時關火，開蓋放入配料，倒入剩餘蛋汁，然後再度蓋上蓋子小火煮6分鐘(如果配料一開始就加入就直接煮10分鐘)，關火後燜10分鐘，即可享用。<p> <hr><h1>9<h1><p>看就知道有多滑嫩，再嚐一匙真是鮮美可口！料多又大碗，絕對不輸日式料理餐廳的噢～<p> <hr>\']', '顆、薄片、隻、薄片、ml、小匙、小匙、小匙多'),
(585, '日式鹽味唐揚', '雞胸肉丁、醬油、酒、味霖、鹽、糖、香油、太白粉、片栗粉', '一、一、一、一、些許、1/2、一、三、三', '585.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>將雞胸肉丁用 ?醃料? 醃製至少半小時，或放入冰箱冷藏至隔日使用。<p> <hr><h1>2<h1><p>將肉丁取出一一裹粉（亦可使用其中一種即可），放置至回潮。<p> <hr><h1>3<h1><p>熱鍋，倒入油，油熱後放進肉丁兩面炸至金黃色，取出，待約三分鐘後再入鍋回炸第二次即可。<p> <hr>\']', '份、小匙、大匙、大匙、些許、小匙、小匙、大匙、大匙'),
(586, '日式料理牛肉丼飯', '雪花牛肉、洋蔥、蛋、青蔥、日式醬油、味霖、米酒、糖、水、橄欖油', '1、半、2、1、50、2、1、少許、20、1', '586.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 1, 0, 4, '<hr><h1>1<h1><p>備菜\\n洋蔥-切絲\\n蛋-打散\\n青蔥-切蔥花<p> <hr><h1>2<h1><p>下1大匙橄欖油熱鍋，在放入洋蔥爆炒<p> <hr><h1>3<h1><p>洋蔥炒一點爛下牛肉爆炒<p> <hr><h1>4<h1><p>牛肉炒至八分熟加入醬汁米酒、醬油、味霖、水、糖拌炒<p> <hr><h1>5<h1><p>醬汁拌均勻後在放入蛋液蓋鍋蓋以中小火燜約1分鐘，即可完成?<p> <hr><h1>6<h1><p>盛碗熱飯即可將牛肉倒入上面，加點青蔥即可完成?<p> <hr>\']', '盒、顆、顆、支、cc、大匙、大匙、少許、cc、大匙'),
(587, '日式料理豬肉王京蔥雪花餃子', '豬肉碎、?王、京蔥、鹽、白胡椒、雞汁、甜椒粉、蒜粉、粟粉', '適量、適量、適量、適量、適量、適量、適量、適量、適量', '587.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>把材料切碎並和調味料混合在一起。<p> <hr><h1>2<h1><p>餃子邊沾水封口，包好餃子並沾上麵粉。<p> <hr><h1>3<h1><p>下油開鍋。把水加上麵粉，比例為１：１０。（雪花秘訣）把餃子排好，加麵粉水及合上蓋子中小火焗10分鐘。<p> <hr><h1>4<h1><p>開蓋，把餃子中火煎至收乾水。小心把餃子反轉在大碟上即可。<p> <hr>\']', '適量、適量、適量、適量、適量、適量、適量、適量、適量'),
(588, '日式味噌烤茄子', '日本茄子直徑5公分*15公分長、薑絲、辣椒粉、酒、味霖、醬油、昆布柴魚高湯', '1、1、少許、1、1/2、1/2、20', '588.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>茄子用直火烤至皮焦黑,待涼取皮擦乾段切備用.<p> <hr><h1>2<h1><p>取小鍋子,放入薑絲,酒,味霖及醬油煮滾出香氣,續倒入昆布柴魚高湯.<p> <hr><h1>3<h1><p>在滾收乾倒8分時,放入步驟1煮至收汁即可.<p> <hr>\']', '條、撮、少許、小匙、小匙、小匙、cc'),
(589, '日式佃煮柳葉魚', '柳葉魚、薑片、味醂、醬油、黑糖、米酒、水', '250、數片、2、3、2、2、500', '589.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>醬料全部拌勻<p> <hr><h1>2<h1><p>以小火燉煮30分鐘<p> <hr><h1>3<h1><p>起鍋用白芝麻裝飾<p> <hr><h1>4<h1><p>擺盤上桌<p> <hr>\']', 'g、數片、大匙、大匙、大匙、大匙、ml'),
(590, '日式炒烏龍麵', '豬肉絲、洋蔥、高麗菜絲、蠔油、柴魚醬油、熱開水、白胡椒粉、辣椒', '100、半、1/8、二、50、100、適量、一', '590.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>中火熱油鍋後，先爆香炒洋蔥絲，炒到略為半透明狀，洋蔥香氣也散出後，下入豬肉絲開中大火爆炒到肉七分熟，加入蠔油 柴魚醬油煮滾。<p> <hr><h1>2<h1><p>加入高麗菜絲，蓋上鍋蓋悶煮。<p> <hr><h1>3<h1><p>約二分鐘後高麗菜絲就會悶熟，高麗菜的甜味就會釋放，加入熱開水繼續悶煮到滾，再加適量的白胡椒粉，就可下入烏龍麵或鍋燒麵二人份，拌炒到湯汁吸收入麵條就可出鍋啦。<p> <hr><h1>4<h1><p>盛盤後再撒上七味粉或少許白芝麻，簡單美味的日式炒烏龍完成。<p> <hr>\']', '克、顆切絲、顆、大匙、cc、cc、適量、小條'),
(591, '日式烏龍涼麵', '冷凍烏龍麵、小黃瓜、火腿、蛋、梅花豬火鍋肉片、韓式烤肉醬、鰹魚醬油、冰開水、白芝麻', '1、1、2、1、5、1、2、2、少許', '591.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>小黃瓜切絲，火腿煎熟切絲，蛋加鹽拌勻煎成蛋皮切絲。\\n\\n涼麵沾醬：鰹魚醬油加入等量冷開水放冰箱備用，上桌前灑點白芝麻及哇沙米。<p> <hr><h1>2<h1><p>烏龍麵煮熟撈起沖冷開水。\\n\\n梅花豬火鍋片燙熟撈起拌入韓式烤肉醬。<p> <hr><h1>3<h1><p>烏龍麵先放進盤子，再依序擺放切絲食材及肉片完成。\\n\\n懶婦的簡單煮法，不正統，純開心分享，僅供參考。<p> <hr>\']', '包、條、片、顆、片、大匙、大匙、大匙、少許'),
(592, '雞肉丼飯', '白飯、鳳梨、蝦仁、火腿、洋蔥、火腿、洋蔥、彩色豆、雞腿排、雞蛋、肉鬆、青蔥、蘑菇醬', '6、4、3、3、3、3、少許、3、4、4、少許、少許、4', '592.png', 'https://icook.tw/recipes/', 0, 0, 1, 0, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>鳳梨 火腿 洋蔥 青蔥 切丁\\n再打好4顆蛋 備妥 彩色豆<p> <hr><h1>2<h1><p>先將雞腿排 兩面乾煎<p> <hr><h1>3<h1><p>雞腿排切塊 加入 洋蔥 蒜片 米酒 蘑菇醬 拌炒<p> <hr><h1>4<h1><p>蝦仁 清炒  蛋 炒好 再倒入少許油 放入 洋蔥.火腿.彩色豆拌炒至粒粒分明\\n最後再放入鳳梨 撒上青蔥 提味<p> <hr><h1>5<h1><p>炒飯翻放入小碗公 鋪上蘑菇雞腿肉  加些少許肉鬆.鳳梨<p> <hr>\']', '碗、片、人份、人份、人份、人份、少許、人份、片、個、少許、少許、湯匙'),
(593, '日式和風雞肉串', '雞腿丁、日式和風碳烤粉', '適量、適量', '593.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>雞腿丁以竹籤串起。<p> <hr><h1>2<h1><p>平底鍋小火熱鍋，放入雞肉串，灑上適量日式和風碳烤粉，5分鐘後翻面再灑粉。<p> <hr><h1>3<h1><p>可蓋上鍋蓋加速悶熟。確認熟透後起鍋。<p> <hr>\']', '適量、適量'),
(594, '日本酸辣雞翅，常備菜推薦', '雞腿、雞翅、醋、醬油、米酒、味霖、砂糖、辣椒', '300、300、100、50、50、50、4、1', '594.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>先用平底鍋煎雞肉，到稍微微焦後就可以了<p> <hr><h1>2<h1><p>調好醬料之後，與煎好的雞腿一起放入鍋子裡面煮。先以中火煮15分鐘、記得上蓋唷<p> <hr><h1>3<h1><p>等醬料變得稠稠之後，接著轉小火再煮15分鐘。其中記得翻轉肉的位置避免燒焦<p> <hr><h1>4<h1><p>拿出來放涼，讓肉更入味，接著就可以吃啦～如果沒吃完可以放冰箱當常備菜????????<p> <hr>\']', 'g、g、g、g、g、g、大匙、根'),
(595, '八角日式醬油泡蛋', '雞蛋、八角、清水、日式醬油、清酒、味霖、鹽巴', '10、4、450、70、30、30、1', '595.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>煮一鍋開水，雞蛋用清水加鹽巴先洗過備用。水滾後放入雞蛋，依照喜好決定煮的時間約6-12分鐘<p> <hr><h1>2<h1><p>同時準備將醬料材料倒入另一個鍋中，煮到水開，關小火再煮5分鐘後放涼<p> <hr><h1>3<h1><p>這時候可以剝雞蛋去殼。雞蛋去殼也是有小技巧，煮到喜歡的時間後，直接將熱水倒掉，加入冷水將雞蛋放置到溫溫的最好剝<p> <hr><h1>4<h1><p>等醬料涼的時候，將剝好的雞蛋放入玻璃容器。玻璃容器最好能讓醬料蓋住雞蛋，如果不行可以三四個小時後搖晃一下，讓雞蛋滾動。<p> <hr><h1>5<h1><p>放置冰箱至少4小時或一個晚上會更入味，美味的八角醬油泡蛋完成。<p> <hr><h1>6<h1><p>煮12分鐘的雞蛋，內部已經全熟。適合不吃生蛋的朋友們，全熟的雞蛋是最好剝的。\\n煮9分鐘的雞蛋已經近乎全熟，只有中間還是稍微濕潤。這蠻適合不接受生蛋，但又覺得全熟蛋太乾的朋友。\\n煮七分鐘的蛋大概六分熟，整個蛋黃是十分濕潤的，但卻不會流動。這是我喜歡煮的時間，喜歡生蛋黃的人，可以煮六分鐘就會有流動的蛋黃<p> <hr>\']', '個、個、ml、ml、ml、ml、小搓'),
(596, '超完美日式溏心蛋零失敗必成功', '雞蛋、滷汁、醬油、味醂、清酒、開水、蒜末、八角、五香粉', '6、一、60、60、60、50、3-4、一、少許月桂葉1-2', '596.png', 'https://icook.tw/recipes/', 0, 0, 0, 1, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>將所有材料中火煮滾煮香，待冷卻至常溫，我加了一小碗的滷汁，可參考滷肉篇的作法??????\\n\\nhttps://icook.tw/recipes/295787<p> <hr><h1>2<h1><p>雞蛋洗淨後在雞蛋屁股（圓圓的地方） 用圖釘戳一個小洞，我是利用這個小工具非常的方便，在大創就買得到了， 這個動作很重要會讓你之後蛋殼非常的好剝。<p> <hr><h1>3<h1><p>開水煮滾後加入一小匙鹽巴， 再將雞蛋用漏勺輕輕放入煮滾的開水裡，避免蛋殼破裂， 開始計時6分鐘?， 過程中可以用筷子和湯匙稍微的攪拌這樣可以讓你煮出來的蛋黃 ，剛剛好在正中間 就會很完美，\\n時間到後立馬關火立即撈出。<p> <hr><h1>4<h1><p>馬上放入已經準備好冰鎮的冰塊開水裡，浸三分鐘。<p> <hr><h1>5<h1><p>冰鎮完的雞蛋 還是非常的脆弱，要小心的呵護他喔，我們將氣室的地方也就是雞蛋屁股圓圓之處，開始敲碎順向剝殼，會好剝很多。<p> <hr><h1>6<h1><p>再將冷卻的滷汁放入準備好的容器， 將剝好的雞蛋放入浸泡，我們就給點耐心吧，冰上個一天一夜的，隔天就可以大啖讓您驚豔到不行的超完美日式溏心蛋囉，太好吃了??????<p> <hr>\']', '顆、小碗、cc、cc、cc、cc、顆、顆、片'),
(597, '嫩煎雞腿親子丼', '雞腿排及雞里肌、洋蔥、雞蛋、醬油、味淋、糖、水', '1、1、3、2.5、2、1、100-150', '597.png', 'https://icook.tw/recipes/', 0, 0, 0, 0, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>食材備妥\\n\\n雞理肌切成小塊狀（想吃多點肉就多放點）\\n\\n雞排上灑點黑胡椒及鹽巴（雞排先不要切）<p> <hr><h1>2<h1><p>起油鍋放人雞肉乾煎<p> <hr><h1>3<h1><p>雞肉呈現白色就起鍋\\n\\n雞腿排去皮切成塊狀<p> <hr><h1>4<h1><p>起油鍋下洋蔥，炒到顏色有點改變<p> <hr><h1>5<h1><p>接著將雞肉放人鍋中<p> <hr><h1>6<h1><p>調味料先挑好一碗備用（可以試一下味道調整）喜歡更日式偏甜就加糖<p> <hr><h1>7<h1><p>加入調味料直到水滾（肉也熟了）<p> <hr><h1>8<h1><p>把蛋打碎淋上蛋液，關火（關火時間依照個人喜歡蛋液熟成多程度）\\n\\n灑上一點紅椒粉及芹菜粉讓色澤更美麗可口<p> <hr>\']', '份、顆、顆、湯匙、湯匙、小匙、cc'),
(598, '醬燒雞肉（壽喜鍋口味）', '醬油、白砂糖、柴魚粉（小包裝）、米酒、蔥（裝飾用）、雞腿肉', '1/3、1/5、一半、1/5、一、一', '598.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>步驟一：\\n醃製醬料準備：\\n醬油 1/3碗\\n柴魚粉 小包裝（一半）\\n白砂糖 兩小湯匙\\n米酒少許 約1/5碗量\\n(請用一般吃飯的小碗唷！)<p> <hr><h1>2<h1><p>步驟二：\\n將雞肉倒入醃醬中，用筷子攪拌均勻後，靜置約10分鐘。<p> <hr><h1>3<h1><p>步驟三：\\n將雞肉表面煎一點焦，然後再倒入一半醃製的醬汁，伴隨著醬汁烹調約3-5分鐘，若覺得有點鹹可再加水稀釋即可。<p> <hr>\']', '碗量、碗量、一半、碗量、把、支'),
(599, '茶碗蒸-好吃又可以補充蛋白質', '雞蛋、鰹魚醬油、水、蝦仁', '顆、大匙、16次半殼蛋、選配', '599.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>沒有鰹魚醬油也可以使用鹽巴代替（2顆蛋1小匙鹽）。\\n\\n配料可自行隨意添加。<p> <hr><h1>2<h1><p>這次使用4顆蛋，1個人的話大約可以配4餐的飯唷。\\n\\n（但我們是兩個人所以大概2餐就沒了?(??▽?)?）<p> <hr><h1>3<h1><p>加入2大匙的鰹魚醬油。<p> <hr><h1>4<h1><p>用一半的蛋殼裝水，總共盛16次。\\n\\n（因為有4顆蛋，所以是4x4=16哦！）<p> <hr><h1>5<h1><p>攪拌均勻，若允許的話可使用篩網過濾蛋液把泡泡濾掉，\\n但是我的宿舍沒有買篩網所以只有稍微用湯匙撈掉而已(￣▽￣)/\\n泡泡只是影響美觀而已，吃起來味道沒有差喲！\\n\\n如果沒有要加配料的話，這樣子就可以直接放進電鍋，外鍋1杯水，跳起後再悶個10-15分鐘即可食用。<p> <hr><h1>6<h1><p>以下步驟開始是有需要加配料的～\\n\\n承上一個步驟，把蛋液分出一部分，先放入電鍋蒸到微硬（外鍋半杯水，跳起即可拿出來）。<p> <hr><h1>7<h1><p>蒸好微硬的蛋後拿出，放入想添加的配料或海鮮即可。\\n\\n\\n\\n題外話，因為這裡有濾泡泡所以蛋面看起來很平滑（後面就忘記濾了，所以成品醜醜的??）<p> <hr><h1>8<h1><p>再把剩下的蛋液倒入就可以放進電鍋蒸囉！\\n\\n外鍋一杯水，跳起後再悶一下（大約10-15分鐘）即可完成。<p> <hr><h1>9<h1><p>完成囉！！上次男友吃完說很好吃喔(?ω?)<p> <hr>\']', '顆、大匙、16次半殼蛋、選配'),
(600, '清蒸紅魚(日式風味)', '紅魚(紅鯛)、青蔥、醬油、柴魚昆布高湯、味霖、米酒', '一、4、適量、偏多(主體)、適量、適量', '600.png', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>魚去鱗去內臟，看個人技術可先剃除魚刺，留下魚肉魚頭即可<p> <hr><h1>2<h1><p>三支蔥分三段，直面對半切，鋪在碗盤上，兩隻蔥切丁<p> <hr><h1>3<h1><p>將魚舖在蔥段上，再灑上切丁的蔥花<p> <hr><h1>4<h1><p>醬油、味霖、柴魚昆布高湯(可參考我的食譜)、米酒調和，味道鹹度自行調適，淋在盤上<p> <hr><h1>5<h1><p>外鍋2飯碗水，用錫箔紙蓋上，蒸15分即可上菜<p> <hr>\']', '隻、支、適量、偏多(主體)、適量、適量'),
(601, '日式什錦起司燒', '培根（切塊）、蝦子或蝦仁（已處理完成）、花椰菜（切小朵）、番茄（切塊）、起司絲、柴魚片、美乃滋、蛋', '適量、適量、適量、適量、依喜好、依喜好、半、4', '601.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>先打一顆蛋，並加入些許美乃滋後，攪拌均勻（利用蛋液來乳化美乃滋）接著再將剩下的三顆蛋都打入，攪拌均勻<p> <hr><h1>2<h1><p>於平底鍋加入少許油，依序小火煎培根->蝦子或蝦仁->花椰菜->番茄，將食材們均勻平鋪於平底鍋<p> <hr><h1>3<h1><p>將蛋液倒入鍋內，並灑上起司絲，蓋上鍋蓋小火悶煮約五分鐘，使蛋液成型<p> <hr><h1>4<h1><p>最後進行翻面再煎約3分鐘後就可起鍋<p> <hr><h1>5<h1><p>依喜好於表面淋上美乃滋及柴魚片<p> <hr>\']', '適量、適量、適量、適量、依喜好、依喜好、條、顆'),
(602, '零失敗溏心蛋，日本拉麵必備味付卵', '蛋、蔥、醬油、味霖、砂糖、水', '5、一、50、30、15、50', '602.png', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 0, 0, 4, '<hr><h1>1<h1><p>醃料混合後小火煮滾，等到蔥變的軟趴趴後就可以熄火起鍋<p> <hr><h1>2<h1><p>■ 煮水並加入一匙醋可以防止破蛋的蛋白跑出來\\n■ 等水滾後再放入蛋！\\n■ 蛋計時「6分30秒」\\n■ 煮蛋時可以用筷子攪拌，這樣蛋黃就會在中間<p> <hr><h1>3<h1><p>時間到後，把蛋倒入冰水中，這時蛋膜會內縮變得很好撥??<p> <hr><h1>4<h1><p>這樣美美的蛋拿去做溏心蛋才好看<p> <hr><h1>5<h1><p>裝袋後放入冰箱24小時～期間可以換位置讓蛋均勻上色????\\n\\n之後要配什麼都很下飯～<p> <hr>\']', '顆、段、ml、ml、g、ml'),
(603, '日式大阪燒', '麵粉、水、蛋、高麗菜絲、火腿、洋蔥、紅蘿蔔絲、美乃滋、大阪燒醬、柴魚片', '200、200、1、很多、一片、四分之一、適量、個人喜好、個人喜好、個人喜好', '603.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>將麵粉、清水、蛋、全部混合，然後加入高麗菜絲打底。\\n??此步驟食材皆為必要食材??<p> <hr><h1>2<h1><p>然後加入其他食材，食材可依個人喜好想吃什麼放什麼。??<p> <hr><h1>3<h1><p>將麵糊分兩次倒入煎鍋，第一次先打底固定形狀。<p> <hr><h1>4<h1><p>待麵糊底部成固體，加入剩餘麵糊<p> <hr><h1>5<h1><p>煎至兩面金黃，叉子斜插拔起無液體狀麵糊即可盛盤??<p> <hr><h1>6<h1><p>最後加上大阪燒醬、美乃滋、柴魚片即完成?<p> <hr>\']', 'ml、ml、顆、很多、片、四分之一、適量、個人喜好、個人喜好、個人喜好'),
(604, '牛丼飯', '薑末、蔥、洋蔥、牛肉片、米酒、醬油、味霖、水', '3、1、半、165、2、2、2、半', '604.png', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 0, 0, 0, 4, '<hr><h1>1<h1><p>準備薑末,蔥花以及洋蔥絲<p> <hr><h1>2<h1><p>爆香薑末<p> <hr><h1>3<h1><p>加入洋蔥絲炒至半透明<p> <hr><h1>4<h1><p>加入牛肉片拌炒<p> <hr><h1>5<h1><p>最後加入調味料(米酒,醬油, 味霖及水)熬煮一下<p> <hr><h1>6<h1><p>鋪在白飯上,就大功告成!<p> <hr>\']', '克、根、顆、克、湯匙、湯匙、湯匙、碗'),
(605, '日式蒸蛋', '蛋、柴魚粉、鹽、味素、胡椒粉', '2、1、0.5、少許、適量', '605.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>2顆蛋+1杯水+所有調味料<p> <hr><h1>2<h1><p>打到冒泡（一定要做確實）<p> <hr><h1>3<h1><p>放鍋裡蒸\\n鍋蓋不能蓋死\\n要留1公分以上的空隙（很重要）<p> <hr>\']', '顆、小匙、小匙、少許、適量'),
(606, '豬排菇菇蓋飯', '美白菇、鴻禧菇、洋蔥、蛋、鹽、麵包粉、里肌肉', '少許、少許、少許、一、少許、少許、一', '606.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 0, 1, 0, 4, '<hr><h1>1<h1><p>將米洗淨後上頭放置些許洋蔥絲及美白菇/鴻禧菇及鹽（煮飯的水放一點點就可以..洋蔥及菇都會出水），想吃濕潤米飯口感可水量放多，若要一般白米飯口感就少放點水<p> <hr><h1>2<h1><p>煮飯的另一頭，可準備里肌肉加入蒜頭及醬油稍微醃至一會（若沒有蒜頭，可購買香蒜粒取代）<p> <hr><h1>3<h1><p>醃肉後的肉片沾上蛋液後再裹上麵包粉.放置烤箱烤約10-12分（依照每台烤箱溫度不同...去拿捏時間.可3-5分為一次基準..記得翻面烤）<p> <hr><h1>4<h1><p>沾肉剩下的蛋液可加入飯中..成為配料.起鍋前加入蔥花即可<p> <hr>\']', '少許、少許、少許、顆、少許、少許、份'),
(607, '鹽焗鱸魚', '加州鱸魚、粗鹽、鐵鍋', '一、一、一', '607.png', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>鱸魚洗淨用廚房紙巾擦乾，在背部畫上幾刀<p> <hr><h1>2<h1><p>粗鹽平鋪/鋪滿在鍋底<p> <hr><h1>3<h1><p>新鮮鱸魚放上去（去不去魚鱗都可以）<p> <hr><h1>4<h1><p>蓋上鍋蓋，開大火<p> <hr><h1>5<h1><p>等到粗鹽都變熱之後，改中大火，烤十分鐘即可（時間可視魚的大小微調）<p> <hr><h1>6<h1><p>用筷子搓魚看看，若可簡單的搓過去，表示魚已經熟透<p> <hr><h1>7<h1><p>把魚表面沾附的粗鹽拍掉<p> <hr><h1>8<h1><p>美味上桌了<p> <hr>\']', '條、大碗、個'),
(608, '鮭魚味增湯', '鮭魚、水、豆腐、雪白菇、味增、洋蔥', '一、1000、半、半、2~3、1', '608.png', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 1, 1, 0, 4, '<hr><h1>1<h1><p>先備料\\n雪白菇洗淨\\n魚肉用飲用水洗淨\\n豆腐切塊<p> <hr><h1>2<h1><p>冷水時先下洋蔥\\n煮沸時加入 鮭魚、豆腐、雪白菇\\n煮2分鐘後加入味增 先下2匙味道不夠再加<p> <hr><h1>3<h1><p>煮沸即完成<p> <hr>\']', '片、cc、盒、盒、匙、顆'),
(609, '鹹酥雞變身日式丼飯食物零浪費', '鹹酥雞、飯、洋蔥、香菇、奶油、柴魚湯、蛋、蔥、胡椒粉、糖、鹽、海帶絲', '2、2、1、4、1、1、2、1、少許、少許、少許、適量', '609.png', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 4, '<hr><h1>1<h1><p>將洋蔥及香菇切厚片，蔥切蔥花，雞蛋稍微攪拌(不要太均勻)<p> <hr><h1>2<h1><p>先將飯、洋蔥片、香菇片倒入大鍋翻炒<p> <hr><h1>3<h1><p>加入柴魚湯一碗、胡椒粉少許、糖少許、鹽少許，最後倒入鹽酥雞，翻炒後悶4-5分鐘之後，再將蛋倒入鍋內一起悶燒<p> <hr><h1>4<h1><p>盛盤後加入蔥花及適量海帶絲即完成這道美味料理<p> <hr>\']', '人份、人份、顆、片、塊、碗、顆、段、少許、少許、少許、適量'),
(610, '蜂蜜煎年糕', '橄欖油、韓國年糕、蜂蜜、水、冷水', '一點、條、個人喜好添加、可煮即可、蓋過年糕', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>先將水煮滾，年糕放下去燙<p> <hr><h1>2<h1><p>燙過的年糕撈起，放進冷/冰水冰鎮<p> <hr><h1>3<h1><p>倒一點橄欖油熱鍋，靜待一下放入年糕開始煎！<p> <hr><h1>4<h1><p>完成！\\n\\n要吃之前再淋上蜂蜜\\n\\n盡量將他們分開，不然之後會一起黏住<p> <hr>', '一點、條、個人喜好添加、可煮即可、蓋過年糕'),
(611, '韓式辣燉雞【一鍋到底便當盒版】', '台灣桂丁土雞骨腿切塊、白胡椒粉、辣椒、青蔥、蒜末、馬鈴薯切塊、洋蔥切塊、紅蘿蔔切片、砂糖、醬油、韓式辣醬、柴魚高湯', '1、1、0.5、2、2、1、0.5、適量、2、2、1、150', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 5, '<hr><h1>1<h1><p>材料備齊。\\n洋蔥切塊、紅蘿蔔切片備用。\\n馬鈴薯薯切塊可先用冷水浸泡至少30分鐘，去除部分澱粉，蒸煮後能保留口感（若喜歡鬆軟口感的，此步驟可省略）<p> <hr><h1>2<h1><p>雞腿與「韓式辣醬、蒜末、青蔥、白胡椒、醬油及砂糖」混合均勻，放入冰箱醃製30分鐘。<p> <hr><h1>3<h1><p>醃製好的雞腿放入電鍋<p> <hr><h1>4<h1><p>依序放入：洋蔥塊、紅蘿蔔、辣椒，倒入高湯。\\n\\n【第一回燉煮】\\n外鍋1杯水跳起後悶10分鐘。<p> <hr><h1>5<h1><p>攪拌均勻，並放入馬鈴薯切塊。\\n\\n【第二回燉煮】\\n外鍋0.5杯水跳起後悶10分鐘。<p> <hr><h1>6<h1><p>完成！撒上蔥花，就可以端上桌囉！<p> <hr>', '支、小匙、支、支、大顆、顆、顆、適量、大匙、大匙、大匙、cc'),
(612, '韓式炸雞', '雞胸肉、蒜泥、薑泥、咖哩粉、黑胡椒、米酒、鹽、番茄醬、白醋、楓糖醬、蜂蜜、麻油、醬油、韓式辣醬、白芝麻、蔥花', '2、酌量、酌量、三、少許、少許、少許、3、1、1、2、1、1、1、少許、少許', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 0, 0, 5, '<hr><h1>1<h1><p>把雞胸肉切塊，用蒜泥、薑泥、咖哩粉、黑胡椒、米酒、鹽醃漬1小時備用。\\n\\n同時開始調醬料，把韓式辣醬1匙、番茄sauce 、醬油、白醋、楓糖漿、蜂蜜、麻油、攪拌均勻，邊調邊試味道哦。（像我喜歡酸甜一點，辣醬就放比較少）<p> <hr><h1>2<h1><p>把醃過的雞肉沾太白粉靜置5分鐘，在平底鍋中倒入油，熱鍋後煎雞肉煎到表面金黃取出，倒掉多餘的油，把調好的醬汁煮30秒微滾關火，把雞塊倒入鍋中攪拌均勻撒上白芝麻取出，撒上蔥花，完成了！！<p> <hr><h1>3<h1><p>??醬汁裹炸雞的步驟一定要快+熄火，才能維持住炸雞表皮的脆度！下午小點心快速就可以上桌。<p> <hr>', '人份、酌量、酌量、匙、少許、少許、少許、匙、匙、匙、匙、匙、匙、匙、少許、少許'),
(613, '韓式醬牛肉', '牛肉（牛後腿肉）、蒜頭、紅棗、鵪鶉蛋、糯米椒、醬油、水、細砂糖、生薑粉、料酒、芝麻油', '540、6、6、300、100、250、300、2、1/2、1、1/2', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 0, 0, 5, '<hr><h1>1<h1><p>將牛肉泡入冷水約30分鐘，去除血水。<p> <hr><h1>2<h1><p>糯米椒清洗乾淨並去蒂後，切半並用叉子戳洞，方便滷汁入味。<p> <hr><h1>3<h1><p>牛肉去除血水後，切成能滾熟的適當長塊狀。<p> <hr><h1>4<h1><p>將牛肉塊放入鍋中，加水淹過牛肉，開火滾約30分鐘。<p> <hr><h1>5<h1><p>將牛肉塊撈出，並將鍋清洗乾淨，倒入醬油與水，再次放入牛肉塊、紅棗、生薑粉1/2湯匙、細砂糖2湯匙、料酒1湯匙，滾約10-15分鐘。<p> <hr><h1>6<h1><p>再加入鵪鶉蛋、蒜頭與糯米椒，火轉弱繼續滾10分鐘。<p> <hr><h1>7<h1><p>先將牛肉塊撈出至冷水放涼，手撕條狀或用刀切小塊，再放回鍋中滾約5分鐘。<p> <hr><h1>8<h1><p>最後加入芝麻油1/2湯匙即完成。<p> <hr>', 'g、顆、顆、g、g、ml、ml、湯匙、湯匙、湯匙、湯匙'),
(614, '韓式泡菜拉麵升級版', '韓式泡菜拉麵、豬肉、洋蔥、蒜、蔥段、紅蘿蔔絲、高麗菜、泡麵醬包、醬油膏、醬油、米酒、糖、烏醋、胡椒、蒜頭、薑、鹽、太白粉、醬油', '3、一、半、5、適量、適量、1/4、一、3、2、1、1、半、少許、1、少許、少許、少許、少許', 'PNG', 'https://icook.tw/recipes/', 0, 0, 0, 0, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>豬肉先抓醃<p> <hr><h1>2<h1><p>煮滾水將泡麵與蔬菜包丟入，待沸騰後關小火不需理他直接開始炒料<p> <hr><h1>3<h1><p>熱油爆香蒜與洋蔥<p> <hr><h1>4<h1><p>下豬肉拌炒至半熟<p> <hr><h1>5<h1><p>丟入剩下蔬菜稍微拌炒至高麗菜微軟，將泡麵與乾燥蔬菜撈起放入並倒入炒醬\\n拌炒至泡麵都上色就可以起鍋囉<p> <hr>', '包、份、顆、瓣、適量、適量、顆、包、匙、匙、匙、匙、匙、少許、瓣、少許、少許、少許、少許'),
(615, '泡菜大蒜蕗蕎肉串', '整片的泡菜、梅汁蕗蕎、紅酒醋獨蒜、三層肉片、烤肉醬', '片、適量、適量、數片、適量', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>把肉片煎熟塗上烤肉醬放在泡菜上面<p> <hr><h1>2<h1><p>串好以後上面可以放 醃製的獨蒜<p> <hr><h1>3<h1><p>也可以放蕗蕎也可以直接夾在裡面穿過去<p> <hr>', '片、適量、適量、數片、適量'),
(616, '泡菜肉捲', '泡菜整片、五花肉片或者是滷肉', '4、4', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>不沾鍋不要放油 直接開火<p> <hr><h1>2<h1><p>變色以後翻面要不要再加烤肉醬看個人的喜好<p> <hr><h1>3<h1><p>放到整張的泡菜上面捲起來<p> <hr><h1>4<h1><p>要不要切看個人喜好<p> <hr><h1>5<h1><p>也可以包滷肉超好吃<p> <hr><h1>6<h1><p>因為個人喜歡這種整張的所以都是自己做也可以去買現成的<p> <hr>', '片、片'),
(617, '超簡單的韓國海苔飯捲', '飯、麻油、鹽、黃瓜、午餐肉、雞蛋、蟹肉棒、芝麻葉、紅蘿蔔、麻油(抹飯捲用)、鹽(煎蛋用)、海苔', '約600、2、12、3、70、100、3、75、15、50、少許、少許、5', 'PNG', 'https://icook.tw/recipes/', 0, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>準備食材<p> <hr><h1>2<h1><p>飯加鹽調味後，倒麻油揉一揉<p> <hr><h1>3<h1><p>將蟹肉棒、蔬菜、午餐肉切長條<p> <hr><h1>4<h1><p>不煎黃瓜，煎一下紅蘿蔔、午餐肉、蟹肉棒<p> <hr><h1>5<h1><p>雞蛋加一點鹽打散，煎成薄薄的四角形<p> <hr><h1>6<h1><p>煎蛋切長條<p> <hr><h1>7<h1><p>鋪一片海苔，在海苔的2/3鋪一層薄薄的飯<p> <hr><h1>8<h1><p>食材全放上去後，壓實捲起<p> <hr><h1>9<h1><p>海苔末端抹一點水<p> <hr><h1>10<h1><p>切之前抹一點麻油<p> <hr>', 'g、杯米、g、g、g、g、顆、g、片、g、少許、少許、片');
INSERT INTO `allrec` (`ID`, `name`, `ing`, `num`, `img`, `link`, `heartattack`, `pneumonia`, `diabetes`, `Lower_respiratory_tract`, `hypertension`, `Nephritis`, `Liver`, `total`, `type`, `step`, `unit`) VALUES
(618, '韓式料理-韓式炸醬麵', '馬鈴薯、櫛瓜、洋蔥、蒜、五花肉、高麗菜、蠔油、太白粉、醬油、糖、黑豆粉、香油', '2、1、1、2-4、200、1/4、40、40、20、40、40、15', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 0, 0, 1, 0, 0, 5, '<hr><h1>1<h1><p>將沙拉油入鍋，爆香蒜末和洋蔥丁<p> <hr><h1>2<h1><p>加入切丁的豬五花<p> <hr><h1>3<h1><p>放入馬鈴薯丁、碎高麗菜、櫛瓜丁拌炒<p> <hr><h1>4<h1><p>放入40g 的糖<p> <hr><h1>5<h1><p>加入黑豆粉適量，倒水淹過食材，蓋上鍋蓋悶煮20分鐘<p> <hr><h1>6<h1><p>開鍋蓋放入醬油20g 、蠔油40g、太白粉40g拌炒<p> <hr>', '顆、顆、顆、瓣、g、顆、g、g、g、g、g、g'),
(619, '我的韓式泡菜', '大白菜 大概10斤、白蘿蔔切條、紅蘿蔔刨絲、水梨蘋果泥、洋蔥（ 蔥段）韭菜、韓式蝦醬魚露、韓式辣椒粉粗細、糯米糊、蒜薑泥、冷開水加濃鹽巴', '4、一、一、各2、適量、適量、各一、一、適量、一', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>大白菜越緊實越好<p> <hr><h1>2<h1><p>大白菜放到濃鹽巴水裡面抖一抖<p> <hr><h1>3<h1><p>每一片都要抖開小蟲子就會跑出來<p> <hr><h1>4<h1><p>水裡面會有一些小蟲子， 泡過濃鹽巴水以後就可以準備拿重物壓出水， 隔天葉子變軟可以對折的時候就可以撈起來去除水份， 再風乾一下<p> <hr><h1>5<h1><p>煮好的糯米糊要先吃吃看會不會粉粉的\\n糯米糊不要煮太歲因為蘋果你還有水梨泥會稀釋， 醃製的過程白菜還會出水<p> <hr><h1>6<h1><p>把所有的東西調在一起\\n洋蔥韭菜白蘿蔔紅蘿蔔我都會先抓過鹽巴\\n材料店的老闆說加一點白蘿蔔下去味道會更好<p> <hr><h1>7<h1><p>每一片葉子都要抹勻<p> <hr><h1>8<h1><p>我用的是一般裝醬菜的厚袋子，也可以放在缸子裡面， 夏天大概放 12個小時就會出現泡沫， 不喜歡太酸的人就可以放入冰箱喜歡味道酸一點就可以再放一些時間<p> <hr><h1>9<h1><p>這種整顆醃的比較不容易入味所以時間會比較久<p> <hr><h1>10<h1><p>連著白蘿蔔下去<p> <hr><h1>11<h1><p>這是一起醃的白蘿蔔味道很好<p> <hr><h1>12<h1><p>我喜歡用粗細各一半<p> <hr><h1>13<h1><p>之前買這麼大顆的大白菜4顆就13公斤了所以其他調味料都要增加<p> <hr>', '顆、條、條、顆、適量、適量、包、大碗、適量、大鍋'),
(620, '簡易韓式泡菜', '大白菜、切成喜歡大小、鹽巴、蒜頭、弄碎或磨成泥、蔥、切成大蔥花、韓式辣椒粉、韓式辣醬、魚露、糖', '半、4、4、4、2、2、2、2', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 5, '<hr><h1>1<h1><p>用鹽巴把大白菜出水1小時，每30分鐘混和一次<p> <hr><h1>2<h1><p>把白菜沖乾淨，再擠出多餘水分<p> <hr><h1>3<h1><p>把《醬料》的材料伴在一起，跟泡菜混合伴勻<p> <hr><h1>4<h1><p>把泡菜裝在真空容器裡放在冰箱裡，最多可放2週<p> <hr>', '顆、湯匙、瓣、根、湯匙、湯匙、湯匙、茶匙'),
(621, '黃豆芽炒泡菜', '黃豆芽、泡菜、油、鹽、水、薑、辣椒、香油', '2、約200、1.5、適量、半、3、一、一', 'PNG', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>鍋熱防油炒香大蒜、薑片、辣椒?<p> <hr><h1>2<h1><p>放入黃豆芽翻炒均勻讓黃豆芽均勻沾到油，加一小匙鹽、半米杯水翻勻蓋上鍋蓋悶滾約5分鐘?<p> <hr><h1>3<h1><p>待黃豆芽稍微炒軟後，加入泡菜和少許泡菜的湯汁翻炒均勻?<p> <hr><h1>4<h1><p>起鍋前再加入一小匙香油拌勻即可??<p> <hr><h1>5<h1><p>放涼後更好吃??<p> <hr>', '包、g、大匙、適量、米杯、片、根、小匙'),
(622, '【韓綜一日三餐】泡菜炒豬肉', '豬肉、泡菜、蒜頭、二砂糖、醬油', '1、1、適量、少許、適量', 'PNG', 'https://icook.tw/recipes/', 0, 1, 1, 1, 1, 0, 0, 0, 5, '<hr><h1>1<h1><p>先熱鍋炒香豬肉<p> <hr><h1>2<h1><p>豬肉炒到8分熟，放入泡菜跟蒜頭炒香<p> <hr><h1>3<h1><p>少許醬油炒出醬香<p> <hr>', '盒、碗、適量、少許、適量'),
(623, '泡菜炒肉片', '火鍋肉片(豬牛都可)、韓式泡菜、蒜泥、蔥、日式醬油、味霖或糖', '200、一、1.5、大量、適量、斟酌', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>入鍋,鍋中放少許油,\\n放入蒜泥以及蔥白,\\n\\n*請事先將蔥白與蔥綠分開切細,\\n這道料理加入大量的蔥,\\n蔥與泡菜結合,會讓這道料理更加美味<p> <hr><h1>2<h1><p>將蒜泥以及蔥白炒出香氣<p> <hr><h1>3<h1><p>放入已完全解凍的火鍋肉片,\\n*我這次用牛肉片,肉的品項可以自行斟酌<p> <hr><h1>4<h1><p>將火鍋肉片翻炒至3-5分熟(豬肉可以炒至8-9分熟)<p> <hr><h1>5<h1><p>加入泡菜,\\n繼續翻炒,讓肉片與泡菜味道相容,\\n因為肉片很薄,所以翻炒一下子就很容易入味了!<p> <hr><h1>6<h1><p>最後加入大量蔥花,\\n並自行嘗試味道,\\n再自行斟酌是否調味!\\n因為各家泡菜品牌以及各家口味鹹淡度不同!\\n我做後有加一點日式醬油與味霖增加風味<p> <hr><h1>7<h1><p>即可上桌享用,\\n上桌可在上頭撒上白芝麻增加視覺感與風味<p> <hr>', '克、碗、大匙、大量、適量、斟酌'),
(624, '「韓式蛤蜊豬肉嫩豆腐鍋」（非泡菜鍋）', '豬脂肪、粗豬絞肉（或豬五花切塊）、蔥白末、蒜末、洋蔥（切絲狀）、韓國辣椒粉、鹽、牛肉粉、醬油、砂糖、薑泥、韓國香油、飲用水、茅乃舍鰹魚高湯包、蛤蜊、玉米筍、伊比利豬梅花、美白菇、鴻禧菇、嫩豆腐、蛋、蔥花、青辣椒（裝飾用可省略）', '24、180、10、12、1、5.5、3、15.5、35、2、3、10、800、2、630、1、300、1、1、1、3、10、1', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>其實也是剛好冰箱現有食材進行烹煮，如果有透抽、蝦子加入，就是韓式海鮮鍋了喔<p> <hr><h1>2<h1><p>洋蔥切絲、鴻禧菇去尾端剝小塊、美白菇去尾端剝小塊、青辣椒斜刀切段及玉米筍斜刀對切<p> <hr><h1>3<h1><p>豬脂肪乾鍋煸炸出豬油，且呈微焦金黃色，不要煸過黑，會影響鍋物口感<p> <hr><h1>4<h1><p>加入絞肉炒至反白變熟，且有肉香味<p> <hr><h1>5<h1><p>加入蒜末、蔥白末翻炒均勻，飄出蒜香味，加入洋蔥絲，炒至微透明狀態<p> <hr><h1>6<h1><p>加入韓國辣椒粉、鹽、牛肉粉、醬油、砂糖、薑泥及韓國香油，拌炒均勻<p> <hr><h1>7<h1><p>加入飲用水煮滾後，加入高湯包、玉米筍及蛤蜊，煮滾約40秒至1分鐘<p> <hr><h1>8<h1><p>加入豬肉片、鴻禧菇、美白菇、豆腐，繼續煮至肉片熟了（此時蛤蜊應該全開了）<p> <hr><h1>9<h1><p>打入蛋、加入蔥花，加熱至蛋白凝結,，將高湯包撈起，即可關火\\n\\n準備韓式石鍋<p> <hr><h1>10<h1><p>舀入韓式石鍋後，稍微在瓦斯爐加熱10秒，使陶鍋保持一點溫度蓄溫，撒上青辣椒，即可上桌享用嘍\\n\\n??沒有石鍋的人可以在步驟9撒上青辣椒或省略裝飾就可以算完成了<p> <hr>', '克、克、克、克、顆、克、克、克、克、克、克、克、克、包、克、盒、克、包、包、條、顆、克、根'),
(625, '雙人部隊鍋/剩食變盛食', '年糕、香菇、剩飯、牛肉片、蔥、蒜、豆腐、雞肉剩、雞蛋、泡菜、起司、醬油、沙拉油、砂糖、韓式辣椒醬', '5、2、1、2、1、4、半、80、1、100、100、2、2、1、1', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 0, 0, 5, '<hr><h1>1<h1><p>將所有材料備齊。（很醜的剩飯。。除了剩還包括沒吃完的部份）<p> <hr><h1>2<h1><p>將剩於年糕拿出、香菇洗好切片、肉片擺出、起司切塊（冰冷凍的關係）等。<p> <hr><h1>3<h1><p>水300CC煮沸加入年糕，煮滾即關火。可用熱水瓶熱水煮較快。<p> <hr><h1>4<h1><p>把水倒掉，年糕放一邊留出空間來。<p> <hr><h1>5<h1><p>放入油、蒜、蔥、香菇、生肉爆香炒。<p> <hr><h1>6<h1><p>加入2匙醬油，拌炒。<p> <hr><h1>7<h1><p>倒入300CC水入鍋中，並放入剩食雞肉。<p> <hr><h1>8<h1><p>放入半塊切片的豆腐，加入1大匙韓式辣椒醬及冰糖。<p> <hr><h1>9<h1><p>把它拌勻。<p> <hr><h1>10<h1><p>放入泡菜。<p> <hr><h1>11<h1><p>將起司塊舖在最上端。<p> <hr><h1>12<h1><p>起司融化後加1顆蛋在上方。<p> <hr><h1>13<h1><p>完成。<p> <hr>', '個、朵、大碗、小片、根、小顆、個、克、顆、克、克、匙、匙、小匙、大匙'),
(626, '綠捲鬚萵苣蝦仁韓式煎餅', '綠捲鬚萵苣、去殼白蝦、韓國煎餅粉、食用油', '一整、13、50、35', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>取一整株綠捲鬚萵苣，切除底部、清洗瀝乾、切段。冷凍蝦13隻無需解凍，沖洗擦乾。<p> <hr><h1>2<h1><p>調配200ml韓國不倒翁煎餅粉粉漿，綢度如生雞蛋蛋黃黏稠感即可。將步驟1萵苣均勻攪拌混合。<p> <hr><h1>3<h1><p>28cm鑽石不沾鍋平底鍋加入20cc食用油，開文火。<p> <hr><h1>4<h1><p>先將清洗擦乾後冷凍蝦平均擺放入鍋，再將步驟2混合粉漿的蔬菜全下鋪擺圓形。<p> <hr><h1>5<h1><p>先將清洗擦乾後冷凍蝦平均擺放入鍋，再將步驟2混合粉漿的蔬菜全下鋪擺圓形。<p> <hr><h1>6<h1><p>撒上綜合香料鹽（黑白炒芝麻、海鹽片、碎蒜片乾、碎洋蔥乾、罌粟子）蓋上大於煎餅尺寸圓盤，倒扣後再翻面入鍋（底面和上面顛倒）。<p> <hr><h1>7<h1><p>撒上綜合香料鹽（黑白炒芝麻、海鹽片、碎蒜片乾、碎洋蔥乾、罌粟子）蓋上大於煎餅尺寸圓盤，倒扣後再翻面入鍋（底面和上面顛倒）。<p> <hr><h1>8<h1><p>原本底面的蝦面成為上面，撒上綜合香料鹽。<p> <hr><h1>9<h1><p>沿著鍋緣再倒入15cc食用油，繞著煎餅讓原本朝上面無蝦的面透過油煎出酥脆外衣。<p> <hr><h1>10<h1><p>蓋上鍋蓋或是大於煎餅尺寸的圓盤，煎至聞到餅香即可起鍋。蓋上鍋蓋的目的就是透過悶蒸的水氣讓蔬菜間隙的粉漿熟透。<p> <hr><h1>11<h1><p>起鍋時蝦面朝上，再以菜刀平均切出6~8等分即可。<p> <hr><h1>12<h1><p>步驟5和6兩面乾煎時撒上綜合調味料的步驟，也可以在調配粉漿時加入調味。乾煎時再兩面各別調味是避免粉漿調味時容易讓蔬菜接觸鹽分更釋放水份造成煎餅的濕黏。<p> <hr>', '株、隻、g、ml'),
(627, '韓式烤豬肉', '豬里肌肉、油、蒜片、生菜、香油、韓式泡菜、芝麻、水梨、開水、醬油、蒜頭、洋蔥、糖、胡椒粉', '5、適量、適量、適量、適量、適量、少許、0.5、1、1、15、0.5、0.5、0.5', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 1, 0, 5, '<hr><h1>1<h1><p>將水梨、洋蔥、開水、糖、醬油、胡椒粉和蒜頭一起倒入調理機充分打勻<p> <hr><h1>2<h1><p>將打好的醬汁過濾到不必要的果渣\\n*剛打好的醬汁會有很多泡泡，靜置一段時間後即可消除<p> <hr><h1>3<h1><p>將肉片放入醬汁做醃漬，接著放入冰箱靜置一天讓肉片充分入味\\n*我買的里肌肉片約0.8- 1公分厚，故醃漬時間較久<p> <hr><h1>4<h1><p>起鍋下油將肉片煎熟<p> <hr><h1>5<h1><p>將肉片剪好、灑上芝麻、蒜片，吃得時候將肉片沾些芝麻香油，並與蒜片、泡菜一起包入生菜\\n*個人覺得芝麻香油在這道料理很重要，一定要放呀<p> <hr>', '片、適量、適量、適量、適量、適量、少許、米杯、米杯、米杯、g、米杯、米杯、茶匙'),
(628, '韓國炸雞美乃滋蓋飯', '飯、去骨後的炸雞、雞蛋、麻油、美乃滋、炸豬排醬（照燒醬更好）、鹽、海苔', '約325、1、200、3、少許、少許、少許、少許、1', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>準備食材<p> <hr><h1>2<h1><p>去骨盡量不讓脆皮脫離<p> <hr><h1>3<h1><p>將去骨的炸雞切塊<p> <hr><h1>4<h1><p>用小火一直拌炒，做英式炒蛋<p> <hr><h1>5<h1><p>用微波爐加熱一下炸雞\\n飯裡加海苔、鹽、麻油攪拌均勻<p> <hr><h1>6<h1><p>飯上放英式炒蛋，再放炸雞<p> <hr><h1>7<h1><p>淋上炸豬排醬和美乃滋<p> <hr>', 'g、杯米、g、顆、少許、少許、少許、少許、小包'),
(629, '韓式拌飯', '紅蘿蔔、小黃瓜、青菜、泡菜/結頭菜、雞蛋、雞腿肉、香油、味霖、醬油', '半、半、1、適量、1、一、適量、適量、適量', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 0, 0, 5, '<hr><h1>1<h1><p>紅蘿蔔切絲加入香油拌炒<p> <hr><h1>2<h1><p>小黃瓜切絲加入香油拌炒<p> <hr><h1>3<h1><p>雞腿肉炒香後依序加入醬油拌炒後加少許水、味霖、鹽巴煮至焦糖化即可。<p> <hr><h1>4<h1><p><p> <hr><h1>5<h1><p>所有食材依自己喜歡的色彩擺盤，再加顆半熟蛋更添美味。<p> <hr>', '根、根、株、適量、顆、盒、適量、適量、適量'),
(630, '韓式部隊鍋', '豆腐、高麗菜、高湯粉或塊、醬油、新松韓式辣醬（全聯有）、韓式泡菜、蛤蜊、韓國泡麵（麵體）、火鍋用起司、金針菇、豬五花肉、雞蛋', '兩、半、適量、適量、適量2~3、適量、適量、適量、一、二、一、兩', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>將豆腐 、泡菜、金針菇、高麗菜分區擺在鍋內加水醃到食材2/3處<p> <hr><h1>2<h1><p>煮滾加入韓式辣醬二到三湯匙（因個人口味調整）、適量高湯粉、醬油、砂糖<p> <hr><h1>3<h1><p>加入蛤蜊、雞蛋煮熟<p> <hr><h1>4<h1><p>接著煮泡麵，直接放在中間，稍微煮一下軟化以後直接把起司大方的灑上去，然後蓋鍋蓋燜個一到兩分鐘，然後開蓋享用！\\n（看個人喜歡吃軟麵或是Q麵）<p> <hr><h1>5<h1><p>可以先盛一碗起來滿滿享受，再把水煮滾開始涮豬五花！<p> <hr>', '塊、棵、適量、適量、適量湯匙、適量、適量、適量、包、把、盒、顆'),
(631, '韓式雜菜粉絲(適合夏天吃)', '韓國土豆粉(一般的也行)、菠菜、木耳(先泡水)、洋蔥(切絲)、鴻禧菇、紅蘿蔔(切絲)、香菇(泡水泡軟再切絲)、牛絞肉、醬油、香油、白胡椒', '250、少量、5、一、半、半、4至5、200、少量、少量、微量', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>將食材前置分類準備如下：\\n(蔬菜)\\n1.泡水後切絲→木耳、香菇。\\n2.需切絲→紅蘿蔔、洋蔥。\\n3.洗淨切段→菠菜、鴻禧菇。\\n(其它)\\n1.牛絞肉→先醃制15cc醬油/10cc香油/白胡椒(少許)。\\n2.韓國冬粉→先泡冷水(泡過比較好煮)。<p> <hr><h1>2<h1><p>將食材一一煮熟(每次煮一種食材就好)\\n1.炒熟蔬菜→香菇、鴻禧菇、洋蔥?每次食材煮熟後加入醬油/香油/白芝麻(各少許)。\\n2.燙熟蔬菜→紅蘿蔔、木耳、菠菜(菠菜煮熟後泡冷水再擰乾)蔬菜燙熟後加入醬油/香油/白芝麻(各少許)。\\n3.牛絞肉→放入平底鍋炒熟即可\\n★找個大盆或碗將煮好食材放入，如上圖<p> <hr><h1>3<h1><p>煮一鍋熱水，將韓國土豆粉煮熟後，先泡冷水(土豆粉才不會黏在一起)後，撈起加入醬油/香油/白芝麻(各少許)，放入大盆/碗中。<p> <hr><h1>4<h1><p>帶拋棄式手套，將所有食材混和在一起，依照自己口味在加入適量的醬油/香油/白芝麻，完成後即可食用，剩餘的可放入冰箱冷藏。<p> <hr>', 'g、少量、朵、顆、盒、條、朵、g左右、少量、少量、微量'),
(632, '韓式涼拌菠菜(簡單)', '菠菜\\xa0、蒜末、白芝麻\\xa0、醬油\\xa0、糖、鹽\\xa0、香(麻)油', '500、一、適量、適量、少許、少許、少許', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 1, 1, 0, 5, '<hr><h1>1<h1><p>將買回來的菠菜去掉蒂頭,葉子和莖分開,再分別清洗乾淨.\\xa0<p> <hr><h1>2<h1><p>燒一鍋水,水滾後先將洗淨的菠菜莖放入,煮約30秒.\\xa0<p> <hr><h1>3<h1><p>菠菜莖不用取出,再加入菠菜葉,再煮約30秒,即可將燙過的菠菜全數撈起.\\xa0<p> <hr><h1>4<h1><p>一旁先備好冰水.\\xa0<p> <hr><h1>5<h1><p>將撈起來的菠菜全部放入冰水中.\\xa0<p> <hr><h1>6<h1><p>確保所有燙過的菠菜都浸到冰水裏.\\xa0<p> <hr><h1>7<h1><p>浸到冰水裏的菠菜涼了就可以撈出,擠出水份放入盤中,剪成小段備用.另外準備蒜末和白芝麻.\\xa0<p> <hr><h1>8<h1><p>將菠菜,蒜末,和白芝麻放入鍋中,加入醬油,少許的糖和鹽,攪拌均勻,嚐嚐味道,若是覺得OK,再淋上一些香油即完成.\\xa0<p> <hr><h1>9<h1><p>將拌好的菠菜盛到盤中,就可享用.\\xa0<p> <hr>', '克、小碟、適量、適量、少許、少許、少許'),
(633, '韓式泡菜炒肉', '韓式泡菜、豬肉(五花肉+里豬肉）各半、蔥花、鰹魚醬油、米酒、香油', '一、1、隨意、一、2、隨意', 'PNG', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 0, 0, 0, 5, '<hr><h1>1<h1><p>準備泡菜，可以切小塊點<p> <hr><h1>2<h1><p>準備豬肉\\n五花肉和里豬肉各一半，加入2湯匙米酒，一湯匙鰹魚醬油，和香油隨意，充分揉合，靜置5分<p> <hr><h1>3<h1><p>下油熱鍋後，下蔥花爆香<p> <hr><h1>4<h1><p>再放入肉片翻炒到8分熟<p> <hr><h1>5<h1><p>加入泡菜繼續炒到肉熟<p> <hr><h1>6<h1><p>完成美味的韓式泡菜炒肉<p> <hr>', '包、份、隨意、湯匙、湯匙、隨意'),
(634, '黃金泡菜炒豬肉&韓式泡菜豬肉鍋', '黃金泡菜、豬肉（神農豬）、蒜碎、辣椒、洋蔥、蔥花、米酒、蛤蠣、韓式辣椒粉、香油、醬油', '適量、一、適量、半、半、適量、適量、半、三、一、一', 'PNG', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 0, 0, 5, '<hr><h1>1<h1><p>熱油鍋放入洋蔥炒至半透明\\n在加入蒜碎跟辣椒圈爆香\\n豬肉炒至六七分熟加入黃金泡菜\\n跟些許湯汁米酒炒至收汁<p> <hr><h1>2<h1><p>把一半呈盤再灑上一點蔥花\\n就完成了黃金泡菜炒豬肉<p> <hr><h1>3<h1><p>另一半原鍋加入水\\n煮沸後下蛤蠣、韓式辣醬、韓式辣椒粉、醬油\\n放豆腐青菜跟蛋什麼的也可以\\n起鍋前加點香油白胡椒就完成了<p> <hr>', '適量、盒、適量、根、顆、適量、適量、斤、湯匙、湯匙、湯匙'),
(635, '泡菜炒年糕肉片', '韓式泡菜、年糕條、梅花肉片、蒜、蔥、醬油、水', '120、半、120、2、1、1、0.5-1', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 5, '<hr><h1>1<h1><p>適量的油先爆香蒜頭\\n然後放入肉片炒至變白\\n加入一大匙醬油炒出香味<p> <hr><h1>2<h1><p>放入泡菜略為拌炒<p> <hr><h1>3<h1><p>然後放入年糕並加入水\\n煮到年糕變軟起鍋前加入青蔥<p> <hr>', 'g、包、g、粒、根、大匙、米杯'),
(636, '韓式紫菜包飯', '紫菜、午餐肉、雞蛋、韓式醃蘿蔔、蟹柳、白飯、麻油、鹽', '2-3、1、數隻、1、適量、適量、適量、適量', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>材料準備<p> <hr><h1>2<h1><p>把午餐肉切好就可以煎香<p> <hr><h1>3<h1><p>把蟹柳煎香<p> <hr><h1>4<h1><p>雞蛋煎成蛋卷<p> <hr><h1>5<h1><p>白飯煮好放到大碗中加入麻油<p> <hr><h1>6<h1><p>蛋卷降溫後可以切條<p> <hr><h1>7<h1><p>預備壽司卷用席，紫菜＞白飯＞餡料<p> <hr><h1>8<h1><p>把飯捲起來<p> <hr><h1>9<h1><p>捲好後，切成平均厚度<p> <hr><h1>10<h1><p>完成！??方便大家觀看，製作過程已放到YouTube／https://youtu.be/6zGs0atpRyc\\n有興趣可以看一下(?????????)<p> <hr><h1>11<h1><p>更多沙先生分享平台：\\nFb粉絲專頁 https://www.facebook.com/mrshacook\\nIG @mrshacook\\n更多製作過程，訂閱我的Youtube喔\\nhttps://youtube.com/mrshacook<p> <hr>', '張、罐、數隻、包、適量、適量、適量、適量'),
(637, 'DIY韓國31冰淇淋櫻桃饗宴', '櫻桃、糖、水、檸檬汁、鮮奶油、糖、蛋黃、牛奶、香草油', '150、50、55、8、150、45+45、2、100、3', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 5, '<hr><h1>1<h1><p>準備食材<p> <hr><h1>2<h1><p>將櫻桃洗乾淨，接著切半拔籽<p> <hr><h1>3<h1><p>將櫻桃剁碎<p> <hr><h1>4<h1><p>把櫻桃糖漿材料倒入鍋子，邊攪拌邊用中火煮15分鐘左右<p> <hr><h1>5<h1><p>將稍微冷卻的糖漿用濾網過濾果肉<p> <hr><h1>6<h1><p>倒入鮮奶油和糖打發至80%左右<p> <hr><h1>7<h1><p>分開另外倒入糖和蛋黃攪拌<p> <hr><h1>8<h1><p>在7)倒入牛奶和香草油攪拌<p> <hr><h1>9<h1><p>將所有東西混合，並放入櫻桃果肉和櫻桃糖漿輕輕攪拌<p> <hr><h1>10<h1><p>冷凍2小時後，用叉子刮一次，再冷凍1小時，再刮一次。\\n再冷凍2~3小時以上即完成！<p> <hr>', 'g、g、ml、ml、g、g、ea、g、ml'),
(638, '韓式辣烤雞翅', '雞翅、薑泥、蒜末、米酒、醬油、韓式辣椒醬、蜂蜜、水、韓式辣椒粉、鹽 (已加醬油、也可不加)', '600、1、2、2、2. 5、3、3.5、150、2、少許', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 0, 0, 5, '<hr><h1>1<h1><p>1.雞翅洗淨後以叉子正反兩面戳洞幫助後續醃漬入味<p> <hr><h1>2<h1><p>取一保鮮盒(或大碗)放入雞翅；倒入其餘所有醃漬醬汁抓醃均勻；放入冰箱冷藏醃漬約至少2小時以上(可前一天晚上醃隔天烤更入味)<p> <hr><h1>3<h1><p>烤盤底部鋪放錫箔紙將雞翅排放於烤盤；上面蓋上一層錫箔紙；放入免預熱阿拉丁烤箱以200度C烤約10分鐘；<p> <hr><h1>4<h1><p>掀開上面錫箔紙將雞翅翻面再稍微補刷醬汁一下；再以240~260度C烤約5分鐘烤至表面上色就可以出爐囉??<p> <hr><h1>5<h1><p>紅吱吱香噴噴火辣出爐!<p> <hr>', 'g、小匙、瓣、大匙、小匙、大匙、大匙、ml、大匙、少許'),
(639, '韓國麵包(小V版)', '韓國麵包粉、無鹽奶油、全蛋、奶粉、醬油、鮮奶、水、黑芝麻', '200、35、1、5、4、25、60、15', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 5, '<hr><h1>1<h1><p>無鹽奶油提早30分鐘放於室溫軟化，\\n奶油切小塊狀，全部材料入鍋<p> <hr><h1>2<h1><p>用刮刀拌勻即可，蓋濕布或保鮮膜醒15分鐘<p> <hr><h1>3<h1><p>約分為32等分(每顆約13g),\\n格子烤盤預熱後刷點油，一次放8顆，在每顆上噴水再蓋上，烤5~6分鐘，外層呈現咖啡色即可<p> <hr><h1>4<h1><p>取出後放於烤架放涼<p> <hr><h1>5<h1><p>外酥內Q的韓國麵包完成囉<p> <hr>', 'g、g、顆、g、g、g、g、g'),
(640, '韓式梅花豬', '梅花肉片、醬油、味醂、白醋、咖哩粉（非必要、水', '5-10、2、1、0.4、少許、3-4', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 5, '<hr><h1>1<h1><p>梅花肉片事先退冰<p> <hr><h1>2<h1><p>製作醃料\\n依照水/醬油/味醂/白醋 8:4:2:1 的比例來調醃料\\n水的比例可依照自己的口味調整<p> <hr><h1>3<h1><p>將醃料與梅花肉片放置保鮮盒 幫梅花豬按摩 確保醃料完全覆蓋肉片<p> <hr><h1>4<h1><p>放置冰箱醃2-3小時<p> <hr><h1>5<h1><p>平底鍋不用倒油 直接下去煎 煎至肉色金黃起鍋<p> <hr><h1>6<h1><p>配生菜吃很好吃喔??<p> <hr>', '片、匙、匙、匙、少許、匙'),
(641, 'lanni韓式拌飯', '蛋、青菜（青江菠菜都可）、鮮菇（切片）、熟烤肉片或肉醬、紅蘿蔔（切絲）、白飯', '1、隨意、3、2、1、1', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>燒滾一小鍋水,將青菜燙熟,撈出過冷水,擰乾水分,切段,拌入麻油,鹽,芝麻備用！<p> <hr><h1>2<h1><p>鍋中倒一匙油將蛋白和蛋黃分開煎成蛋皮,切絲備用<p> <hr><h1>3<h1><p>鍋中倒入芝麻油將紅蘿蔔絲炒軟,以鹽調味,備用！<p> <hr><h1>4<h1><p>乾鍋將菇炒至軟再倒入芝麻油和蒜末,加些鹽調味,拌勻即可盛出備用！\\n（菇可選多種或一樣都可以）<p> <hr><h1>5<h1><p>1烤肉片作法：火鍋肉片用韓國烤肉醬醃約20分鐘,再和洋蔥拌炒熟,加些芝麻,備用！\\n2辣肉醬作法：絞肉用油拌炒變色加韓國醬油,辣椒醬,辣椒粉,糖,一些水拌炒一會即可盛出備用！<p> <hr><h1>6<h1><p>盛碗白飯將備好的料一一鋪上,就可開始享用囉~??<p> <hr>', '個、隨意、朵、大匙、小條、碗'),
(642, '韓國泡菜炒飯', '冷飯、老泡菜、午餐肉、雞蛋、食用油、辣椒醬、糖、麻油、芝麻、辣椒粉、海苔、泡菜汁(可無)', '約325、250、100、2、少許、1、0.5、0.5、少許、1、1、少許', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 5, '<hr><h1>1<h1><p>準備食材<p> <hr><h1>2<h1><p>將午餐肉切成小方塊，泡菜切成寬1cm細長條<p> <hr><h1>3<h1><p>倒一點食用油，先炒午餐肉<p> <hr><h1>4<h1><p>再炒泡菜<p> <hr><h1>5<h1><p>倒入冷飯均勻炒拌<p> <hr><h1>6<h1><p>倒一點泡菜汁更好吃<p> <hr><h1>7<h1><p>把辣椒醬、麻油、糖、辣椒粉全加進去並均勻炒拌<p> <hr><h1>8<h1><p>煎半熟荷包蛋放至泡菜炒飯上<p> <hr><h1>9<h1><p>剪一些海苔撒上<p> <hr>', 'g、g、g、顆、少許、T、t、T、少許、t、小包、少許'),
(643, '韓式風味烤雞', '去骨雞腿肉、秋葵、韓式烤肉醬、黑胡椒、鹽、義式香料粉', '2、1、4、適量、適量、適量', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>備妥食材<p> <hr><h1>2<h1><p>雞腿切塊。倒入烤肉醬，適量黑胡椒，用手抓拌後靜置5分鐘。<p> <hr><h1>3<h1><p>秋葵洗淨備用。<p> <hr><h1>4<h1><p>醃好的雞腿肉先倒到烤盤上。<p> <hr><h1>5<h1><p>將秋葵倒入醃肉的鍋內，再加入適量黑胡椒，鹽跟義式香料粉調味，用手抓拌一下即可。\\n\\n沒有香料粉可省略。<p> <hr><h1>6<h1><p>將全部食材均勻鋪在烤盤上。<p> <hr><h1>7<h1><p>烤箱180度烤18分鐘即完成。<p> <hr><h1>8<h1><p>盛盤即可享用囉。<p> <hr>', '片、盒、大匙、適量、適量、適量'),
(644, '韓式豬肉燴飯', '高麗菜、紅蘿蔔、火鍋豬肉片、蔥、蒜頭、水、醬油、糖、雞粉、韓國辣椒粉、地瓜粉', '1/4、1/2、1、兩、兩、200、20、2、1/2、3、1/2', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 5, '<hr><h1>1<h1><p>準備食材<p> <hr><h1>2<h1><p>蒜頭切碎，蔥切段，紅蘿蔔半根切片，高麗菜1/4切片<p> <hr><h1>3<h1><p>熱鍋淋油，爆香蒜頭蔥段後，高麗菜及豬肉一起下鍋拌炒<p> <hr><h1>4<h1><p>拌炒至豬肉半熟後，加醬油，後加水、糖、雞粉、韓國辣椒粉，拌勻後，等鍋內湯汁滾及高麗菜軟化<p> <hr><h1>5<h1><p>收汁後淋點地瓜粉水勾芡，準備一碗白飯裝盤，將成品淋上及大功告成<p> <hr>', '顆、顆、盒、根、粒、cc、cc、茶匙、茶匙、茶匙、茶匙'),
(645, '減醣料理：零失敗的韓式泡菜豬肉鍋', '韓式泡菜、嫩豆腐、豬肉片、金針菇、洋蔥、文蛤、青蔥', '適量、一、適量、半、半、數顆、1', 'PNG', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>準備上述食材，其實我覺得重點就是韓式泡菜、肉、洋蔥。先熱鍋同時可以切洋蔥！其他食材看個人喜好加入！<p> <hr><h1>2<h1><p>熱鍋完加些油，然後下大蒜還有切好的洋蔥，炒到香氣出來時，再下豬肉或雞肉（看個人喜好）炒。同時間可以洗加切金針菇還有豆腐！<p> <hr><h1>3<h1><p>豬肉差不多熟的時候可以加泡菜下去炒，順便試味道～<p> <hr><h1>4<h1><p>然後加煮過的水或高湯都可以，味道不夠就繼續加泡菜到自己喜歡的味道，再放文蛤、金針菇、豆腐煮到滾！喜歡的話也可以加顆雞蛋，憑個人的喜好！<p> <hr><h1>5<h1><p>等到湯滾之後，就可以上桌囉！<p> <hr>', '適量、盒、適量、把、個、數顆、根'),
(646, '韓式泡菜海鮮煎餅', '蝦仁、小卷、牡蠣、韓式泡菜、韭菜、青蔥、蒜頭、普通麵粉、太白粉、水、雞蛋、鹽巴', '60、60、3、120、40、40、30、100、30、120、1、2', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>首先泡菜切碎\\n韭菜青蔥蒜頭都切碎備用<p> <hr><h1>2<h1><p>海鮮料燙熟後切小塊<p> <hr><h1>3<h1><p>麵糊調好後下所有配料攪拌均勻<p> <hr><h1>4<h1><p>取小平底鍋下一層薄油<p> <hr><h1>5<h1><p>此份量約可做兩片\\n小火煎3分鐘<p> <hr><h1>6<h1><p>翻面後煎約五分鐘起鍋盛盤<p> <hr><h1>7<h1><p>煎餅裡的泡菜跟鹹味已經很夠不用再刷醬汁\\n在家可以輕鬆完成<p> <hr>', 'g、g、顆、g、g、g、g、g、g、g、顆、茶匙'),
(647, '韓式辣炒章魚五花肉', '小章魚、五花肉（全聯購入）、洋蔥（小）、黃豆芽（全聯購入）、青蔥、蒜頭、韓式辣椒粉（細）、韓式辣椒醬、味霖、砂糖、醬油、水、黑胡椒', '半、一條、1、一、2、3、1.5、1、2、1.5、1、2、少許', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>小章魚從市場買回來後，先沖水手搓把黏液沖乾淨，然後將頭翻開把頭裡面的內臟及墨囊取出，這樣成品才不會被墨汁染黑。\\n處理完畢後再次沖水，瀝乾水分備用。<p> <hr><h1>2<h1><p>講洋蔥切粗絲、蔥切段、蒜頭磨成蒜泥，黃豆芽洗淨瀝乾備用。\\n將醬汁部分（黑胡椒除外）全部加入小碗攪拌均勻備用。<p> <hr><h1>3<h1><p>熱鍋加入五花肉煎至表面稍微上色即可，不需要至金黃，若鍋中豬油的量不多就倒點食用油或是香油，先爆香洋蔥及蔥白。\\n（如果豬油很多就不用再放油了喔～<p> <hr><h1>4<h1><p>洋蔥及蔥白爆香到有香味的時候加入小章魚和醬汁拌兩拌，這時候如果覺得醬汁很稠不要擔心，馬上放入黃豆芽，並將五花肉和小章魚往上攪拌讓黃豆芽在下方蓋上鍋蓋加熱。黃豆芽會開始出水。<p> <hr><h1>5<h1><p>等到鍋裡的材料都開始滾的時候，嚐一下味道再依自己喜好調整鹹淡，如果覺得水分不夠多也可以再補一點，最後放入蔥綠還有黑胡椒粉，再拌一拌就完成囉！\\n盛盤後，如果家裡有白芝麻，可以灑一點上去～<p> <hr>', '斤、半、顆、包、根、瓣、匙、匙、匙、匙、匙、匙、少許'),
(648, '韓式關東煮|魚餅火鍋(不辣)', '韓國魚餅(糕)、章魚竹輪、黃金魚蛋、玉米筍、海帶結、白蘿蔔、洋蔥、蔥、紅辣椒(不辣)、綠辣椒(不辣)、新鮮香菇', '3、3、1、4、5、1/2、1/2、2、1、1、5', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>準備好所有食材\\n任意選擇自己喜歡的魚餅或蔬菜: )<p> <hr><h1>2<h1><p>製作高湯:\\n\\n2湯匙鯷魚粉 (如果沒有，可以使用去除內臟的小魚乾熬高湯)\\n2湯匙味醂、3湯匙醬油、切片白蘿蔔\\n1茶匙牛肉粉 (也可以使用鰹魚粉、鮮味炒手或是鹽巴)\\n5顆蒜頭做成蒜泥 (用篩子過濾到湯裡)\\n?顆洋蔥直接放到湯裡<p> <hr><h1>3<h1><p>在煮高湯的同時，將需要切的蔬菜切一切\\n把要串的魚餅、蔬菜串起來<p> <hr><h1>4<h1><p>撈起湯裡浮起的泡沫\\n加入1片乾燥海帶(昆布)湯裡\\n\\n倒入一碗柴魚片(用篩子過濾到湯裡)<p> <hr><h1>5<h1><p>高湯煮好之後\\n用篩子過濾，加到食材裡一起煮\\n食材煮熟後，就可以享用囉~\\n\\n為了節省時間: 比較大塊的白蘿蔔，我事先用電鍋煮好\\n\\n\\n沾醬:\\n綠辣椒+蔥+1湯匙醬油+水+適量哇沙米\\n\\n沾著沾醬吃，非常好吃喔!<p> <hr>', '片、個、包、根、個、條、顆、根、根、根、顆'),
(649, '韓式辣醬炒飯', '冷飯、蛋、韓式辣醬、起司片、醬油', '1、1、1、1、適量', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 5, '<hr><h1>1<h1><p>先下油熱鍋\\n下飯把飯炒的粒粒分明\\n在中間放油 將蛋打入中間\\n等蛋底面熟了在和飯拌炒<p> <hr><h1>2<h1><p>加入韓式辣醬 醬油拌勻\\n放一片起司，起司可以拌一拌或直接平鋪起鍋<p> <hr>', '碗公、顆、匙、片、適量'),
(650, '偽韓式炸雞(免炸)', '雞腿肉(切塊)、片栗粉或太白粉、白芝麻、酒、香油、蒜泥、酒、韓式辣醬、糖、醋、醬油、米霖', '300、1~2、隨意、1、1、1、1、1~2、1/2、2/3、1、1', 'PNG', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>雞肉放入調理盆中，加入醃料揉捏，靜置5分鐘<p> <hr><h1>2<h1><p>鍋中放一點油，開中火，雞肉撒上片栗粉抓勻<p> <hr><h1>3<h1><p>雞皮向下，放入鍋中，煎約2分鐘至略焦狀，翻面略煎後蓋鍋煎約4分鐘至雞肉熟。(可再翻面煎一下，讓外皮更焦脆)<p> <hr><h1>4<h1><p>將多餘的油吸或倒出、加醬料煮滾攪拌至美一塊肉都沾到醬汁<p> <hr><h1>5<h1><p>盛盤、撒上芝麻即完成。<p> <hr>', 'g、匙、隨意、大匙、大匙、小匙、大匙、大匙、小匙、小匙、小匙、小匙'),
(651, '快速泡菜五花肉', '薄片五花肉、你愛的韓式泡菜、香菇素蠔油、蒜逃、金針菇', '盒、適量、適量、辦、份', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p><p> <hr><h1>2<h1><p>蒜逃拍碎下油煎\\n五花肉下去一面熟時\\n可下金針菇《我是下一包》\\n醬油膏少許\\n泡菜湯少許\\n待快熟時\\n泡菜《一碗白飯的量或者多一點》下去翻炒\\n即可上菜<p> <hr><h1>3<h1><p>喜歡脆感泡菜的人\\n可以最後再加泡菜\\n快速媽咪料理<p> <hr>', '盒、適量、適量、辦、份'),
(652, '韓國美食超簡易《韓式嫩豆腐鍋》食譜', '豆腐、豬肉(帶點油脂)、雞蛋、蔥、蒜頭、洋蔥', '1、適量、1、2、4、1/2', 'PNG', 'https://icook.tw/recipes/', 0, 0, 0, 0, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>準備好所有食材\\n切蔥花、切洋蔥丁、切綠辣椒、蒜頭切碎<p> <hr><h1>2<h1><p>2湯匙食用油，1湯匙韓國麻油，蔥\\n炒出蔥油，放入帶點油脂的豬肉一起炒、接著炒洋蔥<p> <hr><h1>3<h1><p>加入2湯匙韓式辣椒粉、1湯匙醬油、?茶匙鹽巴+ 1茶匙糖、蒜泥\\n炒到肉變色之後，加水蓋過食材<p> <hr><h1>4<h1><p>將捏碎的豆腐加入鍋裡<p> <hr><h1>5<h1><p>加入1茶匙牛肉粉或鮮味炒手調味、1顆雞蛋、綠辣椒、蔥綠\\n煮滾後，就可以和白飯一起享用<p> <hr>', '塊、適量、顆、根、顆、顆'),
(653, '零廚藝韓式泡菜冷豆腐', '嫩豆腐或板豆腐、韓式泡菜、小黃瓜絲、糖醋蘿蔔絲、白芝麻、韓式泡菜湯汁、柴魚醬油', '1、40、20、20、少許、2、1', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>豆腐以開水清洗後用廚房紙巾拭乾水份，醬汁材料調勻，小黃瓜切絲備用，糖醋蘿蔔絲瀝乾湯汁備用。\\n【糖醋蘿蔔絲】作法連結：https://icook.tw/recipes/340258<p> <hr><h1>2<h1><p>在豆腐上舖上韓式泡菜，擺上小黃瓜絲，點綴些許糖醋蘿蔔絲泡菜。<p> <hr><h1>3<h1><p>淋上事先調勻的醬汁，撒上白芝麻即可上桌。<p> <hr>', '塊、g、g、g、少許、T、T'),
(654, '韓式辣豆芽', '豆芽、水、鹽、醬油、醋、麻油、韓式辣椒粉、辣椒碎(怕辣可不加)、白芝麻、蒜末、蔥末', '450、1、1、1、11/2、2、1、1、1、1、3', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>冷鍋下豆芽加入1小匙鹽和1杯水<p> <hr><h1>2<h1><p>蓋上蓋子中火煮10分鐘豆芽(這時可以準備醬料-步驟5)<p> <hr><h1>3<h1><p>10分鐘後掀開蓋子，每家火候不同，確認一下水有滾。關火，稍微用筷子翻攪一下豆芽。這樣煮出來的豆芽很清脆爽口。<p> <hr><h1>4<h1><p>瀝乾<p> <hr><h1>5<h1><p>將醬料所有的食材混和<p> <hr><h1>6<h1><p>加入豆芽拌勻即可<p> <hr><h1>7<h1><p>完成~開動!<p> <hr>', 'g、杯、小匙、大匙、小匙、大匙、小匙、小匙、小匙、大匙、大匙'),
(655, '韓式辣烤雞翅腿', '雞翅腿、芝麻粒、韓式辣醬、醬油、醬油膏、米酒、冰糖、蒜末', '數隻、少許、2、2、2、2、少許、適量', 'PNG', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>雞翅腿先用醃料醃30分鐘<p> <hr><h1>2<h1><p>鑄鐵鍋蓋鍋蓋小火燜煮15分鐘<p> <hr><h1>3<h1><p>放進烤盤，淋上一點醬汁，烤箱200度烤20分鐘<p> <hr><h1>4<h1><p>烤完灑上芝麻粒，完成<p> <hr>', '數隻、少許、大匙、大匙、大匙、大匙、少許、適量'),
(656, 'Ruru超簡單韓式炸雞氣炸料理', '雞腿肉、蒜頭、蔥、炸雞粉、鮮奶、優格、韓式炸雞醬、白醋、糖、辣椒醬', '一、五、半、適量、適量、適量、3、2、2、1/2', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 1, 0, 5, '<hr><h1>1<h1><p>解凍雞肉\\n_<p> <hr><h1>2<h1><p>加入蒜頭<p> <hr><h1>3<h1><p>加入醃醬_(鮮奶+優格)or(優酪乳)<p> <hr><h1>4<h1><p>攪拌均勻後\\n蓋上保鮮膜\\n\\n送入冰箱冷藏醃漬\\n(至少半小時)<p> <hr><h1>5<h1><p>沾炸雞粉 稍等回潮\\n噴油\\n入氣炸鍋<p> <hr><h1>6<h1><p>氣炸完成備用<p> <hr><h1>7<h1><p>小火煮醬汁\\n煮到冒小氣泡就可以了<p> <hr><h1>8<h1><p>炸雞放入醬汁中\\n小火翻拌均勻<p> <hr><h1>9<h1><p>均勻裹上醬汁後關火\\n拌入蒜末及蔥花<p> <hr><h1>10<h1><p>完成<p> <hr><h1>11<h1><p>超好吃!!!\\n趕快來做看看吧～<p> <hr>', '隻、顆、根、適量、適量、適量、t、t、t、t'),
(657, '涼拌黃豆芽', '黃豆芽、蔥、鹽巴、糖、醬油、香油、蒜泥、辣椒粉', '200、2、1、1、1、1、1、1', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>豆芽去根後，洗淨。水滾下鍋，煮5分鐘後撈起，沖冷水放涼備用。\\n蔥切蔥花備用。<p> <hr><h1>2<h1><p>加入所有調味料攪拌均勻即可食用。(怕辣的人可省略辣椒粉)<p> <hr>', 'g、株、小匙、小匙、小匙、大匙、大匙、大匙'),
(658, '韓式豬肉泡菜炒麵', '洋蔥、鴻禧菇、五花肉、韓式泡菜、麵、清酒、油、魚露、黑胡椒粉、蔥', '1/4、50、80、100、1、2、2、1、少?、少?', 'PNG', 'https://icook.tw/recipes/', 1, 0, 0, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>准?好所需食材\\n准?部分:\\n洋?切薄片，?禧菇切掉根部洗好?用，?肉切成容易入口的大小。\\n把炒??面的?味?汁材料混合一起。<p> <hr><h1>2<h1><p>烹?部分:\\n#平底??中火，加入?肉片，撒一??黑胡椒粉和?，炒至表面微微金?先盛碟放一??用。\\n#利用?肉的油，倒入泡菜翻炒，再加入?禧菇和洋?片拌炒1分?，倒入??面?汁，放入肉片，加入??面???小火煮2-3分?收汁即可。<p> <hr>', '?、mg、mg、mg、包、茶匙、茶匙、茶匙、少?、少?'),
(659, '韓綜「一日三餐．漁村篇」，韓式煎餅', '韓式煎餅粉、韭菜或是蔥、紅辣椒、好市多去殼蝦', '7、適量、1、5', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>準備好所有食材<p> <hr><h1>2<h1><p>切紅辣椒 (不辣，為了顏色好看)<p> <hr><h1>3<h1><p>蝦子對半切，去腸泥<p> <hr><h1>4<h1><p>7湯匙韓式煎餅粉加適量的水\\n攪拌均勻之後，蝦子和粉漿結合<p> <hr><h1>5<h1><p>開始煎煎餅\\n倒入粉漿\\n擺上韭菜和紅辣椒\\n最後再倒一些粉漿\\nTips:這樣上面的材料就不會輕易脫落\\n\\n兩面都煎熟就可以囉\\n\\n韓式煎餅沾醬:\\n醬油、韓國麻油、蒜頭、辣椒、白芝麻<p> <hr>', '湯匙、適量、根、隻'),
(660, '快速辣炒年糕', '韓國年糕、水、洋蔥、泡菜、起司片、蔥花  麻油', '半、一、半、100、一、少許', 'PNG', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 1, 0, 0, 5, '<hr><h1>1<h1><p>麻油爆香洋蔥加入年糕<p> <hr><h1>2<h1><p>加水將年糕煮軟<p> <hr><h1>3<h1><p>快起鍋時加入泡菜略煮,可以倒點泡菜湯汁<p> <hr><h1>4<h1><p>裝盤後放起司片跟蔥花<p> <hr>', '包、碗、顆、G、片、少許'),
(661, '韓式辣醬拌麵', '細麵條、洋蔥、小黃瓜、水煮蛋、泡菜、白芝麻、韓式辣醬、白醋、蒜泥、砂糖', '100、1/4、1/3、1、1、少許、1、5、2、1', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>調味料材料混合拌勻備用(可依據個人口味調整)<p> <hr><h1>2<h1><p>泡菜切碎備用<p> <hr><h1>3<h1><p>洋蔥切絲泡冰水(去辣味)<p> <hr><h1>4<h1><p>小黃瓜切絲<p> <hr><h1>5<h1><p>起水鍋煮麵，煮熟撈起泡冰水沖洗，瀝乾<p> <hr><h1>6<h1><p>將調味料跟麵條拌勻<p> <hr><h1>7<h1><p>放上泡菜、小黃瓜絲、洋蔥絲、水煮蛋，撒上白芝麻，就可以開動了~<p> <hr>', 'g、顆、條、顆、碗、少許、大匙、小匙、小匙、小匙'),
(662, '自製韓國年糕', '在來米粉、糯米粉、水、鹽、麻油', '100、120、140-180、1/4、1/2', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>將在來米粉、糯米粉和鹽放入大碗中拌勻<p> <hr><h1>2<h1><p>水先加140ml，拌勻揉成團，水不夠的話再慢慢一次加一點。水要加到要讓整個麵團有辦法成型<p> <hr><h1>3<h1><p>成型好的麵糰捏一小塊起來，約40g<p> <hr><h1>4<h1><p>將這個麵團壓成扁圓形，比較容易煮熟<p> <hr><h1>5<h1><p>將剛剛揉好的扁圓形麵團(粄媽)放入滾水中煮至浮起來後起鍋放涼<p> <hr><h1>6<h1><p>將放涼後的粄媽和剛剛的麵團揉合在一起，麵團一揉就會碎成片片所以剛開始不好揉。<p> <hr><h1>7<h1><p>因為粄媽增加了黏性，最後可以揉成光滑的年糕麵團<p> <hr><h1>8<h1><p>將年糕麵團切成四份<p> <hr><h1>9<h1><p>每份揉成長條型<p> <hr><h1>10<h1><p>切成約6公分長(切多長自己決定)，這個配方可做35個6公分的韓國年糕<p> <hr><h1>11<h1><p>切完的年糕邊邊會有點變型，可以稍微用手指將邊緣捏一下，捏成漂亮的圓柱型。不追求完美可省略<p> <hr><h1>12<h1><p>蒸籠鋪上溼布並將年糕擺進蒸籠內，大火蒸15分鐘<p> <hr><h1>13<h1><p>蒸好之後要注意，一定要趁熱把年糕拿起來<p> <hr><h1>14<h1><p>砧板上抹點麻油，將蒸好的年糕抹上薄薄的麻油增加香氣以及防沾黏，好吃的韓國年糕就完成了喔!<p> <hr>', 'g、g、ml、小匙、小匙'),
(663, '韓式燉排骨', '豬肋排、杏鮑菇、香菇、洋蔥、白蘿蔔、紅蘿蔔、蔥、青陽辣椒、紅辣椒、小青椒、蔥、濃醬油、黃砂糖、料酒、水、蒜末、薑末、胡椒、香油', '2、2、2、2、1/3、1、3、3、2、5、、1-1/3、2/3、2/3、1-1/3、1/4、2/3、1、4', 'PNG', 'https://icook.tw/recipes/', 1, 0, 0, 0, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>將2kg的排骨浸泡在水中去掉血水（1天）。<p> <hr><h1>2<h1><p>在大碗中依序倒入醬汁材料後攪拌均勻<p> <hr><h1>3<h1><p>1、杏鮑菇切塊或是切片。\\n2、香菇切1/4塊。\\n3、洋蔥、白蘿蔔、紅蘿蔔切塊。（這邊我沒用白蘿蔔）\\n4、大蔥、青陽辣椒、紅辣椒、青辣椒切段。（這邊我沒用辣椒）<p> <hr><h1>4<h1><p>1、用篩子去掉排骨的血水。\\n2、將排骨再次用水龍頭沖乾淨，反覆2次。\\n3、用篩子將排骨瀝乾淨。<p> <hr><h1>5<h1><p>1、把排骨放入鍋中，倒入排骨醬料。\\n2、倒入1L的水後煮到滾。（至少煮1hr，將肉煮軟）\\n3、邊煮邊撈出泡沫。（不要一開始就撈泡沫）<p> <hr><h1>6<h1><p>將材料依照順序放入。\\n1、白蘿蔔丟入煮熟。（這邊我沒有白蘿蔔所以跳過）\\n2、丟入紅蘿蔔、香菇、杏鮑菇，煮熟。（因為我用馬鈴薯，所以紅蘿蔔丟入後，我就跟著丟入了馬鈴薯）\\n3、所有食材差不多九成熟的時候加入洋蔥。\\n（加入洋蔥後就不要再加水了。）\\n4、加入青陽辣椒、紅辣椒、青椒、蔥，煮熟。（我沒有加辣椒）<p> <hr><h1>7<h1><p>白老師建議大家先將排骨拿出來裝盤，再把材料夾出，最後用湯匙將湯汁淋上去才會漂亮喔。不要一窩蜂的一次咕嚕的倒出來。<p> <hr>', 'kg、個、個、個、個、個、根、根、根、根、杯、杯、杯、杯、杯、杯、湯匙、g、湯匙'),
(664, '【韓式-小菜】培根包糯米椒低碳食單', '糯米椒、培根、洋蔥、紅甜椒、黃甜椒、胡椒粉、蠔油、米酒、清水、蒜末', '12、6、1/2、1/2、1/2、少許、2、2、5、1/4', 'PNG', 'https://icook.tw/recipes/', 1, 0, 1, 1, 1, 1, 0, 0, 5, '<hr><h1>1<h1><p>先準備醬汁的調味料，放入蠔油2T、米酒2T、清水5T跟蒜末1/4T攪拌均勻備用。<p> <hr><h1>2<h1><p>摘除糯米椒的頭部，倒入醋蘇打粉水裡洗乾淨，然後用叉子打個洞，以便醬汁入到味。<p> <hr><h1>3<h1><p>取用2根糯米椒和培根1條包一包。\\n\\n??TIP??至少半小時之前拿出培根退冰，如果直接用從冰箱裡立即拿出來的培根的話，接頭部分不容易貼起來。<p> <hr><h1>4<h1><p>接頭部分要先煮熟才不會鬆開，放小火慢煎培根和糯米椒，煎至糯米椒半熟的程度為止。<p> <hr><h1>5<h1><p>然後倒入【步驟1】做好的醬汁熬一熬，熬至醬汁收乾，醬汁入到味後上桌亨用即可。<p> <hr>', '根、條、顆、顆、顆、少許、T、T、T、T'),
(665, '韓式蔬菜煎餅', '蔥花蛋皮、韭黃、洋蔥絲、胡蘿蔔絲、雞蛋、蒜末、泡菜、沙拉油、辣椒、醬油膏', '1、30、30、30、2、10、適量、適量、10、1', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>說明食材如上。韭黃切段，洋蔥切絲，胡蘿蔔切絲。雞蛋打散備用。<p> <hr><h1>2<h1><p>先熱鍋後加入油，放入蛋餅皮上面放入胡蘿蔔絲，洋蔥絲和韭黃段，然後加入2顆蛋液+泡菜，煎至蛋熟後，由上往下摺起來。<p> <hr><h1>3<h1><p>煎至菜熟後翻背面，煎到熟後，熄火取出。<p> <hr><h1>4<h1><p>切塊裝盤，淋上辣醬油=辣椒+醬油膏，“韓式蔬菜煎餅”即完成。<p> <hr>', '張、克、克、克、粒、克、適量、適量、克、大匙'),
(666, '辣炒年糕', '年糕、水、蔥、水煮蛋、貢丸、天婦羅(魚糕餅)、糖、韓式辣醬、醬油', '300、400、60、2、60、100、2、1.5、2', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>年糕泡水備用<p> <hr><h1>2<h1><p>蔥斜切成段<p> <hr><h1>3<h1><p>水煮蛋去殼 準備天婦羅與貢丸 (抱歉我買不到魚糕餅 用這兩樣代替)<p> <hr><h1>4<h1><p>年糕與400毫升水混合<p> <hr><h1>5<h1><p>加入1大匙糖煮滾<p> <hr><h1>6<h1><p>加入韓式辣醬與醬油調味<p> <hr><h1>7<h1><p>再次煮滾後 加入蔥 貢丸 天婦羅<p> <hr><h1>8<h1><p>小火滾10分鐘收汁(記得攪拌防止沾鍋)<p> <hr><h1>9<h1><p>再加1大匙糖 加入雞蛋裹上醬汁<p> <hr><h1>10<h1><p>完成<p> <hr>', '克、毫升、克、顆、克、克、大匙、大匙、大匙'),
(667, '泡菜炒肉片(露營OK)', '火鍋肉片、泡菜 (切小塊)、洋蔥 (切絲)、韭菜或蔥 (切段)、芝麻、醬油、酒、糖、香油', '120、70、1/2、30、隨意、1/2~2/3、2/3、1/2、1/2', 'PNG', 'https://icook.tw/recipes/', 0, 0, 0, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>豬肉對半切，和醬汁 抓捏一下<p> <hr><h1>2<h1><p>鍋中加一點香油（約1/2大匙），開中火加熱，放入洋蔥炒軟，續加肉片炒至變色<p> <hr><h1>3<h1><p>加入泡菜、韭菜拌炒均勻即可熄火<p> <hr><h1>4<h1><p>莊盤後隨意灑上白芝麻即完成!<p> <hr>', 'g、g、個、g、隨意、大匙、大匙、小匙、大匙'),
(668, '韓國春川辣炒雞', '去骨雞腿肉（全聯買）、醃料、芝麻油、韓式辣醬、辣椒粉、薑末、蒜末、米酒、配菜、洋蔥丁、高麗菜、紅蘿蔔、青蔥、天婦羅、年糕、調味料、韓式辣醬、辣椒粉、醬油、味霖、水、起士片', '1、2、2、1、適量、適量、1、適量、適量、適量、適量、適量、適量、2、1、1、1、適量、適量', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>將雞腿肉切小塊備用、其他材料準備好備用。<p> <hr><h1>2<h1><p>將薑、蒜切末，洋蔥切小丁。<p> <hr><h1>3<h1><p>天婦羅切條狀、紅蘿蔔和高麗菜切小塊、青蔥切小段備用。<p> <hr><h1>4<h1><p>先醃漬雞肉～\\n將醃肉的調味料全部混合ㄧ起先調好。（芝麻油最後再放）<p> <hr><h1>5<h1><p>將醃料將雞肉混合ㄧ起拌ㄧ拌。<p> <hr><h1>6<h1><p>再加入這道料理很重要的秘密武器?芝麻油，可以增添風味、讓雞肉更滑嫩。<p> <hr><h1>7<h1><p>拌ㄧ拌，放冰箱冷藏1個小時，讓雞肉更入味。<p> <hr><h1>8<h1><p>煮婦用這台～「KAYEE」美國智慧設計電烤盤做這道料理。<p> <hr><h1>9<h1><p>這烤盤有2款可換式的陶瓷不沾烤盤～有濾油設計燒烤盤+平面烤盤\\n，可以煎炒烤，好方便。<p> <hr><h1>10<h1><p>烤盤夠大，做這道份量十足的料理最適合了。（放上平面烤盤）<p> <hr><h1>11<h1><p>旁邊有LED顯示燈與智慧溫控功能、溫度可達230度。\\n還有貼心設計風扇，可將油煙吸入、淨化後再排出，在室內燒烤也不會滿身的油煙味。<p> <hr><h1>12<h1><p>打開電源，調好溫度?在烤盤上噴適量的油<p> <hr><h1>13<h1><p>這台升溫很快，將洋蔥炒香<p> <hr><h1>14<h1><p>就可以按下風扇，可將油煙吸入、淨化後再排出，在室內燒烤也不會滿身的油煙味。<p> <hr><h1>15<h1><p>再將醃好的雞肉加入拌炒<p> <hr><h1>16<h1><p>適食材狀況調整溫度<p> <hr><h1>17<h1><p>超香雞肉<p> <hr><h1>18<h1><p>再加入紅蘿蔔、高麗菜一起拌炒<p> <hr><h1>19<h1><p>加入天婦羅、年糕拌炒<p> <hr><h1>20<h1><p>將味霖+水,適量的醬油，混合加入拌炒<p> <hr><h1>21<h1><p>蓋上蓋子烹煮（有附強化玻璃蓋加速烹調、可避免油濺到）<p> <hr><h1>22<h1><p>再加入韓式辣醬拌炒，增加風味<p> <hr><h1>23<h1><p>再加些辣椒粉拌炒<p> <hr><h1>24<h1><p>再蓋鍋煮一下，讓食材風味更融合<p> <hr><h1>25<h1><p><p> <hr><h1>26<h1><p>最後再加入起士，讓起士融化?好吃的韓式辣炒春雞就完成囉！<p> <hr><h1>27<h1><p><p> <hr><h1>28<h1><p>太好吃，第一盤秒殺！又炒了第二盤（方式同上，這次沒加起士ㄧ樣好吃??）<p> <hr><h1>29<h1><p>這台好方便，炒的過程全程無煙欸，煙都被這吸進去了！<p> <hr><h1>30<h1><p>烹煮完，旁邊有手把可將烤盤提起來（就可以再用另一個烤盤做料理囉）<p> <hr><h1>31<h1><p>可直接端上餐桌，有沒有覺得很像餐廳料理。<p> <hr><h1>32<h1><p>太美味?喜歡韓式料理的朋友一定要試看看！在家就能吃到正統的辣炒春雞，滿滿的起司、香辣夠味的好開胃，保證胃口大開喔！<p> <hr>', '盒、、大匙、大匙、小匙、適量、適量、大匙、適量、適量、適量、適量、適量、適量、大匙、大匙、大匙、大匙、適量、適量'),
(669, '韓式豆乾', '豆乾、四季豆、白醋、醬油、蜂蜜、韓式辣醬、蒜、番茄醬', '1、一、1、1、2、1、適量、1', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 0, 1, 0, 0, 0, 5, '<hr><h1>1<h1><p>四季豆切小段\\n蒜切末<p> <hr><h1>2<h1><p>將所有韓式醬汁的材料混合均勻<p> <hr><h1>3<h1><p>四季豆先炒5分鐘再加入豆乾<p> <hr><h1>4<h1><p>加入韓式醬汁再炒5分鐘即完成<p> <hr>', '盒、把、匙、匙、匙、匙、適量、匙'),
(670, '【韓式-小菜】韓式鮪魚鮮蔬蛋捲超簡單', '蛋、紅蘿蔔、洋蔥、青蔥、鮪魚、鹽巴、胡椒粉', '3、1/6、1/4、1、1、少許、少許', 'PNG', 'https://icook.tw/recipes/', 1, 0, 1, 0, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>先準準備蔬菜，紅蘿蔔切絲，洋蔥切碎丁，青蔥切蔥花，然後倒掉鮪魚罐裝裡的油備用。<p> <hr><h1>2<h1><p>打3顆蛋後用筷子打個蛋，加入鹽巴跟胡椒粉少許攪拌，再加入【步驟1】備用的蔬菜跟鮪魚攪拌均勻。<p> <hr><h1>3<h1><p>預熱平底鍋，加上適量的幹練有，倒入1/3的蛋液，待蛋液約七分凝固時，從外講蛋皮往內捲，捲完後將蛋捲網上推至最外側。<p> <hr><h1>4<h1><p>下一點的橄欖油，再倒入1/3的蛋液，加入後將【步驟3】蛋捲掀起，以便【步驟3】跟新加入的蛋液均勻沾上。<p> <hr><h1>5<h1><p>然後重複【步驟3】跟【步驟4】到蛋液全部用完。將蛋捲取出放涼後再切塊擺盤即可食用。<p> <hr>', '顆、條、顆、根、罐、少許、少許'),
(671, '泡菜炒牛肉', '牛火鍋片、泡菜、蔥、蒜末、韓式芝麻油、白胡椒粉、泡菜汁、韓式辣椒粉、味醂、鹽巴', '180、半、2、2、1、1/4、1、1/4、1、1/4', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>牛肉加入醃料略抓一下，醃製３０分鐘。<p> <hr><h1>2<h1><p>蔥切末，泡菜剪小塊。<p> <hr><h1>3<h1><p>熱鍋後蒜末和蔥白先下鍋炒香，泡菜再下鍋翻炒至香味傳出。<p> <hr><h1>4<h1><p>加入牛肉片翻炒至約８分熟，蔥綠再下鍋略拌炒即可<p> <hr>', 'g、碗、根、瓣量、小匙、茶匙、大匙、茶匙、大匙、茶匙'),
(672, '韓式泡菜鍋', '韓式泡菜、豆腐、韓式年糕、牛肉、菇類、玉米筍、洋蔥、雞蛋、起司片、蔥段', '一、半、半、一、一、一、1/4、兩、兩、些許', 'PNG', 'https://icook.tw/recipes/', 0, 1, 1, 0, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>將材料洗淨、切成喜歡的大小備用<p> <hr><h1>2<h1><p>油鍋加熱後，放入蒜頭、洋蔥爆香<p> <hr><h1>3<h1><p>超出香味後，將肉片放入鍋中一起炒<p> <hr><h1>4<h1><p>肉片炒至8分熟後，加入水及泡菜\\n（水的份量蓋過材料即可，可依個人喜好做調整<p> <hr><h1>5<h1><p>煮滾後，進行調味\\n1.增加泡菜調鹹或水量調淡\\n2.若喜愛吃辣可加入辣粉<p> <hr><h1>6<h1><p>將豆腐、菇類、玉米筍、年糕放入鍋中煮\\n（配料可依個人喜好增減<p> <hr><h1>7<h1><p>煮滾後打入雞蛋<p> <hr><h1>8<h1><p>擺上蔥段及起司片即可上桌～<p> <hr>', '罐、盒、包、盒、包、盒、顆、顆、片、些許'),
(673, '【韓式-小菜】花椰菜涼拌素食超簡單', '花椰菜、蒜末、蔥花、鹽巴、芝麻油、胡椒粉', '1、1、1、0.5、少許、少許', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 0, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>先準備新鮮的花椰菜，按照花椰菜的小根切塊，將小塊再切一半，然後泡在醋蘇打粉水裡去表面上的農藥。青蔥切蔥花，蒜頭切碎末備用。<p> <hr><h1>2<h1><p>取用一鍋水，用大火煮水，水滾沸時放入【步驟1】弄好的花椰菜跟鹽巴2t燙3～5分鐘。\\n\\n??TIP??放入鹽巴的話，花椰菜的綠色會更鮮艷。<p> <hr><h1>3<h1><p>撈【步驟3】燙好的花椰菜，用冷水過水，瀝乾後，與調味料（蒜末1T、蔥花1T、少許芝麻油跟胡椒粉）攪拌均勻，上桌亨用即可。<p> <hr>', '根、T、T、t、少許、少許'),
(674, '辣醋拌青江菜', '青江菜、白糖、鹽、辣椒粉、蒜泥、香油、醋、芝麻', '1、3、2、2.5、1、1、1、1', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>把青江菜丟入加了鹽的開水中。<p> <hr><h1>2<h1><p>調製醋拌菜的調料：將白糖、鹽、辣椒粉、蒜泥、醋、香油加入青江菜中拌勻。<p> <hr><h1>3<h1><p>搭配白切肉！絕配！！<p> <hr>', '把、匙、匙、匙、匙、匙、匙、小撮'),
(675, '香辣糯米椒涼拌素食', '糯米、醬油、辣椒粉、糖、橄欖油、清水、鹽巴', '20、2、2、3、1、1、0.5', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 0, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>先準備洗乾淨的糯米椒，用叉子打個洞，以便讓醬汁入到味。<p> <hr><h1>2<h1><p>熱鍋後，放入糯米椒、橄欖油1T和鹽巴0.5T拌炒，炒至糯米椒變蔫。\\n\\n??TIP??拌炒糯米椒時，放入少許鹽巴就可以讓它更會蔫下來的。<p> <hr><h1>3<h1><p>糯米椒開始蔫下來之後，放入醬汁的調味料，醬油2T、糖3T、辣椒粉2T、米酒2T跟清水1/3杯烹一烹。<p> <hr><h1>4<h1><p>烹至醬汁調味料的味道入到糯米椒裡，如果拌炒時不夠水份的話，可以多放入適量的清水烹熟。糯米椒全熟後可以上桌亨用。<p> <hr>', '根、T、T、T、T、T、T'),
(676, '韓式涼拌黃豆芽', '有機黃豆芽、大蒜泥或蒜末、鹽巴、白芝麻、韓國麻油', '200、適量、適量、適量、適量', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>煮一鍋滾水，加入一茶匙的鹽，將洗淨的黃豆芽放進滾水裡，蓋上鍋蓋煮約4-5分鐘。<p> <hr><h1>2<h1><p>很重要的是，煮黃豆芽一定要蓋上鍋蓋，可去除土味。<p> <hr><h1>3<h1><p>煮好的黃豆芽，立即沖冷水瀝乾備用。<p> <hr><h1>4<h1><p>加入調味料拌勻即可！可自己邊拌邊試味道，再酌量增減調味。<p> <hr><h1>5<h1><p>最後放進保存盒或罐，就可以放冰箱囉，冷藏保存可放約5天。<p> <hr>', 'g、適量、適量、適量、適量'),
(677, '韓國麵包', '韓國麵包粉、無鹽奶油、黑芝麻、醬油、水、蛋、高筋麵粉', '500、85、38、9、157、兩、9', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 0, 0, 5, '<hr><h1>1<h1><p>準備好所有食材<p> <hr><h1>2<h1><p>奶油融化後，將所有材料攪拌均勻<p> <hr><h1>3<h1><p>揉成麵團後，放室溫醒麵十分鐘\\n記得蓋保鮮膜以免太乾<p> <hr><h1>4<h1><p>醒麵完，揉成一顆一顆球狀體<p> <hr><h1>5<h1><p>放入氣炸鍋開始氣炸\\n160度\\n共烤25分鐘\\n每五分鐘拉出來噴一次水<p> <hr><h1>6<h1><p>超好吃韓國麵包完成?<p> <hr>', '公克、公克、公克、公克、cc、顆、公克'),
(678, '炒年糕麵素食', '年糕、魚丸、方便麵、辣椒粉、辣椒醬、醬油、糖、寡醣、胡椒粉', '200、6、1、1.5、1、1、1、0.5、少許', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>先準備辣炒年糕調味料，放入辣椒粉1.5T、辣椒醬1T、醬油1T、糖1T、寡醣1/2T和少許胡椒粉攪拌均勻備用。<p> <hr><h1>2<h1><p>年糕沖個水後瀝乾，魚丸切一半。\\n\\n??TIP??依個人的喜好，可以多加入洋蔥絲和蔥花等蔬菜。<p> <hr><h1>3<h1><p>取用一鍋水，然後將【步驟1】與【步驟2】備用的材料放於鍋裡，用大火煮一煮。\\n\\n??TIP??用大火煮的話，年糕與方便麵不會容易爛掉。<p> <hr><h1>4<h1><p>辣炒年糕醬汁開始滾沸時，放中小火，從這時刻開始熬一熬。<p> <hr><h1>5<h1><p>辣炒年糕醬汁差不多熬乾到1/2的量，關火擺盤即可食用。<p> <hr>', 'g、顆、個、T、T、T、T、0.T、少許'),
(679, '泡菜燒肉飯', '洋蔥、小黃瓜、梅花肉片、蛋、醬油、糖、米酒、孜然粉、泡菜、白飯、黃金泡菜', '100、1、300、1、1、1/2、1、1/4、200、300、50', 'PNG', 'https://icook.tw/recipes/', 1, 0, 0, 1, 0, 1, 0, 0, 5, '<hr><h1>1<h1><p>洋蔥切絲 小黃瓜切片<p> <hr><h1>2<h1><p>梅花肉切成一口大小 用醬油 糖 孜然粉 米酒醃製<p> <hr><h1>3<h1><p>熱一鍋水 煮一個水波蛋 (可以參考我以前的文章)<p> <hr><h1>4<h1><p>熱鍋 將梅花肉煎至變色後加入洋蔥<p> <hr><h1>5<h1><p>拌炒均勻 洋蔥軟化後加入泡菜<p> <hr><h1>6<h1><p>翻炒均勻 試個味道 （可以再用醬油跟糖依照喜好調味）<p> <hr><h1>7<h1><p>起鍋 白飯打底 放上泡菜燒肉 水波蛋 小黃瓜 黃金泡菜<p> <hr>', '克、根、克、顆、大匙、茶匙、茶匙、茶匙、克、克、克'),
(680, '【白鍾元食譜】超簡易泡菜煎餅食譜', '泡菜、韓式煎餅粉、韓式辣椒粉、蒜頭、辣椒、醬油、韓國麻油', '適量、4、1、適量、適量、5、1', 'PNG', 'https://icook.tw/recipes/', 1, 0, 1, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>準備好所有食材<p> <hr><h1>2<h1><p>製作泡菜煎餅沾醬:\\n蒜頭、辣椒切碎，倒入5茶匙醬油和1茶匙韓國麻油<p> <hr><h1>3<h1><p>用剪刀將泡菜剪碎<p> <hr><h1>4<h1><p>加入煎餅粉、韓式辣椒粉和水到剪碎的泡菜裡\\n之後將食材攪拌均勻<p> <hr><h1>5<h1><p>將食材攪拌均勻之後，可以開始煎泡菜煎餅<p> <hr>', '適量、湯匙、湯匙 (非必須)、適量、適量、茶匙、茶匙'),
(681, '韓國宴會麵(附影音食譜)', '麵線、泡菜、雞蛋、櫛瓜、海苔絲、乾昆布、大鯷魚乾、洋蔥、青蔥、蒜頭', '適量、適量、2、1/3、適量、3-4、6-8、0.5、1、3', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>去除大鯷魚的內臟 (黑黑的那一坨就是了)\\n\\n沒有大鯷魚用熬湯的小魚乾也可以<p> <hr><h1>2<h1><p>首先來煮湯底\\n先把大緹魚乾下鍋乾炒至聞到魚乾香味<p> <hr><h1>3<h1><p>接著倒入1200 cc的冷水，放入湯底所有材料，大火煮至沸騰<p> <hr><h1>4<h1><p>湯底沸騰大約5分鐘後，先把昆布撈出(昆布煮太久湯容易變苦)，接著轉中小火繼續煮30分鐘<p> <hr><h1>5<h1><p>時間到後撈出所有材料，這樣湯底就完成了<p> <hr><h1>6<h1><p>湯底在煮的期間來準備配料，櫛瓜切成條狀<p> <hr><h1>7<h1><p>熱鍋加一點點油，下櫛瓜，加一點鹽，拌炒大約3分鐘後起鍋備用<p> <hr><h1>8<h1><p>打兩顆蛋，攪拌均勻後，下鍋小火慢煎至兩面變熟<p> <hr><h1>9<h1><p>蛋皮起鍋後捲起切成細條狀<p> <hr><h1>10<h1><p>煮麵條<p> <hr><h1>11<h1><p>麵條起鍋後先浸冷水冷卻一下<p> <hr><h1>12<h1><p>空碗放入麵條，擺放櫛瓜絲、雞蛋絲，海苔條，和泡菜；加入剛剛煮好的高湯\\n就完成囉<p> <hr>', '適量、適量、顆、條、適量、片、條、顆、支、顆'),
(682, '韓式小菜-(醃蘿蔔)', '韓國蘿蔔、糖、白醋、鹽', '3、1、1、4', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 1, 0, 5, '<hr><h1>1<h1><p>蘿蔔清洗乾淨削皮\\n需要削去三層皮\\n才不會有苦味<p> <hr><h1>2<h1><p>切成長條狀<p> <hr><h1>3<h1><p>糖:醋:鹽=1:1:4\\n攪拌至融化<p> <hr><h1>4<h1><p>加入蘿蔔均勻攪拌<p> <hr><h1>5<h1><p>裝入夾鏈袋靜置6小時\\n再放置冰箱6小時\\n(湯汁一起放入夾鏈袋裡)<p> <hr><h1>6<h1><p>完成！\\n就可以食用了！<p> <hr>', '條、杯、杯、tsp'),
(683, '韓式炸雞-醃蘿蔔', '三節翅、鹽巴、糖、米酒、蒜泥、胡椒粉、番茄醬、韓式辣醬、蒜泥、蜂蜜、檸檬、水、白蘿蔔、白醋、糖、鹽巴、普通麵粉、玉米粉、鹽巴', '3、8、15、40、20、一、300、150、50、80、1、150、適量、適量、適量、1、300、150、1', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>先將白蘿蔔去皮切小塊\\n白醋跟糖1:1煮滾加一點鹽巴\\n趁熱直接泡白蘿蔔剛好淹過去就好\\n放涼冰冷藏一晚完成<p> <hr><h1>2<h1><p>三節翅在關節處切開\\n翅跟腿肉多的部位劃一刀方便入味<p> <hr><h1>3<h1><p>所有醃料先混合好<p> <hr><h1>4<h1><p>醃料倒入抓醃冷藏2小時左右<p> <hr><h1>5<h1><p>混合好的炸粉倒入醃好的雞翅拌勻靜置一分鐘<p> <hr><h1>6<h1><p>170度油溫炸五分鐘炸熟<p> <hr><h1>7<h1><p>將醬汁材料準備好<p> <hr><h1>8<h1><p>除檸檬外都倒入鍋中煮滾轉小火擠入檸檬汁<p> <hr><h1>9<h1><p>雞翅下鍋小火翻炒上醬汁<p> <hr><h1>10<h1><p>都攪拌均勻就可以上菜囉<p> <hr><h1>11<h1><p>可灑上一些白芝麻增色\\n做出來才發現太多了\\n一般家庭製作可以1/3的量就夠吃了<p> <hr>', '斤、g、g、g、g、茶匙、g、g、g、g、顆、g、適量、適量、適量、茶匙、g、g、茶匙'),
(684, '韓式小菜-(韓式炒雜菜)', '大蒜、洋蔥、紅蘿蔔、香菇、菠菜、牛絞肉、韓式冬粉、黑木耳、醬油(老抽)、黑胡椒、香油、糖', '5-6、半、1/3、5、少許、1、150、少許、少許、少許、少許、少許', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 5, '<hr><h1>1<h1><p>韓式冬粉至少用冷水泡至少1小時後才可以川燙<p> <hr><h1>2<h1><p>先備料把食材先切細長條狀，\\n右邊小罐子是事先炒好的大蒜油\\n(大蒜+橄欖油)<p> <hr><h1>3<h1><p>蒜頭先爆香<p> <hr><h1>4<h1><p>洋蔥，紅蘿蔔，香菇先炒軟\\n起鍋前加少許香油後先放旁邊備用<p> <hr><h1>5<h1><p>鍋子不需清洗，\\n繼續加入大蒜油\\n炒菠菜\\n起鍋前再加入少許香油\\n再放旁邊備用<p> <hr><h1>6<h1><p>鍋子不需清洗\\n加入大蒜油炒牛絞肉\\n加入少許醬油，糖，黑胡椒\\n起鍋放旁邊備用<p> <hr><h1>7<h1><p>牛絞肉均勻炒熟後加入黑木耳拌炒\\n起鍋放置旁邊備用<p> <hr><h1>8<h1><p>另起一鍋水加少許醬油，糖\\n準備煮韓式冬粉<p> <hr><h1>9<h1><p>水滾後加入韓式冬粉煮6分鐘\\n就可以撈起備用<p> <hr><h1>10<h1><p>這是所有炒好備用的食材<p> <hr><h1>11<h1><p>鍋子不需清洗\\n再加入大蒜油爆香\\n先加入韓式冬粉把冬粉炒鬆\\n只要沒有黏成一塊塊\\n就可以加入所以食材\\n拌一拌均勻就可以了<p> <hr><h1>12<h1><p>很簡單的料理\\n只是要分開炒比較麻煩\\n但料理過程中不需清洗鍋子\\n一鍋到底很輕鬆的一道料理\\n醬油(使用老抽，顏色會較深，但不死鹹)<p> <hr>', '顆、顆、條、朵、少許、磅、g、少許、少許、少許、少許、少許'),
(685, '辣雞起司飯', '米、水、蒜頭、雞胸肉、鹽巴、米酒、胡椒、醬油、糖、韓式辣醬、麻油、起司絲', '1、160、10、300、1/2、1、1、2、1、1、1、100', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>雞肉先泡鹽水2小時以上 洗淨後切成小塊與蒜末 鹽巴 米酒 胡椒粉混合醃製<p> <hr><h1>2<h1><p>韓式辣醬 醬油 糖 麻油混合<p> <hr><h1>3<h1><p>熱鍋 下入雞肉 小火煎至上色<p> <hr><h1>4<h1><p>翻面後拌炒<p> <hr><h1>5<h1><p>加入剛剛調製好的醬汁 翻炒均勻<p> <hr><h1>6<h1><p>小火收汁 備用<p> <hr><h1>7<h1><p>起司用不沾鍋 小火融化<p> <hr><h1>8<h1><p>飯上鋪剛剛的雞肉 放上起司<p> <hr><h1>9<h1><p>完成<p> <hr>', '杯、毫升、克、克、茶匙、茶匙、克、大匙、大匙、大匙、大匙、克'),
(686, '韓式涼拌麵|韓式冷麵食譜(附影片)', '五木細麵、水煮蛋、小黃瓜、糖、韓式辣椒粉、醬油、韓式辣醬、韓國麻油、蒜頭', '2、2、1、1、1、1、1、0.5、2~3', 'PNG', 'https://icook.tw/recipes/', 0, 1, 0, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>準備好材料<p> <hr><h1>2<h1><p>小黃瓜先切片再切絲<p> <hr><h1>3<h1><p>開始製作醬料:\\n\\n製作蒜泥、1湯匙的糖、1湯匙韓式辣椒粉 、1湯匙醬油 、1湯匙韓式辣醬、\\n0.5湯匙韓國麻油 \\n\\n將醬料攪拌均勻<p> <hr><h1>4<h1><p>煮水煮麵\\nTips: 煮麵條時，在水裡加點油，可以防止麵條黏在一起<p> <hr><h1>5<h1><p>把煮好的麵條，放入冰水(冰塊+水) 裡冷卻，這樣麵條就會變成Q彈好吃的冷麵 \\n之後撈起麵條，擠去水分<p> <hr><h1>6<h1><p>接下來將小黃瓜、水煮蛋、醬料放入碗裡就完成爽口美味的韓式涼拌麵(韓式冷麵)囉!<p> <hr>', '束、顆、條、湯匙、湯匙、湯匙、湯匙、湯匙、顆'),
(687, '8分鐘上菜之韓式辣醬炒雞丁', '雞胸肉or雞腿肉、蒜頭、青蔥、杏鮑菇、水、韓式辣醬or豆瓣醬、橄欖油（沙拉油也可）', '300、2、1、200、兩～三、1、10', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>先將醃過的雞胸肉（雞腿肉）取出備用、杏鮑菇切片、蒜頭切末、青蔥切段備用。<p> <hr><h1>2<h1><p>熱鍋下油<p> <hr><h1>3<h1><p>先下蔥白部分及蒜末，中火炒出香味。<p> <hr><h1>4<h1><p>待辛香料的香味出來之後，下雞胸肉丁以大火拌炒。<p> <hr><h1>5<h1><p>待雞胸肉片變白色後，即可下杏鮑菇片，以大火拌炒。<p> <hr><h1>6<h1><p>暫時轉小火，下一大匙韓式辣醬拌炒均勻。<p> <hr><h1>7<h1><p>再下水轉大火稍微煨一下，試一下味道。<p> <hr><h1>8<h1><p>滾了之後就可以下蔥綠，關火讓餘溫拌炒。<p> <hr><h1>9<h1><p>一樣喜歡吃辣的朋友可以加一點辣椒喔，超級下飯<p> <hr>', 'g、顆、根、g、大匙、大匙、ml'),
(688, '韓式年糕', '糯米粉、再來米粉、油、鹽、水', '300、100、10、3、150', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>將糯米粉和在來米粉各取1/4 ,大概加50g水 先捏成團用滾水煮成粿母，熟後放入所有材料中，揉成團備用。<p> <hr><h1>2<h1><p>將揉好的麵團做等分分割大概每團75g，分割後再滾圓，揉久一點。<p> <hr><h1>3<h1><p>將每個麵團進行滾直，大約寬1.2cm的圓柱裝，即可上鍋用中火蒸15分即可。<p> <hr>', 'g、g、g、g、g'),
(689, '韓國糖餅', '高筋麵粉、糯米粉、黑糖、砂糖、鹽、酵母、水、沙拉油', '200、100、10、10、5、6、220、適量', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 1, 0, 0, 1, 0, 5, '<hr><h1>1<h1><p>將粉類與酵母水攪拌均勻。<p> <hr><h1>2<h1><p>攪拌至表面光滑後，把麵糰收成一糰。<p> <hr><h1>3<h1><p>發酵兩小時。<p> <hr><h1>4<h1><p>分割一球60克並壓平。<p> <hr><h1>5<h1><p>包一匙砂糖、10克堅果，收起。<p> <hr><h1>6<h1><p>兩面煎至金黃色即可完成。<p> <hr>', '克、克、克、克、克、克、克、適量'),
(690, '韓式焦糖餅(400次咖啡升級版)', '白糖、小蘇打粉', '1、1', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>白糖小火慢慢炒成焦糖色\\n需要翻炒，不然會燒焦<p> <hr><h1>2<h1><p>翻炒後會慢慢結塊狀，\\n繼續翻炒<p> <hr><h1>3<h1><p>糖會慢慢融化，\\n記得一定要小火<p> <hr><h1>4<h1><p>融化後\\n可以測量溫度是否達150度\\n就可以加入小蘇打粉<p> <hr><h1>5<h1><p>加入小蘇打粉後會快速膨脹\\n要繼續均勻攪拌<p> <hr><h1>6<h1><p>裝模型盤<p> <hr><h1>7<h1><p>等完全冷卻就可以敲碎<p> <hr><h1>8<h1><p>敲碎大大小小形狀<p> <hr><h1>9<h1><p>越碎的話融化越快，\\n一杯牛奶上加入一些焦糖餅\\n就變成焦糖牛奶<p> <hr><h1>10<h1><p>也可以使用冰塊造型的模型製作不同樣子??<p> <hr>', '杯、茶匙'),
(691, '韓國小吃烤起司', '莫札瑞拉起司條、煉乳', '2、少許', 'PNG', 'https://icook.tw/recipes/', 1, 1, 0, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>準備食材<p> <hr><h1>2<h1><p>用平底鍋將四面煎至酥脆<p> <hr><h1>3<h1><p>淋上煉乳，完成。<p> <hr>', '條、少許'),
(692, '韓國鯷魚刀削麵', '鯷魚粉(自磨)、昆布、水、生麵、馬鈴薯絲、洋蔥絲、紅蘿蔔絲、櫛瓜絲、蒜末、蔥末、湯醬油、鹽、胡椒粉', '1、2、400、90、30、50、20、50、6、17、12、2、少許', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 1, 1, 0, 5, '<hr><h1>1<h1><p>可先磨多一點鯷魚粉冷藏或冷凍，\\n下次就不用再準備。<p> <hr><h1>2<h1><p>準備食材<p> <hr><h1>3<h1><p>還有鯷魚粉<p> <hr><h1>4<h1><p>先在400ml的水中放昆布和鯷魚粉煮滾<p> <hr><h1>5<h1><p>接著放馬鈴薯絲、洋蔥絲、紅蘿蔔絲、湯醬油<p> <hr><h1>6<h1><p>等高湯快滾時，洗掉麵條澱粉。\\n(太早洗的話麵條會結塊)<p> <hr><h1>7<h1><p>高湯滾了後放麵<p> <hr><h1>8<h1><p>放蒜末和鹽巴<p> <hr><h1>9<h1><p>放櫛瓜絲和蔥<p> <hr>', '小匙、g、ml、g、g、g、g、g、g、g、ml、g、少許'),
(693, '低鹽鮮菜包飯醬素食', '鮪魚、大醬、辣椒醬、辣椒粉、糖、辣椒、蒜末、青蔥、洋蔥', '1、1、1、1、1、1、1、2、1/2', 'PNG', 'https://icook.tw/recipes/', 0, 0, 0, 0, 0, 0, 1, 0, 5, '<hr><h1>1<h1><p>先準備包飯醬的食材，洋蔥跟青蔥切丁，蒜頭跟辣椒切末備用。<p> <hr><h1>2<h1><p>打開鮪魚罐裝，將裡面的油倒入平底鍋裡，然後用小火預熱。<p> <hr><h1>3<h1><p>熱鍋後，放入【步驟1】備用的蔬菜翻炒，炒至洋蔥變透明，然後再放入大醬1T、辣椒醬1T、辣椒粉1T、糖1T跟水2T拌勻。<p> <hr><h1>4<h1><p>包飯醬滾沸時，放入鮪魚肉攪拌均勻，拌至3～5分鐘，醬汁的水開始收乾後，可以管火擺盤即可食用。\\n\\n??TIP??素食版，可以省略鮪魚肉。<p> <hr>', '罐、T、T、T、T、根、T、條、顆'),
(694, '韓式泡菜', '大白菜、蔥、白蘿蔔、薑泥、蒜泥、糖、鹽、再來米粉、水、水梨(打成泥)、紅蘿蔔、韓國辣椒粉、燙過玻璃瓶', '500、2、70、4、4、15、適量、20、180、1、50、15、1', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 1, 1, 0, 5, '<hr><h1>1<h1><p>準備好所有材料，將白菜洗淨稍微擦乾葉子，白蘿蔔/紅蘿蔔/蔥 切絲備用;白菜先每片，一片片正反2麵抹鹽，紅蘿蔔絲，白蘿蔔絲也抹鹽，好了先放一旁。<p> <hr><h1>2<h1><p>準備醬料:將水和在來米粉和好，煮滾放涼，加入薑泥，蒜泥，梨子泥，糖和韓國辣椒粉，拌勻。<p> <hr><h1>3<h1><p>將白菜/白蘿蔔絲/紅蘿蔔絲水份充分擠乾，一片片白菜分別塗上準備好的醬料，分量剛好幾乎每片白菜和其他配料都能蓋到。混好後，可以將白菜剪小或原樣裝入玻璃瓶內，壓實，不要有空隙，蓋緊蓋子，放在室溫2-3天，就可以吃或冰進冰箱內。<p> <hr>', 'g、根、g、g、g、g、適量、g、g、顆、g、g、個'),
(695, '韓式泡菜豆腐鍋', '豆腐、泡菜、梅花肉片、水、醬油、鹽、蔥、蒜頭、梅花絞肉、韓式辣椒粉、香油、醬油、糖', '1、2、100、500、少許、少許、2、5、50、2、1、1、0.5', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>蔥與蒜頭，切碎末。<p> <hr><h1>2<h1><p>放油，加入蔥蒜拌炒，再放絞肉，炒至肉變白，加入醬油與糖，炒均勻，加入辣椒粉拌炒後，炒約一分鐘，待肉呈現黏稠，加入香油炒ㄧ下，關火。<p> <hr><h1>3<h1><p>開另一鍋子，加水，放入豬肉片，豆腐，與炒好的肉醬，再加入泡菜，帶滾後，加入鹽與醬油調味後，即可。<p> <hr>', '盒、大匙、克、cc、少許、少許、隻、顆、公克、大匙、小匙、小匙、小匙'),
(696, '韓式泡菜豬肉豆腐鍋', '韓國小魚乾、韓國海鮮粉、豬五花肉、韓國泡菜、洋蔥、櫛瓜、糯米椒、蒜、蒜泥、辣椒、醬油、糖、嫩豆腐', '1、1、1、1、1、3、3、1、數顆、2、少許、少許、1', 'PNG', 'https://icook.tw/recipes/', 1, 0, 1, 1, 0, 1, 1, 0, 5, '<hr><h1>1<h1><p>起兩個鍋子\\n\\n第1鍋：放入水，加韓國小魚乾跟海鮮粉熬湯。\\n\\n第2鍋:\\n放入油煎豬五花肉（要煎到稍微恰恰）\\n再放入韓國泡菜（炒到泡菜油出來）\\n放入醬油、辣椒\\n放入切塊的洋蔥（要炒到洋蔥微透的程度）<p> <hr><h1>2<h1><p>這時，把第1鍋的湯底倒進第2鍋來（湯就好，魚丟掉）湯水要蓋過食材再多一個指頭厚度。\\n\\n放入櫛瓜、2匙糖、一大坨蒜泥、2匙韓國辣椒醬、糯米椒、嫩豆腐切塊（煮到水滾）\\n嚐一下味道，起鍋前放入蒜，完成～<p> <hr>', '把、小匙、份、份、顆、根、根、根、數顆、根、少許、少許、盒'),
(697, '韓式烤肉飯', '沙朗牛肉片、蒜、洋蔥、蘋果、奇異果、薑泥、蜂蜜、糖、白酒、醬油、玉米粉、芝麻油', '400、3、1、1/4、1、1/2、2、2、1、80、1、1/2', 'PNG', 'https://icook.tw/recipes/', 1, 0, 0, 0, 0, 0, 0, 0, 5, '<hr><h1>1<h1><p>以刀背將牛肉片敲打鬆軟<p> <hr><h1>2<h1><p>牛肉片切成小塊狀<p> <hr><h1>3<h1><p>將蒜、奇異果、蘋果、洋蔥放入食物調理機內攪打成泥<p> <hr><h1>4<h1><p>果泥和薑泥、蜂蜜、糖、白酒、醬油、玉米粉、芝麻油等全部倒入肉片中混和均勻<p> <hr><h1>5<h1><p>肉片醃製30分鐘<p> <hr><h1>6<h1><p>鍋中加入油，放入洋蔥炒至金黃後加入肉片炒熟<p> <hr><h1>7<h1><p>將炒好的肉蓋在白飯上，撒上白芝麻和青蔥就完成了<p> <hr>', '克、瓣、顆、顆、顆、茶匙、大匙、大匙、大匙、毫升、大匙、茶匙'),
(698, '韓式炒小黃瓜', '小黃瓜、蒜末、鹽、芝麻、香油', '3、適量、適量、適量、適量', 'PNG', 'https://icook.tw/recipes/', 1, 1, 1, 1, 1, 0, 1, 0, 5, '<hr><h1>1<h1><p>1.小黃瓜切片，不要太薄容易糊爛，太厚口感不佳。\\n因為韓國的小黃瓜皮厚又老，吃起來口感不好，所以我們家都會去皮後再料理。\\n台灣的小黃瓜皮薄不用去皮，韓國的小黃瓜很多人也沒去皮的。\\n這一條約200g去皮後約180g。<p> <hr><h1>2<h1><p>2.小黃瓜加鹽搓揉一下，放約半小時左右去青。\\n鹽巴約加2小匙，多了也沒關係，因為這道菜要過炒菜，太鹹的話可以過個水去鹹。<p> <hr><h1>3<h1><p>3.將小黃瓜水分盡量擠出，拿塊布擠比較快，徒手分次擠也可。<p> <hr><h1>4<h1><p>4.起油鍋爆香蒜末，加入小黃瓜拌炒。<p> <hr><h1>5<h1><p>5.拌炒過程中加入香油跟芝麻，不夠鹹的話再多加點鹽巴調味，炒熱即可起鍋。<p> <hr><h1>6<h1><p>6.吃不完的冷藏當涼拌菜，之後取出即可食用。\\n這3條小黃瓜我們2個人一餐就吃光光惹~<p> <hr>', '條、適量、適量、適量、適量');

-- --------------------------------------------------------

--
-- 資料表結構 `chef_account`
--

CREATE TABLE `chef_account` (
  `ID` int(5) NOT NULL,
  `account` varchar(12) NOT NULL,
  `password` varchar(12) NOT NULL,
  `ChefName` varchar(19) NOT NULL COMMENT '廚師姓名',
  `ChefFirstName` varchar(200) NOT NULL,
  `address` varchar(100) NOT NULL COMMENT '住址',
  `phone` varchar(9) NOT NULL COMMENT '電話',
  `approve` int(1) NOT NULL DEFAULT 0 COMMENT '狀態',
  `img` varchar(16) NOT NULL COMMENT '照片',
  `signup_date` date NOT NULL,
  `about` varchar(500) NOT NULL,
  `OnSiteService` int(5) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `chef_account`
--

INSERT INTO `chef_account` (`ID`, `account`, `password`, `ChefName`, `ChefFirstName`, `address`, `phone`, `approve`, `img`, `signup_date`, `about`, `OnSiteService`) VALUES
(30, 'test07', '123456789', '新財', '黃', '高譚市', '123456789', 1, '30.jpg', '2021-03-16', '許多在科技大學教程式設計的同仁，大多感觸很深、感到知識難以傳授給學生，本人也深受其苦。經過多年的折磨終於領悟出，目前各種課程都非常複雜，我們教太多，導致學生無法吸收。又知識取得容易，只要 Google 一下甚麼東西都有，學生都知道只是不會。再說現在學生很忙碌(打工或外務很多)，故課程儘量在課堂內解決，最好不要留給學生回去練習。除此之外，也吸取了許多先進的教學經驗，趕上了時代的潮流，提出『翻轉教學法』並將此理念做成教材。', 0),
(36, 'itchef01', '123456', 'Elise', 'Deat', '高雄市鳥松區澄清路840號', '123456789', 1, 'itc1.png', '2021-05-09', '我們的構想是，在課堂上儘量給學生有事情做，老師講課的時間越短越好；因此，我們設計了翻轉教學教材。教材內提供許多程式範例，老師解釋範例的製作技巧後，讓學生自主輸入練習，接著再利用自我挑戰題目讓學生自主思考。當學生遇到問題時，老師方可即時給予指導。每次上課，做 2~3 題範例，與 1~2 題自我挑戰題目，一個學期下來，學生至少練習與挑戰七八十題目，應該會很有收穫才對。因此，每次上課老師講課的時間很短，有足夠的時間讓學生發問與指導，也可拉近學生與老師之間的距離。', 160),
(37, 'itchef02', '123456', 'Stephane', 'Oulevey', '台北市林森北路路1221號', '123456789', 1, 'itc2.png', '2021-05-10', '簡單的說，我們採用PBL設計教材，將所要傳播的知識放在範例與自我挑戰題目內，讓學生可以從實際演練中，學習到相關的知識。另一方面，學生很難有耐心的收視教學影片，因此，每一段影片都限制在10分鐘內，以6~8分鐘左右效果最好。再說要學生自行收視也是很困難，我都在教室裡播放，因為每段影片時間不長，學生大多還能安靜聽講。遲到或缺課的同學，請他自行收視、做練習與繳交作業，也不會影響他的學習進度。', 150),
(38, 'itchef03', '123456', 'Christophe', 'Bouillault', '高雄市中正路路1220號', '123456789', 1, 'itc3.png', '2021-05-10', '而這些並不是完全重要，更加重要的問題是，我們不妨可以這樣來想: 若沒有李龍輝的存在，那麼後果可想而知。          我們一般認為，抓住了問題的關鍵，其他一切則會迎刃而解。', 100),
(39, 'itchef04', '123456', 'Hélaine', 'Baronheid', '高雄市鳳山區林森路1219號', '123456789', 1, 'itc4.png\r\n', '2021-05-10', '', 170),
(40, 'itchef05', '123456', 'N', 'Aouni', '高雄市新興區七賢路1218號', '123456789', 1, 'itc5.png', '2021-05-10', '', 150),
(41, 'itchef06', '123456', 'Daniele', 'Marcaccini', '高雄市青年路1218號', '123456789', 1, 'itc6.png', '0000-00-00', 'I love tomato', 180),
(43, 'itchef07', '123456', 'Hervé', 'Fayat', '雲林縣鎮南路1216號', '123456789', 1, 'itc7.png\r\n\r\n', '2021-09-27', '', 0),
(44, 'itchef08', '123456', 'Libasse', 'Guenego', '高雄市五甲路1215號', '123456789', 1, 'itc8.png', '2021-09-27', '', 0),
(45, 'itchef09', '123456', 'Patrick', 'Nurbel', '台中市六市嘉東裡鎮南路1214號', '123456789', 1, 'itc9.png', '2021-09-27', '', 0),
(46, 'itchef10', '123456', 'Roberto', 'Ortiz', '雲林鬥六市嘉東裡鎮南路1213號', '123456789', 1, 'itc10.png', '2021-09-27', '', 0),
(47, 'itchef11', '123456', 'Lorenzo', 'Giannini', '高雄市鳳山區誠義路169巷1號', '123456789', 1, 'itc11.png', '2021-09-28', '', 0),
(48, 'itchef12', '123456', 'Alexandre Agavnian', 'Dentico', '桃園市桃園區建新街28巷26號', '123456789', 1, 'itc12.png', '2021-09-28', '', 0),
(49, 'itchef13', '123456', 'Michel', 'Itamae', '台中市西屯區工業三十八路153巷19號', '123456789', 1, 'itc13.png', '2021-09-28', '', 0),
(50, 'itchef14', '123456', 'Alain', 'Temin', '彰化縣員林市靜修路4巷10號', '123456789', 1, 'itc14.png', '2021-09-28', '', 0),
(51, 'itchef15', '123456', 'Sylvain', 'Halbutier', '新北市板橋區莊敬路81巷15號3樓', '158655485', 1, 'itc15.png', '2021-09-28', '', 0),
(52, 'itchef16', '123456', 'Gary', 'Cheikhaoui', '台北市信義區松山路165巷7號', '123456789', 1, 'itc16.png', '2021-09-28', '', 0),
(53, 'itchef17', '123456', 'Isabelle', 'Feffer', '苗栗縣後龍鎮中心路106巷8號3樓', '123459874', 1, 'itc17.png', '2021-09-28', '', 0),
(54, 'itchef18', '123456', 'Fabrice', 'Minter', '台中市北區英才路161巷24號', '123456789', 1, 'itc18.png', '2021-09-28', '', 0),
(55, 'itchef19', '123456', 'Inès', 'Tassot', '新北市蘆洲區得勝街220號', '123456789', 1, 'itc19.png', '2021-09-28', '', 0),
(56, 'itchef20', '123456', 'Enrico', 'Lionti', '新北市樹林區大成路19號', '123456789', 1, 'itc20.png', '2021-09-28', '', 0),
(57, 'itchef21', '123456', 'Benjamin', 'Durand', '台北市中正區羅斯福路二段46號', '145698765', 1, 'itc21.png', '2021-09-28', '', 0),
(58, 'itchef22', '123456', 'Frederic', 'Martins', '高雄市大社區萬金路91號', '123456789', 1, 'itc22.png', '2021-09-28', '', 0),
(59, 'itchef23', '123456', 'Guillaume', 'Lombard', '台中市沙鹿區南斗路134號', '123546789', 1, 'itc23.png', '2021-09-28', '', 0),
(60, 'itchef24', '123456', 'Piotr', 'Korzeń', '嘉義市西區世賢路二段15巷29號', '123456789', 1, 'itc24.png', '2021-09-28', '', 0),
(61, 'itchef25', '123456', 'Hayat', 'Aoujdad', '桃園市中壢區中園路60巷25號1樓', '123456798', 1, 'itc25.png', '2021-09-28', '', 0),
(62, 'itchef26', '123456', 'Jean', 'Luc Gonnet', '桃園市大園區中山北路62巷19號', '123456789', 1, 'itc26.png', '2021-09-28', '', 0),
(63, 'itchef27', '123456', 'Théo', 'Stéphane', '彰化縣員林市員鹿路134巷25號', '123456789', 1, 'itc27.png', '2021-09-28', '', 0),
(64, 'itchef28', '123456', 'Frederic', 'Engel', '新竹市香山區元培街64號', '123456789', 1, 'itc28.png', '2021-09-28', '', 0),
(65, 'itchef29', '123456', 'Clement', ' Gehin', '新北市板橋區忠孝路85巷10號3樓', '123456789', 1, 'itc29.png', '2021-09-28', '', 0),
(66, 'itchef30', '123456', 'Laetitia', 'Granier', '苗栗縣頭份市８鄰中華路137巷4號4樓', '123456789', 1, 'itc30.png', '2021-09-28', '', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `chef_recipe`
--

CREATE TABLE `chef_recipe` (
  `cr_ID` int(5) NOT NULL,
  `cr_chef` int(5) NOT NULL COMMENT '擁有者(廚師)',
  `cr_name` varchar(50) CHARACTER SET utf8 NOT NULL,
  `cr_img` varchar(50) CHARACTER SET utf8 NOT NULL,
  `cr_about` varchar(200) CHARACTER SET utf8 NOT NULL,
  `price` varchar(4) COLLATE utf8_unicode_ci NOT NULL DEFAULT '0' COMMENT '價格',
  `type` int(5) NOT NULL,
  `heartattack` int(3) NOT NULL COMMENT '心臟病',
  `pneumonia` int(3) NOT NULL COMMENT '肺炎',
  `diabetes` int(3) NOT NULL COMMENT '糖尿病',
  `Lower_respiratory_tract` int(3) NOT NULL COMMENT '慢性下呼吸道疾病',
  `hypertension` int(3) NOT NULL COMMENT '高血壓',
  `Nephritis` int(3) NOT NULL COMMENT '腎臟病',
  `Liver` int(3) NOT NULL COMMENT '肝病',
  `IsDefault` int(50) NOT NULL DEFAULT 0 COMMENT '是不是預設食譜，1=是',
  `DefaultRecipeID` int(50) NOT NULL DEFAULT 0 COMMENT '預設食譜:allrec.ID'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `chef_recipe`
--

INSERT INTO `chef_recipe` (`cr_ID`, `cr_chef`, `cr_name`, `cr_img`, `cr_about`, `price`, `type`, `heartattack`, `pneumonia`, `diabetes`, `Lower_respiratory_tract`, `hypertension`, `Nephritis`, `Liver`, `IsDefault`, `DefaultRecipeID`) VALUES
(83, 30, '泰式椒麻雞', '248.png', '', '300', 3, 1, 1, 1, 1, 0, 0, 0, 1, 248),
(84, 30, '泰式檸檬豬', '253.png', '', '560', 3, 1, 0, 0, 1, 0, 1, 0, 1, 253),
(85, 30, '芒果椰汁西米糕', '254.png', '', '600', 3, 0, 1, 0, 1, 0, 0, 1, 1, 254),
(86, 30, '泰式椒麻雞', '255.png', '', '100', 3, 0, 1, 0, 1, 0, 1, 0, 1, 255),
(87, 30, '泰式椰汁雞', '258.png', '', '200', 3, 1, 0, 1, 1, 0, 1, 1, 1, 258),
(88, 30, '泰式雞肉綠咖哩', '259.png', '', '100', 3, 1, 0, 1, 1, 1, 1, 1, 1, 259),
(89, 30, '泰式打拋豬肉飯', '260.png', '', '100', 3, 1, 0, 0, 1, 0, 1, 0, 1, 260),
(90, 30, '泰式涼拌海鮮', '266.png', '', '200', 3, 1, 1, 1, 1, 0, 1, 1, 1, 266),
(91, 30, '泰式涼拌海鮮', '436.png', '', '100', 3, 1, 0, 1, 1, 0, 1, 1, 1, 436),
(92, 30, '泰式涼拌海鮮沙拉', '458.png', '', '150', 3, 1, 0, 1, 0, 1, 1, 1, 1, 458),
(138, 36, '家常義大利肉醬', '69.png', '', '130', 1, 1, 0, 1, 1, 1, 1, 0, 1, 69),
(139, 36, '義式香料紙包雞', '70.png', '', '350', 1, 1, 0, 0, 0, 1, 0, 0, 1, 70),
(140, 36, '義大利雞肉丸子麵', '71.png', '', '130', 1, 1, 1, 1, 1, 1, 0, 1, 1, 71),
(141, 36, '義式起司奶青醬燉飯', '72.png', '', '120', 1, 1, 1, 1, 0, 1, 1, 1, 1, 72),
(142, 36, '經典義大利紅醬', '73.png', '', '100', 1, 1, 1, 1, 1, 1, 1, 1, 1, 73),
(143, 36, '茄汁肉醬義大利麵', '74.png', '', '120', 1, 1, 1, 1, 1, 1, 0, 0, 1, 74),
(144, 36, '義式蕃茄冷麵', '75.png', '', '100', 1, 1, 1, 1, 1, 0, 0, 1, 1, 75),
(145, 36, '清炒海鮮義大利麵', '76.png', '', '125', 1, 1, 1, 1, 1, 1, 1, 1, 1, 76),
(146, 36, '懶人披薩餡', '77.png', '', '80', 1, 1, 1, 1, 1, 1, 0, 0, 1, 77),
(147, 36, '巴沙米克醋炒野菇', '78.png', '', '120', 1, 1, 1, 1, 1, 1, 1, 1, 1, 78),
(148, 37, '提拉米蘇蛋糕', '79.png', '', '150', 1, 0, 1, 0, 1, 0, 0, 1, 1, 79),
(149, 37, '義式涼拌南瓜', '80.png', '', '130', 1, 1, 1, 0, 1, 1, 1, 1, 1, 80),
(150, 37, '義式烤蕃茄', '81.png', '', '80', 1, 1, 1, 1, 1, 1, 0, 0, 1, 81),
(151, 37, '香蒜巴西里義大利麵', '82.png', '', '600', 1, 1, 1, 1, 1, 1, 0, 1, 1, 82),
(152, 37, '義式燉飯', '83.png', '', '600', 1, 0, 0, 0, 1, 1, 1, 0, 1, 83),
(153, 37, '千層麵', '84.png', '', '150', 1, 1, 1, 1, 1, 1, 0, 1, 1, 84),
(154, 37, '氣炸雞腿排', '85.png', '', '600', 1, 1, 1, 1, 1, 1, 0, 0, 1, 85),
(155, 37, '肉醬千層麵', '86.png', '', '600', 1, 1, 1, 1, 1, 0, 0, 0, 1, 86),
(156, 37, '自製免發酵薄片披薩', '87.png', '', '600', 1, 0, 1, 0, 1, 0, 0, 0, 1, 87),
(157, 37, '義式檸檬香雞排CHICKENPICCA', '88.png', '', '600', 1, 1, 1, 0, 1, 1, 1, 0, 1, 88),
(158, 38, '橄欖油漬番茄', '89.png', '', '400', 1, 1, 1, 1, 1, 1, 0, 1, 1, 89),
(159, 38, '義式番茄肉醬烤櫛瓜', '90.png', '', '400', 1, 1, 1, 1, 1, 1, 0, 1, 1, 90),
(160, 38, '義式蔬菜筆管麵', '91.png', '', '400', 1, 1, 1, 1, 1, 1, 1, 1, 1, 91),
(161, 38, '咖啡義式堅果脆餅', '92.png', '', '400', 1, 1, 1, 0, 1, 0, 1, 1, 1, 92),
(162, 38, '義式香料烤馬鈴薯', '93.png', '', '400', 1, 0, 1, 0, 1, 1, 1, 0, 1, 93),
(163, 38, '希臘香料燉雞', '94.png', '', '400', 1, 1, 0, 1, 1, 1, 1, 0, 1, 94),
(164, 38, '義式甜菜根燉飯', '95.png', '', '400', 1, 1, 0, 0, 1, 1, 0, 0, 1, 95),
(165, 38, '義式馬卡龍ItalianMacaron', '96.png', '', '400', 1, 0, 1, 0, 1, 0, 1, 1, 1, 96),
(166, 38, 'Gnocchi', '97.png', '', '400', 1, 1, 1, 1, 1, 1, 1, 1, 1, 97),
(167, 38, '義式水煮魚', '98.png', '', '400', 1, 1, 1, 1, 1, 1, 1, 0, 1, 98),
(168, 39, '義式佛卡夏麵包', '99.png', '', '500', 1, 1, 1, 1, 1, 1, 1, 1, 1, 99),
(169, 39, '義式蔬菜湯', '100.png', '', '500', 1, 1, 1, 1, 1, 1, 1, 0, 1, 100),
(170, 39, '義式香料野菇燉飯佐橄欖油櫛瓜', '101.png', '', '500', 1, 0, 1, 1, 1, 1, 1, 1, 1, 101),
(171, 39, '義式蕃茄燉飯', '102.png', '', '550', 1, 0, 1, 1, 1, 1, 1, 0, 1, 102),
(172, 39, '經典肉醬千層麵', '103.png', '', '550', 1, 1, 1, 1, 1, 1, 0, 0, 1, 103),
(173, 39, '無油無泡打粉蜂蜜義式脆片', '104.png', '', '550', 1, 1, 1, 0, 1, 0, 0, 1, 1, 104),
(174, 39, '菠菜肉醬千層麵', '105.png', '', '600', 1, 1, 0, 0, 1, 1, 0, 0, 1, 105),
(175, 39, '義大利蛋餅Frittata', '106.png', '', '600', 1, 0, 0, 0, 0, 1, 0, 0, 1, 106),
(176, 39, '義式豬肉蔬菜捲', '107.png', '', '450', 1, 1, 1, 1, 1, 1, 0, 1, 1, 107),
(177, 39, '意式餡餅Focacce', '108.png', '', '650', 1, 1, 1, 1, 1, 1, 0, 1, 1, 108),
(178, 40, '義式香料烤蔬菜', '109.png', '', '550', 1, 1, 1, 1, 1, 1, 0, 0, 1, 109),
(179, 40, 'Biscotti義大利杏仁脆餅', '110.png', '', '550', 1, 0, 1, 0, 1, 0, 1, 1, 1, 110),
(180, 40, '義式蕃茄奶油燉飯', '111.png', '', '400', 1, 0, 1, 1, 1, 1, 0, 0, 1, 111),
(181, 40, '義式料理-肉醬千層麵', '112.png', '', '450', 1, 1, 1, 1, 1, 1, 1, 1, 1, 112),
(182, 40, '自製藍莓優格義式冰淇淋byCara', '113.png', '', '650', 1, 1, 1, 0, 1, 1, 0, 1, 1, 113),
(183, 40, '低醣廚房-義式起司肉丸', '114.png', '', '150', 1, 0, 0, 0, 1, 1, 0, 0, 1, 114),
(184, 40, '義式蒜香彩椒雞', '115.png', '', '345', 1, 1, 0, 1, 1, 1, 1, 1, 1, 115),
(185, 40, '義式水煮魚', '116.png', '', '400', 1, 1, 0, 1, 1, 1, 1, 0, 1, 116),
(186, 40, '義式香料番茄燉牛肉', '117.png', '', '200', 1, 1, 0, 0, 0, 1, 1, 0, 1, 117),
(187, 40, '義大利麵包佛卡夏', '118.png', '', '100', 1, 1, 1, 0, 1, 1, 0, 1, 1, 118),
(188, 40, '傳統義式肉醬麵', '119.png', '', '120', 1, 1, 1, 0, 1, 1, 1, 0, 1, 119),
(189, 57, '韓式辣豆腐鍋', '285.png', '', '230', 5, 0, 0, 0, 0, 1, 1, 1, 1, 285),
(190, 57, '超簡易韓式湯冷麵作法', '286.png', '很好吃', '120', 5, 1, 1, 1, 1, 1, 0, 1, 1, 286),
(191, 57, '韓式糖醋肉', '287.png', '', '100', 5, 1, 1, 1, 1, 1, 0, 1, 1, 287),
(192, 57, '韓式醃蘿蔔', '288.png', '', '60', 5, 0, 1, 0, 1, 0, 0, 1, 1, 288),
(193, 57, '韓式神仙雪濃湯', '289.png', '', '150', 5, 0, 0, 0, 1, 1, 0, 0, 1, 289),
(194, 57, '韓式海鮮嫩豆腐辣湯鍋', '290.png', '', '150', 5, 1, 1, 1, 1, 1, 1, 1, 1, 290),
(195, 57, '泡菜汁炒洋蔥肉片', '291.png', '', '120', 5, 1, 1, 1, 1, 1, 1, 1, 1, 291),
(196, 57, '韓國傳統粉紅魚腸料理', '292.png', '', '100', 5, 1, 1, 1, 1, 1, 0, 1, 1, 292),
(197, 58, '韓式新豬肉嫩豆腐鍋', '293.png', '', '120', 5, 1, 1, 0, 1, 1, 1, 1, 1, 293),
(198, 58, '韓式涼拌黃豆芽', '295.png', '', '70', 5, 0, 1, 0, 1, 0, 0, 0, 1, 295),
(199, 58, '韓式柚子醬涼拌海帶芽', '296.png', '', '70', 5, 1, 0, 1, 0, 1, 0, 1, 1, 296),
(200, 58, '韓式牽絲蛋餅', '297.png', '', '70', 5, 0, 1, 0, 1, 1, 1, 1, 1, 297),
(201, 58, '簡易韓式飯捲', '294.png', '', '90', 5, 1, 1, 1, 1, 1, 1, 1, 1, 294),
(202, 58, '韓式芝士泡菜豚肉蟹柳蛋絲紫菜卷', '298.png', '', '90', 5, 0, 1, 0, 1, 0, 1, 1, 1, 298),
(203, 58, '韓式辣炒年糕', '299.png', '', '90', 5, 1, 1, 0, 0, 1, 1, 0, 1, 299),
(204, 58, '韓式辣炒豬肉', '300.png', '', '120', 5, 1, 0, 0, 0, 1, 1, 0, 1, 300),
(205, 41, '義大利牛肉蕃茄濃湯', '135.png', '', '169', 1, 0, 1, 1, 1, 0, 1, 0, 1, 135),
(206, 41, '義式羅勒番茄冷湯', '138.png', '', '169', 1, 1, 0, 1, 0, 1, 1, 0, 1, 138),
(207, 41, '蒜香蜂蜜烤蕃茄＿簡單義式開胃菜', '140.png', '', '169', 1, 1, 1, 0, 1, 1, 1, 0, 1, 140),
(208, 41, '義式蕃茄燉牛肉', '141.png', '', '169', 1, 1, 1, 1, 0, 1, 0, 0, 1, 141),
(209, 41, '義式蕃茄牛肉湯', '148.png', '', '169', 1, 1, 1, 1, 1, 1, 1, 0, 1, 148),
(210, 41, '義式茄汁肉丸', '153.png', '', '169', 1, 1, 1, 1, 1, 1, 0, 1, 1, 153),
(211, 41, '義式茄汁肉丸', '157.png', '', '169', 1, 0, 1, 0, 1, 1, 0, 1, 1, 157);

-- --------------------------------------------------------

--
-- 資料表結構 `chef_recipe_ingredient`
--

CREATE TABLE `chef_recipe_ingredient` (
  `cri_ID` int(5) NOT NULL,
  `cri_recipe` int(5) NOT NULL,
  `cri_ingName` varchar(50) CHARACTER SET utf8 NOT NULL,
  `cri_ingNum` int(5) NOT NULL,
  `cri_ingUnit` varchar(10) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `chef_recipe_ingredient`
--

INSERT INTO `chef_recipe_ingredient` (`cri_ID`, `cri_recipe`, `cri_ingName`, `cri_ingNum`, `cri_ingUnit`) VALUES
(2066, 83, '去骨雞腿', 2, '支'),
(2067, 83, '高麗菜絲', 0, '適量'),
(2068, 83, '蒜末', 5, '瓣'),
(2069, 83, '香菜末', 1, '支'),
(2070, 83, '辣椒', 1, '支'),
(2071, 83, '烏醋', 1, '匙'),
(2072, 83, '醬油', 2, '匙'),
(2073, 83, '水', 0, '適量'),
(2074, 83, '魚露', 0, '適量'),
(2075, 83, '檸檬汁', 1, '顆'),
(2076, 83, '糖', 1, '小匙'),
(2077, 84, '芥藍菜', 1, '把'),
(2078, 84, '香菜', 0, '適量'),
(2079, 84, '辣椒', 1, '根'),
(2080, 84, '蒜頭', 2, '瓣'),
(2081, 84, '檸檬汁', 1, '顆'),
(2082, 84, '砂糖', 2, '茶匙'),
(2083, 84, '魚露', 2, '茶匙'),
(2084, 84, '豬五花', 200, 'g'),
(2085, 84, '米酒', 0, '適量'),
(2086, 85, '西米', 50, 'g'),
(2087, 85, '椰汁', 150, 'mL'),
(2088, 85, '芒果', 1, '個'),
(2089, 85, '糖', 30, 'g'),
(2090, 85, '鹽', 1, '小撮'),
(2091, 85, '生粉', 25, 'g'),
(2092, 85, '水', 125, 'mL'),
(2093, 85, '熱水', 125, 'mL'),
(2094, 86, '美國雞腿骨', 2, '支'),
(2095, 86, '高麗菜', 0, '顆'),
(2096, 86, '地瓜粉', 1, '碗'),
(2097, 86, '沙拉油', 0, '適量'),
(2098, 86, '魚露', 3, '大匙'),
(2099, 86, '糖', 1, '大匙'),
(2100, 86, '冷開水', 3, '大匙'),
(2101, 86, '蒜末', 1, '大匙'),
(2102, 86, '辣椒末', 1, '大匙'),
(2103, 86, '檸檬汁', 3, '大匙'),
(2104, 86, '酒', 2, '大匙'),
(2105, 86, '醬油', 4, '大匙'),
(2106, 86, '五香粉', 1, '小匙'),
(2107, 86, '胡椒粉', 1, '小匙'),
(2108, 86, '糖', 1, '大匙'),
(2109, 87, '椰子', 1, '顆'),
(2110, 87, '雞胸肉', 1, '盒'),
(2111, 87, '椰子水', 0, '適量'),
(2112, 87, '椰子肉', 0, '適量'),
(2113, 87, '蘑菇', 1, '包'),
(2114, 87, '椰奶', 200, 'ml'),
(2115, 87, '辣椒', 0, '適量'),
(2116, 87, '南薑', 1, '大塊'),
(2117, 87, '香茅', 1, '支'),
(2118, 87, '香菜葉', 0, '適量'),
(2119, 87, '香菜根', 3, '株'),
(2120, 87, '檸檬葉', 6, '片'),
(2121, 87, '檸檬汁', 0, '適量'),
(2122, 87, '砂糖', 0, '適量'),
(2123, 87, '魚露', 0, '適量'),
(2124, 87, '辣椒', 0, '適量'),
(2125, 88, '薑黃粉', 1, '茶匙'),
(2126, 88, '芫荽籽粉', 1, '茶匙'),
(2127, 88, '白胡椒粉', 0, '少許'),
(2128, 88, '鹽', 0, '少許'),
(2129, 88, '開水', 5, '大匙'),
(2130, 88, '有心綠咖哩醬', 2, '大匙'),
(2131, 88, '南薑', 1, '塊'),
(2132, 88, '檸檬葉', 6, '片'),
(2133, 88, '香茅', 2, '支'),
(2134, 88, '蒜末', 1, '茶匙'),
(2135, 88, '紅蔥頭末', 1, '大匙'),
(2136, 88, '辣椒', 1, '支'),
(2137, 88, '九層塔', 0, '適量'),
(2138, 88, 'KARA 濃椰漿', 100, 'ml'),
(2139, 88, '雞棒腿切塊', 1, '盒'),
(2140, 88, '泰國圓茄', 1, '袋'),
(2141, 88, '魚露', 0, '適量'),
(2142, 88, '棕櫚糖', 0, '適量'),
(2143, 89, '豬絞肉', 1, '斤'),
(2144, 89, '蒜頭', 3, '顆'),
(2145, 89, '辣椒', 0, '適量'),
(2146, 89, '牛番茄', 1, '顆'),
(2147, 89, '九層塔', 1, '把'),
(2148, 89, '米酒', 0, '少許'),
(2149, 89, '醬油', 2, '匙'),
(2150, 89, '砂糖', 2, '小匙'),
(2151, 89, '泰式魚露', 3, '匙'),
(2152, 89, '檸檬', 1, '顆'),
(2153, 90, '蝦子（開背）', 6, '隻'),
(2154, 90, '小卷（片）', 1, '隻'),
(2155, 90, '九層塔（末）', 1, '株'),
(2156, 90, '蒜（末）', 3, '瓣'),
(2157, 90, '辣椒（末）', 1, '根'),
(2158, 90, '小黃瓜（片）', 1, '根'),
(2159, 90, '醬油', 1, '匙'),
(2160, 90, '味霖', 1, '匙'),
(2161, 90, '魚露', 1, '匙'),
(2162, 90, '檸檬汁', 1, '個'),
(2163, 90, '糖', 1, '匙'),
(2164, 90, '鮮蝦', 15, '隻'),
(2165, 90, '透抽', 2, '隻'),
(2166, 90, '洋蔥', 1, '顆'),
(2167, 90, '甜椒', 0, '顆'),
(2168, 90, '檸檬', 2, '顆'),
(2169, 90, '香菜', 1, '小把'),
(2170, 90, '蒜頭', 3, '顆'),
(2171, 90, '糖', 3, '大匙'),
(2172, 90, '魚露', 2, '大匙'),
(2173, 90, '辣椒', 1, '條'),
(2174, 92, '冷凍海鮮', 0, '包'),
(2175, 92, '泰式甜辣醬', 0, '大匙'),
(2176, 92, '市售檸檬汁', 0, '匙'),
(2177, 92, '清水', 0, '少許'),
(2178, 92, '洋蔥', 0, '顆'),
(2179, 92, '雞粉', 0, '少許'),
(2180, 92, '蒜頭', 0, '瓣'),
(2181, 92, '香菜', 0, '隨意'),
(2182, 92, '蟹肉棒', 0, '隨意'),
(2629, 138, '牛絞肉', 250, 'g'),
(2630, 138, '豬絞肉', 200, 'g'),
(2631, 138, '紅酒', 0, ''),
(2632, 138, '番茄醬', 25, 'g'),
(2633, 138, '紅椒粉', 1, '大匙'),
(2634, 138, '高湯', 250, 'g'),
(2635, 138, '蒜頭', 1, '大匙'),
(2636, 138, '洋蔥', 25, 'g'),
(2637, 138, 'Mozzarella起司', 1, '朵'),
(2638, 138, '巴西里葉', 0, ''),
(2639, 139, '帶骨雞腿', 3, '支'),
(2640, 139, '洋蔥', 1, '顆'),
(2641, 139, '紅蘿蔔', 1, '根'),
(2642, 139, '無鹽奶油', 0, '少許'),
(2643, 139, '義大利綜合香料', 5, 'g'),
(2644, 139, '黑胡椒粒', 3, 'g'),
(2645, 139, '蒜泥', 15, 'g'),
(2646, 139, '米酒', 30, 'g'),
(2647, 139, '鹽巴', 2, '茶匙'),
(2648, 140, '雞胸肉或雞里肌', 1, 'kg'),
(2649, 140, '大蒜', 4, '瓣'),
(2650, 140, '奧勒岡粉', 2, '小匙'),
(2651, 140, '新鮮巴西里', 2, '大匙'),
(2652, 140, '鹽', 2, '小匙'),
(2653, 140, '黑胡椒', 1, '小匙'),
(2654, 140, '麵包粉', 170, 'g'),
(2655, 140, '帕瑪森乳酪粉', 100, 'g'),
(2656, 140, '辣椒片', 0, '隨意'),
(2657, 140, '蛋', 2, '顆'),
(2658, 140, '自製或市售義大利紅醬', 500, 'ml'),
(2659, 140, '白酒', 118, 'ml'),
(2660, 140, '牛奶', 118, 'ml'),
(2661, 140, '義大利麵', 454, 'g'),
(2662, 140, '鹽', 0, '適量'),
(2663, 141, '雞肉', 500, 'g'),
(2664, 141, '南瓜', 1, '顆'),
(2665, 141, '花椰菜', 1, '朵'),
(2666, 141, '鴻禧菇', 1, '包'),
(2667, 141, '白醬', 1, '包'),
(2668, 141, '起司', 0, '酌量'),
(2669, 141, '高湯', 3, '碗'),
(2670, 141, '白飯', 4, '碗'),
(2671, 141, '油', 2, '匙'),
(2672, 141, '洋蔥', 0, '辦克'),
(2673, 141, '青醬', 2, '包'),
(2674, 142, '番茄罐頭', 1600, 'g'),
(2675, 142, '黃洋蔥', 1, '棵'),
(2676, 142, '大蒜', 2, '瓣'),
(2677, 142, '紅蘿蔔', 1, '條'),
(2678, 142, '西芹', 1, '條'),
(2679, 142, '鹽', 1, '小匙'),
(2680, 142, '黑胡椒', 1, '小匙'),
(2681, 142, '乾奧勒岡', 1, '大匙'),
(2682, 142, '乾羅勒', 1, '大匙'),
(2683, 142, '月桂葉', 2, '片'),
(2684, 142, '二砂', 1, '大匙'),
(2685, 142, '奶油', 2, '大匙'),
(2686, 143, '義大利麵', 60, 'g'),
(2687, 143, '牛絞肉', 70, 'g(一掌心）'),
(2688, 143, '橄欖油', 10, 'g'),
(2689, 143, '鹽水', 5, '5:1000'),
(2690, 143, '番茄醬', 5, 'g'),
(2691, 143, '黑胡椒', 1, 't'),
(2692, 143, '牛番茄', 2, '顆'),
(2693, 143, '九層塔', 0, '幾片'),
(2694, 143, '蒜頭', 3, '瓣'),
(2695, 144, '義大利麵', 100, 'g'),
(2696, 144, '橄欖油', 2, '匙'),
(2697, 144, '鹽巴', 1, '小匙'),
(2698, 144, '牛番茄', 1, '顆'),
(2699, 144, '小黃瓜', 1, '條'),
(2700, 144, '洋蔥', 1, '顆'),
(2701, 144, '蒜頭', 3, '顆'),
(2702, 144, '義大利香料 黑胡椒粒', 0, '適量'),
(2703, 144, '檸檬', 1, '顆'),
(2704, 144, '糖', 1, '小匙'),
(2705, 144, 'Tabasco', 1, '小匙'),
(2706, 144, '鹽巴', 1, '小匙'),
(2707, 145, '蝦子', 10, '隻'),
(2708, 145, '小卷', 1, '隻'),
(2709, 145, '花枝', 1, '顆'),
(2710, 145, '甜椒', 1, '包'),
(2711, 145, '美白菇', 1, '顆'),
(2712, 145, '洋蔥絲', 3, '顆'),
(2713, 145, '蒜頭', 1, '包'),
(2714, 145, '義大利麵', 0, '適量'),
(2715, 145, '黑胡椒粒', 0, '適量'),
(2716, 145, '胡椒粉', 0, '適量'),
(2717, 145, '鹽巴', 0, '適量'),
(2718, 145, '辣椒粉', 0, '適量'),
(2719, 145, '乳酪絲', 0, ''),
(2720, 146, '起司', 0, '個人喜好'),
(2721, 146, '番茄醬', 0, '個人喜好'),
(2722, 146, '蛋', 1, '顆'),
(2723, 146, '吐司', 1, '片'),
(2724, 146, '生菜', 0, '個人喜好'),
(2725, 146, '火腿', 1, '片'),
(2726, 146, '鮪魚罐頭', 2, '匙'),
(2727, 147, '鮮香菇', 8, '朵'),
(2728, 147, '杏鮑菇', 4, '根1包'),
(2729, 147, '鴻禧菇', 1, '粒'),
(2730, 147, '蒜頭', 3, '適量'),
(2731, 147, '橄欖油', 0, 'g'),
(2732, 147, '乾燥牛肝菌', 10, '大匙'),
(2733, 147, '巴沙米克醋', 1, '適量'),
(2734, 147, '鹽', 0, '適量'),
(2735, 147, '黑胡椒', 0, 'g'),
(2736, 147, '奶油', 10, ''),
(2737, 148, '馬斯卡彭乳酪', 250, 'g'),
(2738, 148, '動物性鮮奶油', 250, 'g'),
(2739, 148, '蛋黃', 3, '顆'),
(2740, 148, '砂糖', 50, 'g'),
(2741, 148, '吉利丁片', 11, 'g'),
(2742, 148, '濃縮咖啡', 1, '小杯'),
(2743, 148, '咖啡酒', 0, '少許(可有可無)'),
(2744, 148, '可可粉', 0, '適量(裝飾用)'),
(2745, 149, '南瓜', 0, '顆'),
(2746, 149, '蒜末', 0, '瓣'),
(2747, 149, '紅辣椒末', 0, '條'),
(2748, 149, '糯米醋', 0, '大匙'),
(2749, 149, '紅葡萄酒', 0, '大匙'),
(2750, 149, '烹大師或鹽巴', 0, '適量'),
(2751, 149, '冰糖', 0, '大匙'),
(2752, 149, '義大利香料', 0, '適量'),
(2753, 149, '迷迭香料', 0, '適量'),
(2754, 149, '白芝麻', 0, '適量'),
(2755, 150, '牛蕃茄', 3, '顆'),
(2756, 150, '橄欖油', 1, '大匙'),
(2757, 150, '義式香料', 1, '大匙'),
(2758, 150, '黑胡椒', 1, '小匙'),
(2759, 150, '鹽', 1, '小匙'),
(2760, 150, '巴薩米克醋', 3, '大匙'),
(2761, 150, '義式乾酪粉', 3, '大匙'),
(2762, 151, '義大利麵', 200, 'g'),
(2763, 151, '橄欖油', 0, '覆蓋滿整個平底鍋的量'),
(2764, 151, '新鮮巴西里葉', 30, 'g'),
(2765, 151, '大蒜', 8, '瓣'),
(2766, 151, '鹽巴', 0, '適量'),
(2767, 151, '黑胡椒', 0, '比平常調味再多一些'),
(2768, 152, '豌豆', 0, '適量'),
(2769, 152, '蠶豆', 1, '個'),
(2770, 152, '洋蔥', 60, 'g'),
(2771, 152, '培根', 150, 'g'),
(2772, 152, '米', 20, 'g'),
(2773, 152, '奶油', 50, 'cc'),
(2774, 152, '白葡萄酒', 800, 'cc'),
(2775, 152, '蔬菜高湯', 40, 'g'),
(2776, 152, 'Parmesan 起司', 0, '適量'),
(2777, 152, '荷蘭芹', 10, 'g'),
(2778, 152, 'butter', 0, ''),
(2779, 153, '千層麵', 12, '片'),
(2780, 153, '莫札瑞拉起士絲', 600, 'g'),
(2781, 153, '帕瑪森起士粉', 100, 'g'),
(2782, 153, '橄欖油', 0, '適量'),
(2783, 153, '無鹽奶油', 80, 'g'),
(2784, 153, '低筋麵粉', 80, 'g'),
(2785, 153, '牛奶', 500, 'ml'),
(2786, 153, '牛絞肉', 300, 'g'),
(2787, 153, '洋蔥', 1, '顆'),
(2788, 153, '蒜頭', 5, '瓣'),
(2789, 153, '番茄肉醬罐頭', 1, '瓶'),
(2790, 153, '番茄切塊罐頭', 1, '瓶'),
(2791, 153, '番茄糊', 1, '小瓶'),
(2792, 153, '水', 150, 'ml'),
(2793, 153, '黑胡椒', 0, '適量'),
(2794, 153, '鹽', 0, '適量'),
(2795, 154, '雞腿排', 600, '克'),
(2796, 154, '蒜頭', 4, '瓣'),
(2797, 154, '甜椒', 3, '顆'),
(2798, 154, '小番茄', 18, '顆'),
(2799, 154, '橄欖油', 1, '大匙'),
(2800, 154, '義式香料', 0, '適量'),
(2801, 154, '鹽巴', 0, '適量'),
(2802, 154, '黑胡椒', 0, '適量'),
(2803, 155, '豬絞肉', 400, 'g'),
(2804, 155, '洋蔥', 1, '顆'),
(2805, 155, '番茄', 1, '顆'),
(2806, 155, '蒜頭', 4, '顆'),
(2807, 155, '紅蘿蔔', 1, '條'),
(2808, 155, '高湯', 1, '罐'),
(2809, 155, '麵片', 6, '片'),
(2810, 155, '起司絲', 0, '適量'),
(2811, 155, '橄欖油', 0, '適量'),
(2812, 155, '番茄醬', 60, 'g'),
(2813, 155, '月桂葉', 2, '片'),
(2814, 155, '百里香', 1, 'T'),
(2815, 155, '義大利綜合香料', 1, 'T'),
(2816, 155, '鹽', 0, '適量'),
(2817, 155, '糖', 0, '適量'),
(2818, 155, '胡椒', 0, '適量'),
(2819, 156, '奶油', 10, '克'),
(2820, 156, '糖', 2, '克'),
(2821, 156, '鹽', 2, 'g'),
(2822, 156, '中筋麵粉', 250, 'g'),
(2823, 156, '冰水', 140, 'cc'),
(2824, 156, '喜歡的蔬菜', 0, '切小塊裝'),
(2825, 156, '番茄醬', 0, '適量'),
(2826, 156, '蝦仁', 8, '尾'),
(2827, 156, '甜羅勒', 0, '適量'),
(2828, 157, '雞胸', 480, 'g'),
(2829, 157, '奶油', 40, 'g'),
(2830, 157, '橄欖油', 1, '大匙'),
(2831, 157, '白酒', 250, 'cc'),
(2832, 157, '檸檬汁', 2, '大匙'),
(2833, 157, '大蒜', 1, '瓣'),
(2834, 157, '紅蔥頭', 2, '瓣'),
(2835, 157, '酸豆', 30, '顆'),
(2836, 157, '麵粉', 3, '大匙'),
(2837, 157, '義大利香料', 0, '適量'),
(2838, 157, '鹽', 0, '適量'),
(2839, 157, '胡椒', 1, '一些'),
(2840, 157, '義大利香芹', 0, ''),
(2841, 158, '牛番茄（大顆）', 1, '顆'),
(2842, 158, '蒜片', 1, '瓣'),
(2843, 158, '義式香料', 1, '小匙'),
(2844, 158, '鹽', 0, '少許'),
(2845, 158, '橄欖油', 0, 'ml'),
(2846, 159, '黃櫛瓜', 1, '條'),
(2847, 159, '綠櫛瓜', 1, '條'),
(2848, 159, '茄子', 1, '條'),
(2849, 159, '義式肉醬', 0, '適量'),
(2850, 159, '黑胡椒粉', 0, '適量'),
(2851, 159, '鹽', 0, '適量'),
(2852, 159, '莫札瑞拉起司', 0, ''),
(2853, 159, '洋香菜粉', 0, ''),
(2854, 160, '大筆管麵', 200, 'g'),
(2855, 160, '海鹽', 0, '少許'),
(2856, 160, '橄欖油', 0, '少許'),
(2857, 160, '帕馬森起司', 10, 'g'),
(2858, 160, '莫札瑞拉起司', 3, '片'),
(2859, 160, '小黃瓜', 2, '根'),
(2860, 160, '黃櫛瓜', 1, '根'),
(2861, 160, '綠櫛瓜', 1, '根'),
(2862, 160, '紅甜椒', 1, '顆'),
(2863, 160, '番茄', 1, '顆'),
(2864, 160, '茄子', 80, 'g'),
(2865, 160, '番茄糊', 150, 'g'),
(2866, 160, '高湯', 100, 'g'),
(2867, 160, '大蒜', 3, '瓣'),
(2868, 160, '洋蔥', 1, '顆'),
(2869, 160, '橄欖油', 2, '匙'),
(2870, 160, '百里香', 8, 'g'),
(2871, 160, '迷迭香', 10, 'g'),
(2872, 160, '羅勒葉', 0, '少許'),
(2873, 160, '海鹽', 1, '小匙'),
(2874, 160, '黑胡椒', 1, '小匙'),
(2875, 161, '杏仁粉', 115, '克'),
(2876, 161, '砂糖', 40, '克'),
(2877, 161, '無鹽奶油', 15, '克'),
(2878, 161, '巧克力豆', 15, '克'),
(2879, 161, '泡打粉', 1, '克'),
(2880, 161, '全蛋', 1, '顆'),
(2881, 161, '咖啡粉', 3, '克'),
(2882, 161, '糖粉', 10, '克'),
(2883, 161, '堅果', 25, '克'),
(2884, 162, 'Baby馬鈴薯（全聯）', 1, '袋'),
(2885, 162, '史雲生雞高湯', 250, 'ml'),
(2886, 162, '冷壓橄欖油', 2, '大匙'),
(2887, 162, '奶油', 10, 'g'),
(2888, 162, '蒜頭', 6, '粒'),
(2889, 162, '黑胡椒', 0, '少許'),
(2890, 162, '義式香料', 0, '適量'),
(2891, 163, '土雞', 1, '隻'),
(2892, 163, '麵粉', 0, '適量'),
(2893, 163, '冷壓橄欖油', 3, '大匙'),
(2894, 163, '九層塔或新鮮羅勒', 30, '片'),
(2895, 163, '蒜頭', 15, '粒'),
(2896, 163, '洋蔥', 1, '顆'),
(2897, 163, '小番茄', 0, 'g'),
(2898, 163, '鴻禧菇', 20, '粒'),
(2899, 163, '史雲生雞高湯', 1, '包'),
(2900, 163, '白酒', 250, 'ml'),
(2901, 163, '黑胡椒', 100, 'ml'),
(2902, 163, '摩洛哥檸檬或黃檸檬片', 0, '適量'),
(2903, 163, '鹽', 2, '片'),
(2904, 164, '泰國香米', 40, 'g'),
(2905, 164, '甜菜根', 40, 'g'),
(2906, 164, '紅蔥頭碎', 2, '顆'),
(2907, 164, '白葡萄酒', 2, '小匙'),
(2908, 164, '昆布柴魚高湯', 0, '適量'),
(2909, 164, '鹽', 0, '少許'),
(2910, 164, '胡椒粉', 0, '少許'),
(2911, 164, '起司', 10, 'g'),
(2912, 165, '杏仁粉', 100, 'g'),
(2913, 165, '糖粉', 90, 'g'),
(2914, 165, '蛋白', 35, 'g'),
(2915, 165, '食物色素膠', 1, '點'),
(2916, 165, '蛋白', 42, 'g'),
(2917, 165, '糖', 23, 'g'),
(2918, 165, '水', 27, 'g'),
(2919, 165, '糖', 60, 'g'),
(2920, 166, '薯仔', 1, '個'),
(2921, 166, '中筋麵粉', 50, '克'),
(2922, 167, '鱸魚魚片', 7, '片'),
(2923, 167, '牛番茄', 2, '顆'),
(2924, 167, '小黃瓜', 1, '根'),
(2925, 167, '芹菜', 1, '根'),
(2926, 167, '蒜頭', 4, '瓣'),
(2927, 167, '蛤蜊', 10, '顆'),
(2928, 167, '米酒', 1, '米杯'),
(2929, 167, '鹽', 0, '適量'),
(2930, 167, '黑胡椒', 0, '適量'),
(2931, 167, '迷迭香', 0, '適量'),
(2932, 168, '高筋麵粉', 280, 'g'),
(2933, 168, '細砂糖', 15, 'g'),
(2934, 168, '冰水', 190, 'ml'),
(2935, 168, '橄欖油', 30, 'ml'),
(2936, 168, '速發酵母', 3, 'g'),
(2937, 168, '青花椰菜', 0, '適量'),
(2938, 168, '小蕃茄', 0, '適量'),
(2939, 168, '迷迭香', 0, '少許'),
(2940, 168, '橄欖油', 50, 'ml'),
(2941, 168, '黑胡椒粉', 0, '少許'),
(2942, 168, '海鹽', 0, '少許'),
(2943, 168, '', 0, ''),
(2944, 169, '洋蔥', 1, '顆（60克）'),
(2945, 169, '西芹', 3, '根（60克）'),
(2946, 169, '紅蘿蔔', 1, '條（60克）'),
(2947, 169, '甜椒', 2, '顆（60克）'),
(2948, 169, '培根', 2, '片'),
(2949, 169, '高湯', 1000, ' c.c'),
(2950, 169, '小番茄', 100, '克'),
(2951, 169, '節瓜', 1, '條（60克）'),
(2952, 169, '鹽', 0, '適量'),
(2953, 169, '白胡椒', 0, '適量'),
(2954, 170, '白米', 2, '杯'),
(2955, 170, '鴻禧菇', 0, '顆'),
(2956, 170, '小白菇', 0, '顆'),
(2957, 170, '洋菇', 7, '顆'),
(2958, 170, '碗豆', 0, '適量'),
(2959, 170, '洋蔥', 0, '顆'),
(2960, 170, '櫛瓜', 1, '節'),
(2961, 170, '起司絲', 0, '適量'),
(2962, 170, '橄欖油', 0, '適量'),
(2963, 170, '奶油', 20, 'g'),
(2964, 170, '雞高湯', 2, '杯'),
(2965, 170, '料理用鮮奶油', 200, 'ml'),
(2966, 170, '黑胡椒粉', 0, '適量'),
(2967, 170, '海鹽', 0, '適量'),
(2968, 171, '牛蕃茄', 1, '顆'),
(2969, 171, '杏苞菇', 1, '條'),
(2970, 171, '玉米筍', 4, '支'),
(2971, 171, '洋蔥', 3, '顆'),
(2972, 171, '豬肉', 0, '些許'),
(2973, 171, '米', 1, '杯'),
(2974, 171, '水', 1, '杯'),
(2975, 171, '鹽', 1, '小匙'),
(2976, 171, '黑胡椒', 0, '酌量'),
(2977, 171, '義式綜合香料', 0, '酌量'),
(2978, 171, '奶油', 1, '小塊'),
(2979, 171, '橄欖油', 0, '酌量'),
(2980, 172, '千層麵', 8, '片'),
(2981, 172, '番茄醬', 2, '杯'),
(2982, 172, '瑞可達起司', 1, '杯'),
(2983, 172, '牛絞肉', 200, 'g'),
(2984, 172, '洋菇', 8, '朵'),
(2985, 172, '培根', 4, '片'),
(2986, 172, '起司絲', 2, '杯'),
(2987, 172, '九層塔', 2, '段'),
(2988, 172, '鹽巴', 1, '大匙'),
(2989, 172, '橄欖油', 1, '大匙'),
(2990, 173, '蛋白', 1, '顆'),
(2991, 173, '蛋黃', 1, '顆'),
(2992, 173, '黑糖', 15, 'g'),
(2993, 173, '蜂蜜', 14, 'g'),
(2994, 173, '冰糖', 10, 'g'),
(2995, 173, '鹽', 0, 'g'),
(2996, 173, '肉桂粉', 0, 'g'),
(2997, 173, '本土產中高筋麵粉', 40, 'g'),
(2998, 173, '杏仁果粉', 30, 'g'),
(2999, 173, '南瓜籽', 30, 'g'),
(3000, 173, '草莓', 20, 'g'),
(3001, 173, '可可豆', 16, 'g'),
(3002, 174, '千層麵', 3, '片'),
(3003, 174, '紅醬', 0, '0'),
(3004, 174, '台式肉醬', 1, '罐'),
(3005, 174, '蕃茄麵醬', 3, '湯匙'),
(3006, 174, '洋蔥', 70, 'g'),
(3007, 174, '義大利香料', 1, '茶匙'),
(3008, 174, '黑胡椒', 1, '茶匙'),
(3009, 174, '紅酒', 1, '湯匙'),
(3010, 174, '白醬', 0, '0'),
(3011, 174, '奶油', 10, 'g'),
(3012, 174, '麵粉', 2, '湯匙'),
(3013, 174, '牛奶', 100, 'ml'),
(3014, 174, '黑胡椒', 1, '茶匙'),
(3015, 174, '鹽', 1, '茶匙'),
(3016, 174, '波菜', 200, 'g'),
(3017, 175, '洋蔥', 1, '個'),
(3018, 175, '紅椒', 1, '個'),
(3019, 175, '磨菇', 150, '克'),
(3020, 175, '菠菜', 150, '克'),
(3021, 175, '培根', 100, '克'),
(3022, 175, '雞蛋', 6, '個'),
(3023, 175, '牛奶', 50, '毫升'),
(3024, 175, '起司', 60, '克'),
(3025, 176, '萵苣', 3, '大片(約30g)'),
(3026, 176, '豬肉片', 100, 'g'),
(3027, 176, '番茄丁', 50, 'g'),
(3028, 176, '毛豆', 20, 'g'),
(3029, 176, '海鹽', 5, 'g'),
(3030, 176, '黑胡椒', 5, 'g'),
(3031, 176, '帕馬森起司', 15, 'g'),
(3032, 176, '橄欖油', 12, 'g'),
(3033, 177, '中筋麵粉', 400, '克'),
(3034, 177, '水', 220, '毫升'),
(3035, 177, '鹽', 1, '茶匙'),
(3036, 177, '乾酵母', 1, '茶匙'),
(3037, 177, '橄欖油', 1, '湯匙'),
(3038, 177, '芝士', 100, '克'),
(3039, 177, '蕃茄 ', 2, '個'),
(3040, 178, '小南瓜', 1, '顆'),
(3041, 178, '牛番茄', 1, '顆'),
(3042, 178, '大黃瓜', 1, '條'),
(3043, 178, '義大利香料', 0, '適量'),
(3044, 178, '黑胡椒', 0, '適量'),
(3045, 178, '鹽', 0, '適量'),
(3046, 178, '橄欖油', 0, '適量'),
(3047, 179, '雞蛋', 2, '顆'),
(3048, 179, '香草精', 1, '大匙'),
(3049, 179, '糖', 75, '克'),
(3050, 179, '鹽', 0, '少許'),
(3051, 179, '泡打粉', 1, '大匙'),
(3052, 179, '中筋麵粉', 150, '克'),
(3053, 179, '杏仁粉', 25, '克'),
(3054, 179, '堅果', 100, '克'),
(3055, 179, '巧克力', 20, '克'),
(3056, 179, '可可粉', 1, '大匙'),
(3057, 179, '咖啡粉', 1, '大匙'),
(3058, 179, '奶粉', 1, '大匙'),
(3059, 180, '白飯', 1, '碗'),
(3060, 180, '蝦子', 3, '條'),
(3061, 180, '豬肉', 7, '片'),
(3062, 180, '牛蕃茄', 2, '顆'),
(3063, 180, '洋蔥', 1, '顆'),
(3064, 180, '杏苞菇', 1, '支'),
(3065, 180, '蒜頭', 2, '瓣'),
(3066, 180, '橄欖油', 1, '湯匙'),
(3067, 180, '奶油', 1, '小塊'),
(3068, 180, '牛奶', 0, '酌量'),
(3069, 180, '鹽巴', 0, '酌量'),
(3070, 180, '義式綜合香料', 0, '酌量'),
(3071, 181, '千層麵', 4, '人份'),
(3072, 181, '起司絲', 0, '適量'),
(3073, 181, '豬絞肉', 400, 'g'),
(3074, 181, '蘑菇', 1, '盒'),
(3075, 181, '市售義大利麵紅醬', 1, '罐'),
(3076, 181, '洋蔥', 1, '顆'),
(3077, 181, '蒜末', 6, '顆'),
(3078, 181, '義式香料', 0, '適量'),
(3079, 181, '黑胡椒粒', 0, '適量'),
(3080, 181, '鹽', 0, '適量'),
(3081, 181, '水', 0, '適量'),
(3082, 181, '北海道奶油塊', 1, '小盒'),
(3083, 181, '水', 300, 'cc'),
(3084, 182, '藍莓', 100, ''),
(3085, 182, '優格', 4, ''),
(3086, 182, '鮮奶', 2, ''),
(3087, 182, '藍莓優格果泥 ', 180, ''),
(3088, 182, '液態鮮奶油 ', 150, ''),
(3089, 182, '含糖煉乳', 150, ''),
(3090, 182, 'Oreo巧克力夾心餅乾', 6, ''),
(3091, 183, '豬絞肉', 1, '盒'),
(3092, 183, '白酒', 1, '匙'),
(3093, 183, '義大利香料粉', 1, '匙'),
(3094, 183, '鹽巴', 0, '少許'),
(3095, 183, '黑胡椒', 0, '視個人喜愛'),
(3096, 183, '馬芝瑞拉起司', 12, '小塊'),
(3097, 183, '起司粉', 1, '大匙'),
(3098, 183, '杏仁粉', 1, '大匙'),
(3099, 183, '雞蛋', 1, '個'),
(3100, 184, '紅甜椒', 1, '顆'),
(3101, 184, '黃甜椒', 1, '顆'),
(3102, 184, '洋蔥', 1, '顆'),
(3103, 184, '鴻禧菇/蘑菇', 1, '盒'),
(3104, 184, '去骨雞腿排', 2, '塊'),
(3105, 184, '香菜/迷迭香', 1, '小把'),
(3106, 184, '蒜頭', 3, '大辦'),
(3107, 184, '義式香料', 0, '適量'),
(3108, 184, '粗黑胡椒粉', 0, '適量'),
(3109, 184, '鹽', 0, '少許'),
(3110, 184, '白酒', 10, 'c.c.'),
(3111, 185, '魚', 1, '條'),
(3112, 185, '蛤蜊', 1, 'kg'),
(3113, 185, '蒜頭', 5, '瓣'),
(3114, 185, '洋蔥', 1, '顆'),
(3115, 185, '小番茄', 20, '顆'),
(3116, 185, '九層塔', 0, '適量'),
(3117, 185, '白酒', 300, 'cc'),
(3118, 185, '鹽巴', 0, '適量'),
(3119, 185, '黑胡椒', 0, '適量1條'),
(3120, 185, '紅辣椒', 1, ''),
(3121, 186, '牛肋條', 600, 'g'),
(3122, 186, '牛番茄', 6, '顆'),
(3123, 186, '洋蔥', 1, '顆'),
(3124, 186, '馬鈴薯', 2, '顆'),
(3125, 186, '紅蘿蔔', 1, '根'),
(3126, 186, '水', 1200, 'cc'),
(3127, 186, '小磨坊 百搭香草', 10, 'g'),
(3128, 186, '小磨坊 玫瑰海鹽', 1, '小匙'),
(3129, 187, '高筋麵粉', 500, 'g'),
(3130, 187, '即溶酵母粉', 10, 'g'),
(3131, 187, '鹽', 10, 'g'),
(3132, 187, '油', 40, 'g'),
(3133, 187, '水', 350, 'g'),
(3134, 187, '迷迭香', 0, '少許'),
(3135, 187, '黑橄欖', 10, '10'),
(3136, 187, '蔓越莓', 50, '50'),
(3137, 188, '牛絞肉', 120, 'g'),
(3138, 188, '蒜末', 15, 'g'),
(3139, 188, '洋蔥末', 35, 'g'),
(3140, 188, '牛番茄', 1, '顆'),
(3141, 188, '小番茄', 80, 'g'),
(3142, 188, '番茄糊', 120, 'g'),
(3143, 188, '高湯', 50, 'g'),
(3144, 188, '鮮奶油', 50, 'g'),
(3145, 188, '紅酒', 30, 'g'),
(3146, 188, '百里香', 15, 'g'),
(3147, 188, '迷迭香', 20, 'g'),
(3148, 188, '月桂葉', 3, '片'),
(3149, 188, '海鹽', 3, 'g'),
(3150, 188, '荳蔻粉', 3, 'g'),
(3151, 188, '黑胡椒', 3, 'g'),
(3152, 188, '羅勒葉', 30, 'g'),
(3153, 189, '麻油', 0, '適量'),
(3154, 189, '洋蔥', 1, '顆'),
(3155, 189, '蛤蠣', 1, '斤'),
(3156, 189, '蒜頭', 3, '瓣'),
(3157, 189, '嫩豆腐', 1, '盒'),
(3158, 189, '韓式辣椒醬', 1, '大匙'),
(3159, 189, '高湯', 1, 'L'),
(3160, 189, '雞蛋', 1, '顆'),
(3161, 189, '青蔥', 0, '適量'),
(3162, 190, '韓國泡麵', 1, '包'),
(3163, 190, '雞肉絲(可有可無)', 0, '適量'),
(3164, 190, '綠辣椒(不辣)', 1, '根'),
(3165, 190, '蔥', 1, '根'),
(3166, 190, '小黃瓜', 1, '條'),
(3167, 190, '冰塊', 0, '適量'),
(3168, 190, '水', 190, 'ml'),
(3169, 190, '醋', 3, '湯匙'),
(3170, 190, '醬油', 2, '湯匙'),
(3171, 190, '泡麵調味粉', 1, '包'),
(3172, 191, '豬里肌肉', 400, 'g'),
(3173, 191, '紅椒', 0, '顆'),
(3174, 191, '洋蔥', 1, '顆'),
(3175, 191, '蘆筍', 4, '支'),
(3176, 191, '鹽巴', 1, '茶匙'),
(3177, 191, '胡椒粉', 1, '茶匙'),
(3178, 191, '蛋白', 1, '顆'),
(3179, 191, '太白粉', 150, 'g'),
(3180, 191, '水', 150, 'g'),
(3181, 191, '沙拉油', 30, 'g'),
(3182, 191, '水', 300, 'g'),
(3183, 191, '二砂糖', 50, 'g'),
(3184, 191, '白砂糖', 50, 'g'),
(3185, 191, '醬油', 20, 'g'),
(3186, 191, '檸檬', 1, '顆'),
(3187, 191, '太白粉水', 0, '適量'),
(3188, 192, '蘿蔔', 1, '根'),
(3189, 192, '白醋', 4, '湯匙'),
(3190, 192, '糖', 2, '湯匙'),
(3191, 192, '開水', 0, 'ml'),
(3192, 193, '牛肉', 1, 'kg以上'),
(3193, 193, '薑', 4, '片'),
(3194, 193, '米酒', 1, '碗'),
(3195, 193, '牛肋條', 2, '條'),
(3196, 193, '蔥花', 0, '隨意'),
(3197, 193, '鹽', 2, '匙'),
(3198, 194, '紅綠辣椒', 0, '適量'),
(3199, 194, '蒜碎', 4, '瓣蒜頭'),
(3200, 194, '蔥白', 0, '適量'),
(3201, 194, '韓國辣醬', 2, '兩大匙'),
(3202, 194, '粗細辣椒', 2, '大匙'),
(3203, 194, '嫩豆腐', 1, '盒'),
(3204, 194, '蛤蠣', 1, '0.5斤'),
(3205, 194, '鮮蚵', 1, '斤'),
(3206, 194, '蛋', 1, '顆'),
(3207, 194, '蔥綠', 0, '適量'),
(3208, 194, '香油', 0, '適量'),
(3209, 194, '芝麻', 0, '適量'),
(3210, 195, '泡菜湯汁', 0, '適量'),
(3211, 195, '洋蔥切絲', 1, '顆'),
(3212, 195, '蔥段', 0, '適量'),
(3213, 195, '蒜泥', 0, '適量'),
(3214, 195, '五花肉片', 0, '隨意'),
(3215, 195, '香油芝麻粒', 0, '適量'),
(3216, 196, '粉紅魚腸', 1, '條'),
(3217, 196, '麻油', 1, 'T'),
(3218, 196, '醬油', 1, 'T'),
(3219, 196, '橄欖油', 1, 'T'),
(3220, 196, '蔥末', 0, '少許'),
(3221, 196, '芝麻', 0, '少許'),
(3222, 196, '辣椒', 2, '條'),
(3223, 196, '粉紅魚腸', 1, '條'),
(3224, 196, '鹽', 0, '少許'),
(3225, 196, '雞蛋', 2, '顆'),
(3226, 197, '橄欖油', 0, '適量'),
(3227, 197, '蔥花', 0, '適量'),
(3228, 197, '蒜末', 0, '適量'),
(3229, 197, '洋蔥', 0, '適量'),
(3230, 197, '新豬肉230g', 1, '包'),
(3231, 197, '醬油', 0, '適量'),
(3232, 197, '砂糖', 0, '適量'),
(3233, 197, '韓國辣椒粉', 0, '適量'),
(3234, 197, '嫩豆腐', 1, '盒'),
(3235, 197, '雞蛋', 1, '顆'),
(3236, 197, '水', 250, 'cc'),
(3237, 197, '金針菇', 0, '適量'),
(3238, 197, '櫛瓜', 0, '適量'),
(3239, 197, '雪白菇', 0, '適量'),
(3240, 198, '黃豆芽', 300, 'g'),
(3241, 198, '蒜未', 2, '瓣'),
(3242, 198, '鹽', 1, '茶匙'),
(3243, 198, '醬油', 1, '湯匙'),
(3244, 198, '糖', 1, '茶匙'),
(3245, 198, '紅蘿蔔(切絲)', 50, 'g'),
(3246, 198, '韓國麻油', 1, '湯匙'),
(3247, 198, '白芝麻(已炒香)', 0, '適量'),
(3248, 198, '蔥花', 10, 'g'),
(3249, 199, '乾燥海帶芽', 30, '克'),
(3250, 199, '洋蔥', 1, '顆'),
(3251, 199, '白芝麻', 1, '大匙'),
(3252, 199, '黑麻油', 1, '大匙'),
(3253, 199, '柚子醬', 2, '大匙'),
(3254, 199, '白醋', 1, '大匙'),
(3255, 199, '海鹽', 1, '鹽匙'),
(3256, 200, '蛋餅皮', 1, '張'),
(3257, 200, '乳酪絲', 0, '適量'),
(3258, 200, '雞蛋', 2, '顆'),
(3259, 200, '廣達香肉醬', 1, '罐'),
(3260, 201, '米', 2, '人份'),
(3261, 201, '白芝麻(已炒香)', 0, '適量'),
(3262, 201, '芝麻油', 3, '茶匙'),
(3263, 201, '鹽', 1, '茶匙'),
(3264, 201, '雞蛋', 1, '個'),
(3265, 201, '紅蘿蔔(切絲)', 1, '根'),
(3266, 201, '小黃瓜(切絲)', 0, '概'),
(3267, 201, '火腿(切條)', 2, '片'),
(3268, 201, '海苔', 4, '片'),
(3269, 201, '竹簾', 1, '張'),
(3270, 202, '雞蛋', 2, '隻'),
(3271, 202, '黑椒', 0, '適量'),
(3272, 202, '鹽', 0, '適量'),
(3273, 202, '糖', 0, '適量'),
(3274, 202, '壽司醋', 1, '湯匙'),
(3275, 202, '麻油', 0, '適量'),
(3276, 202, '米', 1, '杯'),
(3277, 202, '豚肉', 4, '片（剪片）'),
(3278, 202, '泡菜', 6, '片（剪碎）'),
(3279, 202, '韓式辣醬', 1, '湯匙'),
(3280, 202, '水', 0, '適量'),
(3281, 202, '蟹柳', 1, '條'),
(3282, 202, '芝士', 2, '片'),
(3283, 203, '韓式年糕', 1, '包'),
(3284, 203, '韓式魚板', 3, '片'),
(3285, 203, '高麗菜', 3, '片'),
(3286, 203, '洋蔥', 0, '顆'),
(3287, 203, '蒜頭', 3, '顆'),
(3288, 203, '鵪鶉蛋', 6, '顆'),
(3289, 203, '泡菜', 0, '適量'),
(3290, 203, '高湯', 1, '碗'),
(3291, 203, '韓式辣醬', 2, '匙'),
(3292, 203, '醬油', 1, '匙'),
(3293, 203, '蜂蜜', 1, '匙'),
(3294, 203, '砂糖', 1, '匙'),
(3295, 203, '韓式辣粉', 0, '少許'),
(3296, 204, '豬肉片', 120, 'g'),
(3297, 204, '韓式辣椒醬', 30, 'g'),
(3298, 204, '韓式辣椒粉', 10, 'g'),
(3299, 204, '蒜仁', 10, 'g'),
(3300, 204, '洋蔥', 1, '顆'),
(3301, 204, '米酒', 20, 'g'),
(3302, 204, '蠔油', 10, 'g'),
(3303, 204, '白砂糖', 10, 'g'),
(3304, 204, '芝麻油', 15, 'g'),
(3305, 204, '蔥', 2, '根'),
(3306, 204, '黑胡椒', 0, '少許'),
(3307, 204, '白芝麻', 0, '少許'),
(3308, 204, '花生', 0, '少許'),
(3309, 205, '牛肉', 230, 'g'),
(3310, 205, '無?奶油', 0, '適量'),
(3311, 205, '橄欖油', 1, '個'),
(3312, 205, '洋蔥', 2, '瓣'),
(3313, 205, '蒜頭', 150, 'g'),
(3314, 205, '胡蘿蔔', 2, '個'),
(3315, 205, '蕃茄', 160, 'g'),
(3316, 205, '洋菇', 1, '支'),
(3317, 205, '迷迭香', 2, '片'),
(3318, 205, '月桂葉', 1, '罐'),
(3319, 205, '罐頭蕃茄', 0, '少許'),
(3320, 205, '蕃茄醬', 2, '小匙'),
(3321, 205, '糖', 300, 'ml'),
(3322, 205, '高湯', 0, '適量'),
(3323, 205, '義大利綜合香料', 0, '少許'),
(3324, 205, '黑胡椒', 0, '適量'),
(3325, 205, '?', 0, '數片'),
(3326, 205, '帕瑪森乾酪', 0, ''),
(3327, 205, '法國麵包', 0, ''),
(3328, 206, '紅甜椒', 1, '顆'),
(3329, 206, '小番茄', 5, '顆'),
(3330, 206, '羅勒或九層塔', 5, '片'),
(3331, 206, '洋蔥', 0, '顆'),
(3332, 206, '大蒜', 2, '瓣'),
(3333, 206, '冰的高湯+水', 400, 'ml'),
(3334, 206, '橄欖油', 1, '小匙'),
(3335, 206, '鹽和黑胡椒', 0, '少許'),
(3336, 206, '帕瑪森起司粉', 0, '少許'),
(3337, 207, '小番茄', 250, 'g'),
(3338, 207, '大蒜', 2, '瓣'),
(3339, 207, '蜂蜜', 1, '大匙'),
(3340, 207, '橄欖油', 2, '大匙'),
(3341, 207, '百里香或義式香料', 0, '少許'),
(3342, 207, '鹽巴和黑胡椒', 0, '適量'),
(3343, 208, '牛肋條', 0, 'g'),
(3344, 208, '牛蕃茄', 3, '小顆'),
(3345, 208, '洋蔥', 1, '顆'),
(3346, 208, '蘑菇', 10, '朵'),
(3347, 208, '紅蘿蔔', 1, '根'),
(3348, 208, '馬鈴薯', 2, '小顆'),
(3349, 208, '義大利香料', 2, '大匙'),
(3350, 208, '海鹽', 2, '小匙'),
(3351, 208, '蕃茄丁罐頭', 1, '罐'),
(3352, 208, '醬油', 3, '大匙'),
(3353, 208, '冰糖或二砂', 3, '大匙'),
(3354, 208, '熱水', 2, '米杯'),
(3355, 209, '牛筋肉', 500, '克'),
(3356, 209, '牛番茄', 3, '顆'),
(3357, 209, '罐頭蕃茄糊', 1, '罐'),
(3358, 209, '洋蔥', 1, '顆'),
(3359, 209, '蘑菇', 15, '朵'),
(3360, 209, '紅蘿蔔', 1, '條'),
(3361, 209, '芹菜', 3, '支'),
(3362, 209, '黑胡椒', 0, '適量'),
(3363, 209, '鹽巴', 0, '適量'),
(3364, 209, '義大利香料', 0, '適量'),
(3365, 209, '水', 1000, 'cc'),
(3366, 209, '愛心', 0, '滿滿的'),
(3367, 210, '豬絞肉', 300, 'g'),
(3368, 210, '洋蔥', 1, '顆'),
(3369, 210, '蒜頭', 3, '瓣'),
(3370, 210, '羅勒葉', 1, '匙'),
(3371, 210, '黑胡椒', 1, '匙'),
(3372, 210, '意大利香料', 0, '適量'),
(3373, 210, '鹽', 1, '匙'),
(3374, 210, '太白粉', 20, 'g'),
(3375, 210, '牛番茄', 2, '顆'),
(3376, 210, '月桂葉', 2, '片'),
(3377, 210, '黑胡椒', 1, '小匙'),
(3378, 210, '鹽', 1, '匙'),
(3379, 210, '羅勒葉', 2, '匙'),
(3380, 210, '橄欖油', 0, '適量'),
(3381, 210, '奶油', 0, '適量'),
(3382, 210, '蒜末', 10, 'g'),
(3383, 210, '去皮番茄', 3, '顆'),
(3384, 210, '鹽', 0, '適量'),
(3385, 210, '黑胡椒', 0, '適量'),
(3386, 210, '牛絞肉', 300, 'g'),
(3387, 210, '豬絞肉', 150, 'g'),
(3388, 210, '雞蛋', 1, '顆'),
(3389, 210, '洋蔥丁', 0, '顆'),
(3390, 210, '帕瑪森起司粉', 20, 'g'),
(3391, 210, '麵包粉', 20, 'g'),
(3392, 210, '紅椒粉', 2, '茶匙'),
(3393, 210, '黑胡椒', 0, '適量'),
(3394, 210, '鹽', 0, '適量'),
(3395, 210, '牛奶', 10, '毫升');

-- --------------------------------------------------------

--
-- 資料表結構 `chef_recipe_price`
--

CREATE TABLE `chef_recipe_price` (
  `crp_ID` int(10) NOT NULL,
  `crp_name` varchar(50) CHARACTER SET utf8 NOT NULL,
  `crp_price` varchar(50) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `chef_recipe_price`
--

INSERT INTO `chef_recipe_price` (`crp_ID`, `crp_name`, `crp_price`) VALUES
(1, 'price_option01', '100 ~ 300 / 人'),
(2, 'price_option02', '300 ~ 500 / 人'),
(3, 'price_option03', '500 ~ 1000 / 人'),
(4, 'price_option04', '1000 ~ 2000 / 人'),
(5, 'price_option05', '2000 以上 / 人');

-- --------------------------------------------------------

--
-- 資料表結構 `chef_recipe_score`
--

CREATE TABLE `chef_recipe_score` (
  `id` int(11) NOT NULL,
  `recipe_id` int(6) NOT NULL,
  `user_id` int(6) NOT NULL,
  `score` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `chef_recipe_score`
--

INSERT INTO `chef_recipe_score` (`id`, `recipe_id`, `user_id`, `score`) VALUES
(1, 168, 3, 2),
(5, 169, 3, 3),
(6, 148, 3, 4),
(7, 149, 3, 3),
(8, 153, 3, 5),
(9, 178, 3, 4),
(10, 182, 3, 4),
(11, 183, 3, 3),
(12, 138, 3, 2),
(13, 141, 3, 4),
(14, 145, 3, 4),
(15, 147, 3, 5),
(16, 139, 3, 4),
(17, 140, 3, 2);

-- --------------------------------------------------------

--
-- 資料表結構 `chef_score`
--

CREATE TABLE `chef_score` (
  `score_ID` int(11) NOT NULL COMMENT 'ID',
  `score` int(1) NOT NULL COMMENT '分數',
  `user_ID` int(50) NOT NULL COMMENT '進行評分的使用者',
  `chef_ID` int(50) NOT NULL COMMENT '被評分的廚師'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `chef_score`
--

INSERT INTO `chef_score` (`score_ID`, `score`, `user_ID`, `chef_ID`) VALUES
(2, 4, 3, 27),
(3, 5, 3, 34),
(4, 2, 3, 35),
(5, 1, 3, 33),
(6, 3, 4, 35),
(7, 2, 3, 30),
(8, 5, 4, 30),
(9, 4, 3, 38),
(10, 4, 3, 46),
(11, 3, 3, 39);

-- --------------------------------------------------------

--
-- 資料表結構 `chef_skill`
--

CREATE TABLE `chef_skill` (
  `skill_id` int(11) NOT NULL,
  `chef_ID` int(5) NOT NULL,
  `chef_type` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `chef_skill`
--

INSERT INTO `chef_skill` (`skill_id`, `chef_ID`, `chef_type`) VALUES
(44, 30, 2),
(45, 30, 3),
(46, 30, 7),
(130, 36, 1),
(131, 37, 1),
(132, 38, 1),
(133, 39, 1),
(134, 40, 1),
(137, 43, 1),
(138, 44, 1),
(139, 45, 1),
(140, 46, 1),
(141, 47, 4),
(142, 48, 4),
(143, 49, 4),
(144, 50, 4),
(145, 51, 4),
(146, 52, 4),
(147, 53, 4),
(148, 54, 4),
(149, 55, 4),
(150, 56, 4),
(151, 57, 5),
(152, 58, 5),
(153, 59, 5),
(154, 60, 5),
(155, 61, 5),
(156, 62, 5),
(157, 63, 5),
(158, 64, 5),
(159, 65, 5),
(160, 66, 5),
(161, 41, 1);

-- --------------------------------------------------------

--
-- 資料表結構 `family_account`
--

CREATE TABLE `family_account` (
  `ID` int(11) NOT NULL,
  `Username` varchar(50) NOT NULL,
  `password` varchar(20) DEFAULT NULL,
  `class` int(1) NOT NULL DEFAULT 0 COMMENT '狀態',
  `address` varchar(100) NOT NULL,
  `phone` varchar(9) NOT NULL,
  `signup_date` date NOT NULL,
  `amount` int(6) NOT NULL DEFAULT 0 COMMENT '持有金額'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `family_account`
--

INSERT INTO `family_account` (`ID`, `Username`, `password`, `class`, `address`, `phone`, `signup_date`, `amount`) VALUES
(1, '789', '123', 0, '', '', '0000-00-00', 0),
(2, '123', '40711108', 1, '', '', '0000-00-00', 0),
(3, 'root', 'root', 1, '', '', '0000-00-00', 0),
(4, 'van', 'van', 1, '', '', '0000-00-00', 0),
(13, '1234', '1234', 0, '', '', '0000-00-00', 0),
(15, '1235', '1234', 1, '', '', '0000-00-00', 0),
(16, 'rooj', '1245j', 0, '', '', '0000-00-00', 0),
(17, 'roor', '1245j', 0, '', '', '0000-00-00', 0),
(18, 'jooj', 'cctv', 0, '', '', '0000-00-00', 0),
(19, '12345', '1234', 0, '', '', '0000-00-00', 0),
(20, '125j', 'jjjj', 1, '', '', '0000-00-00', 0),
(21, 'susu', '12345', 1, '', '', '0000-00-00', 0),
(22, 'Dungeon', '12345', 1, '', '', '0000-00-00', 0),
(23, 'vane', 'vane', 0, '', '', '0000-00-00', 0),
(24, 'user', 'user1', 1, '', '', '0000-00-00', 0),
(26, 'test01', 'test01', 0, '', '', '0000-00-00', 0),
(27, 'billy', 'huhh', 1, '', '', '0000-00-00', 0),
(28, '456678', '4567', 0, '', '', '0000-00-00', 0),
(30, '10234', '1234', 0, '111111111', '123456789', '0000-00-00', 0),
(31, '12347', '1234', 0, '11111111', '123456789', '0000-00-00', 0),
(32, '123457', '123456', 0, '1111111', '123456789', '2020-12-25', 0),
(33, '123456', '123456', 0, '1111111', '123456789', '0000-00-00', 0),
(34, '1234567', '1234', 0, '1234', '123456789', '2021-01-11', 0),
(35, 'wayne75525', '1234', 0, '桃園市中壢區龍川二街134號', '926890776', '2021-01-11', 0),
(36, 'godtoneasia', '7414', 0, '桃園市中壢區龍川二街134號', '926890776', '2021-01-11', 0),
(37, 'yeee', '123456', 0, '桃園市中壢區龍川二街134號', '926890776', '2021-01-11', 0),
(38, 'test114514', 'test114514', 0, '中山大學', '123456789', '2021-10-08', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `keep`
--

CREATE TABLE `keep` (
  `id` int(11) NOT NULL COMMENT '0流水號',
  `user` int(50) NOT NULL COMMENT '1使用者',
  `recipe` int(50) NOT NULL COMMENT '2他儲存的食譜',
  `block` int(50) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `keep`
--

INSERT INTO `keep` (`id`, `user`, `recipe`, `block`) VALUES
(61, 3, 227, 0),
(62, 3, 284, 0),
(63, 3, 117, 0);

-- --------------------------------------------------------

--
-- 資料表結構 `material`
--

CREATE TABLE `material` (
  `ID` int(64) NOT NULL COMMENT '流水號',
  `account` varchar(64) NOT NULL COMMENT '不是子帳戶',
  `foodname` varchar(64) NOT NULL,
  `quantity` int(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `material`
--

INSERT INTO `material` (`ID`, `account`, `foodname`, `quantity`) VALUES
(3, '123', '達瑞斯', 0),
(4, '123', '冰鳥', 5),
(34, '123', '韓家軍', 20),
(36, '123', '絞肉', 10),
(37, '123', '草莓', 10),
(38, '123', '何首烏', 1),
(39, '123', '番茄', 1),
(40, '123', '鱈魚肝', 1),
(41, '123', '香蔥', 10),
(42, 'qwe', '甜玉米', 1),
(43, 'qwe', '甜椒', 10),
(44, 'qwe', '蕃茄', 1),
(45, 'qwe', '海帶芽', 1),
(46, 'qwe', '米酒', 10),
(47, 'qwe', '鹽巴', 10),
(48, 'qwe', '枸杞', 1),
(49, 'qwe', '紅棗', 10),
(50, '789', '番茄', 1),
(51, '789', '甜椒', 1),
(66, 'susu', '草莓', 1),
(67, 'susu', '何首烏', 1),
(68, 'susu', '薑', 1),
(88, 'user', '番茄', 1),
(91, 'test', '番茄', 1),
(92, 'test01', '番茄', 1),
(93, 'test01', '葡萄', 10),
(110, 'van', '甜玉米', 1),
(111, 'van', '甜椒', 1),
(113, 'van', '海帶芽', 1),
(114, 'van', '鱈魚肝', 1),
(115, 'van', '沙拉醬', 1),
(116, 'van', '洋蔥', 1),
(119, '1235', '紫甘藍', 1),
(120, '1235', '番茄', 1),
(121, '1235', '洋蔥', 1),
(122, '1235', '草莓', 1),
(124, 'van', '草莓', 1),
(126, 'billy', '葡萄', 1),
(127, '456678', '葡萄', 1),
(179, 'van', '番茄', 2),
(180, 'van', '牛肉', 1),
(183, 'root', '番茄醬', 1),
(188, 'root', '甜椒', 1),
(192, 'root', '番茄', 3),
(193, 'root', '草莓', 2),
(194, 'root', '蕃茄', 2),
(195, 'root', '蕃茄醬', 1),
(196, 'root', '小番茄', 3),
(197, 'root', '小蕃茄', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `oldallrec`
--

CREATE TABLE `oldallrec` (
  `ID` int(32) NOT NULL,
  `recipe` varchar(32) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `ing` varchar(32) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `stock` varchar(32) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `img` varchar(32) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `link` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `oldallrec`
--

INSERT INTO `oldallrec` (`ID`, `recipe`, `ing`, `stock`, `img`, `link`) VALUES
(1, '豬肉蔬食', '菠菜、洋蔥、豬肉、瘦肉、西紅柿', '1,1,1,1,2', '1.png', ''),
(2, '五行蔬沙茶乾拌刀削麵', '菠菜、蛋黃、綠色蔬菜', '1,1,3', '2.png', ''),
(3, '炒菠菜', '菠菜', '3', '3.png', ''),
(4, '雞腿排&梅酒醬', '菠菜、雞肉', '1,1,2', '4.png', ''),
(5, '佛跳牆 簡易版', '菠菜、雞肉', '1,1', '5.png', ''),
(6, '黑糖糕(電子鍋)', '菠菜、蜂蜜', '1,1', '6.png', ''),
(7, '超簡單～貢丸味噌湯', '菠菜、豬肉', '1,1', '7.png', ''),
(8, '薑母鴨肉湯', '菠菜、鴨肉', '1,1', '8.png', ''),
(9, '滷牛腱(大同電鍋)', '菠菜、牛肉', '1,1', '9.png', ''),
(10, '電鍋蒸蛋', '菠菜', '1', '10.png', ''),
(11, '清蒸黃魚(電鍋篇)', '菠菜、菜籽油', '1,1', '11.png', ''),
(12, 'Ratatouille 烤法式蔬', '菠菜', '2', '12.png', ''),
(13, '超簡單波菜捲', '菠菜', '1', '13.png', ''),
(14, '玉米菇菇蒸肉（電鍋版）', '玉米、豬肉', '1,1', '14.png', ''),
(15, '安東燉雞', '菠菜、雞肉', '1,1', '15.png', ''),
(16, '微波煎蛋', '蛋菜、籽油', '1,1', '16.png', ''),
(17, '簡易料理?薑絲蛤蜊', '蛤蜊、薑', '1,1', '17.png', ''),
(18, '自製煙燻臘肉【乾燥機快速版】', '蛋黃、豬肉', '1,1', '18.png', ''),
(19, '土耳其羊肉燉飯（電鍋）', '洋蔥、羊肉', '1,1', '19.png', ''),
(20, '南瓜豆漿蒸蛋', '洋蔥、南瓜', '1,1', '20.png', ''),
(21, '清蒸絲瓜蛤蜊', '蛤蜊', '1', '21.png', ''),
(22, '梅干肉醬蒸菠菜', '菠菜、豬肉', '1,1', '22.png', ''),
(23, '肉末蒸青瓜', '豬肉', '1', '23.png', ''),
(24, '清燉牛肉', '牛肉、菜籽油', '1,1', '24.png', ''),
(25, '珍珠丸子', '豬肉', '1', '25.png', ''),
(26, '揚出豆腐', '黃豆', '1', '26.png', ''),
(27, '蘿蔔乾', '蘿蔔', '1', '27.png', ''),
(28, '菜脯雞湯', '蘿蔔、雞肉', '1,1', '28.png', ''),
(29, '白蘿蔔水餃餡', '蘿蔔', '1', '29.png', ''),
(30, '蘿蔔排骨湯', '蘿蔔、雞肉', '1,1', '30.png', ''),
(31, '蘿蔔葉雪裡紅', '蘿蔔', '1', '31.png', ''),
(32, '白切雞', '雞肉', '1', '32.png', ''),
(33, '古早味菜脯蛋', '蘿蔔、蛋', '1,1', '33.png', ''),
(34, '鹹蛋苦瓜', '蛋、苦瓜', '1,1', '34.png', ''),
(35, '魚香茄子', '茄子、魚', '1,2', '35.png', ''),
(36, '開陽白菜', '白菜', '1', '36.png', ''),
(37, '芹菜炒透抽', '芹菜、透抽', '1,1', '37.png', ''),
(38, '鳳梨蝦球', '鳳梨、蝦', '1,1', '38.png', ''),
(39, '螞蟻上樹', '黃豆、菠菜', '1,1', '39.png', ''),
(40, '番茄牛肉煲', '番茄、牛肉', '1,1', '40.png', ''),
(41, '滑蛋牛肉', '蛋牛、肉', '1,1', '41.png', ''),
(42, '炒花椰菜', '花椰菜、菜籽油', '1,1', '42.png', ''),
(43, '炒蔬菜', '蔬菜、菜籽油', '1,1', '43.png', ''),
(44, '麻油養生菇鍋', '菠菜、黃豆', '1,1', '44.png', ''),
(45, '髮菜素魚翅羹', '黃豆、鮭魚', '1,1', '45.png', ''),
(46, '素燴什錦', '青江菜、雞蛋', '1,1', '46.png', ''),
(47, '排骨四寶湯', '青江菜、豬肉', '1,1', '47.png', ''),
(48, '素佛跳牆', '番茄、菜籽油、綠色蔬菜、蘑菇', '1,1,2,1', '48.png', ''),
(49, '好彩頭杏鮑封肉', '菇類、牛肉', '1,1', '49.png', ''),
(50, '銀耳番茄排骨湯', '豬肉、番茄', '1,1', '50.png', ''),
(51, '芥菜地瓜鍋', '芥菜、地瓜', '1,1', '51.png', ''),
(52, '菜心鍋', '菠菜', '1', '52.png', ''),
(53, '豆腐鍋', '黃豆', '1', '53.png', ''),
(54, '玉米馬鈴薯', '玉米、馬鈴薯', '1,1', '54.png', ''),
(55, '豆皮大白菜', '白菜、豆皮', '1,1', '55.png', ''),
(56, '香菇鑲蝦丸', '蘿蔔、蝦', '1,1', '56.png', ''),
(57, '蔬菜烤雞義大利麵濃湯', '綠色蔬菜', '1', '57.png', ''),
(58, '經典紅燒肉', '豬肉', '1', '58.png', ''),
(59, '茄子培根濃湯', '培根、茄子', '1,1', '59.png', ''),
(60, '番茄燒茄子', '番茄、茄子', '1,1', '60.png', ''),
(61, '鹹豆漿餃子', '黃豆', '3', '61.png', ''),
(62, '花椰水波蛋烘餅', '蛋、花椰菜', '1,1', '62.png', ''),
(63, '蘋果雞片', '蘋果、雞肉', '1,1', '63.png', ''),
(64, '韭香雞', '韭菜、雞肉', '1,1', '64.png', ''),
(65, '鮮菇有機蔬菜鍋', '燕麥、番茄、西葫蘆、白蘿蔔、冬瓜', '1,2,2,2,2,2', '65.png', ''),
(66, '蓮藕排骨粥', '燕麥、瘦肉', '1,2', '66.png', ''),
(67, '荷蘭鬆餅', '燕麥、生薑', '1,1', '67.png', ''),
(68, '早餐烤蛋', '蛋', '1', '68.png', ''),
(69, '瓜仔素肉燒豆腐', '番薯葉', '2', '69.png', ''),
(70, '沙茶魚頭湯鍋', '番薯葉、鮭魚、洋蔥、茄子、鯖魚、白菜、青江菜、菇類', '1,1,1,1,1,2,1,1', '70.png', ''),
(71, '綜合蕈菇粥', '番薯葉、菠菜、香菇、蘑菇、洋蔥、海帶、白菜、青江菜、菇類、雞蛋', '1,1,2,2,1,1,1,1,1,1', '71.png', '');

-- --------------------------------------------------------

--
-- 資料表結構 `personal_account`
--

CREATE TABLE `personal_account` (
  `ID` int(11) NOT NULL,
  `Owner` int(50) NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Username` varchar(50) NOT NULL,
  `heartattack` int(11) NOT NULL COMMENT '心臟疾病04',
  `pneumonia` int(11) NOT NULL COMMENT '肺炎05',
  `diabetes` int(11) NOT NULL COMMENT '糖尿病07',
  `Lower_respiratory_tract` int(11) NOT NULL COMMENT '慢性下呼吸道疾病08',
  `hypertension` int(11) NOT NULL COMMENT '高血壓性疾病09',
  `Nephritis` int(11) NOT NULL COMMENT '腎病10',
  `Liver` int(11) NOT NULL COMMENT '變慢性肝病11'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `personal_account`
--

INSERT INTO `personal_account` (`ID`, `Owner`, `Name`, `Username`, `heartattack`, `pneumonia`, `diabetes`, `Lower_respiratory_tract`, `hypertension`, `Nephritis`, `Liver`) VALUES
(1, 1, '老爸', '132', 0, 1, 0, 0, 0, 0, 0),
(14, 2, '老朽', 'spin', 0, 0, 0, 1, 0, 1, 0),
(35, 2, '捷和慢性病照護與食譜推薦之智慧冰箱', 'AAAAAAAAA', 0, 1, 0, 0, 0, 0, 1),
(61, 20, 'jjj', 'jjj', 0, 1, 0, 0, 0, 0, 0),
(62, 21, 'su', '123', 0, 0, 1, 0, 0, 0, 0),
(63, 21, 'su', 'ssuu', 0, 0, 1, 0, 0, 0, 0),
(64, 22, '地牢', '1235', 0, 1, 1, 0, 0, 0, 0),
(76, 24, '王爸爸', 'wangpapa', 0, 0, 0, 1, 0, 0, 0),
(79, 26, 'aaa', '2123', 0, 0, 1, 0, 0, 0, 0),
(80, 27, 'van', '123456', 0, 0, 1, 0, 0, 0, 0),
(88, 3, '爸爸', 'father', 1, 0, 0, 1, 0, 0, 0),
(89, 38, 'father', 'van123', 1, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- 資料表結構 `rec_step`
--

CREATE TABLE `rec_step` (
  `ID` int(64) NOT NULL COMMENT '流水號',
  `step` int(64) NOT NULL COMMENT '第幾步驟',
  `content` varchar(500) CHARACTER SET utf8 NOT NULL COMMENT '步驟內容',
  `rec_ID` int(64) NOT NULL COMMENT '食譜編號'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `rec_step`
--

INSERT INTO `rec_step` (`ID`, `step`, `content`, `rec_ID`) VALUES
(1, 1, '準備好所有原料！然後切塊！', 1),
(2, 2, '接著拿出味噌溜！登愣登愣！', 1),
(3, 3, '冰鎮蔬菜後，放進碗內！', 1),
(4, 4, '將味噌溜、檸檬汁、糖調和，可按照自己的口味調和！', 1),
(5, 5, '淋到沙拉上就完成囉！', 1),
(6, 1, '番茄洗乾淨切十字', 2),
(7, 2, '下鍋川燙至皮有點掀起後冰鎮', 2),
(8, 3, '將皮去除', 2),
(9, 4, '將蜂蜜、冰糖、柑橘梅、水煮滾冷卻', 2),
(10, 5, '將番茄置於保鮮盒中倒入湯汁置於冰箱一天即可食用', 2),
(11, 1, '將高麗菜、木耳、紅蘿蔔、蝦皮、蒜頭洗乾淨瀝乾； 高麗菜切小塊、紅蘿蔔去皮切絲、木耳切絲、蒜頭切末', 3),
(12, 2, '鍋子加入油，油熱後放入蒜末、蝦皮爆香，在放入紅蘿蔔絲和木耳絲拌炒、接著在放入高麗菜拌炒一下、蓋鍋悶兩分半鐘在加入鹽攪拌均勻後即可起鍋', 3),
(13, 1, '將所有材料倒入果汁機當中打勻', 4),
(14, 1, '料理easy三部曲..........集合器具 → 準備工作 → 開始烹調', 5),
(15, 2, '集合器具..........', 5),
(16, 3, '脫水器、食品消毒用酒精噴霧、砧板、廚刀、電子秤、量匙、果汁機 ＆ 盤具。', 5),
(17, 4, '準備工作..........', 5),
(18, 5, '1.清洗食材＆脫水。', 5),
(19, 6, '2.酒精消毒：砧板、廚刀。', 5),
(20, 7, '『番茄西瓜澄清湯』：', 5),
(21, 8, '1.將 小蕃茄(250g)、西瓜(100g)、小黃瓜(50g)、甜椒(20g) 略切後放入果汁機打成泥狀。', 5),
(22, 9, '2.倒入到豆漿布袋中過濾滴漏出湯汁。', 5),
(23, 10, '3.盛盤後加入 西瓜球(數顆)、 蘋果醋(2ml)、義大利辣椒橄欖油(1ml)、及 薄荷葉(1片) 即完成。', 5),
(24, 1, '小黃瓜清洗乾淨，切掉頭跟尾。', 6),
(25, 2, '一根根切成一片片，放入鍋中。', 6),
(26, 3, '灑入鹽巴，用手攪拌，放置15分鐘等它出一點水。', 6),
(27, 4, '蒜頭撥開切碎，小黃瓜出水後用水沖一下瀝乾放入蒜頭。', 6),
(28, 5, '最後加入香油，兩滴麻油，蘋果蜂蜜醋少量攪拌均勻，放置15分鐘完成。', 6),
(29, 1, '1. 將所有食材洗淨。', 7),
(30, 2, '2. 筊白筍與玉米筍燙熟。', 7),
(31, 3, '3. 將彩椒與筊白筍切絲，芹菜去葉子切段、玉米筍斜切段。', 7),
(32, 4, '將所有食材與調味料拌勻，最後加上少許白芝麻增添香氣，放入冰箱冰鎮風味更佳!', 7),
(33, 1, '將葉子剝下、莖葉分離', 8),
(34, 2, '木耳、彩椒切成適口尺寸', 8),
(35, 3, '薑爆香，並放入莖段一起拌炒', 8),
(36, 4, '加入木耳、彩椒拌炒', 8),
(37, 5, '加入葉子', 8),
(38, 6, '加入葉子拌炒約2分鐘後，加入蝦仁（蝦仁先泡過米酒）', 8),
(39, 7, '加入枸杞，少量白醋', 8),
(40, 1, '備料 1木耳泡水洗淨,剪去蒂頭,川燙後撈出瀝乾水分。</br> 2枸杞泡冷水一會即撈出。 </br>3小黃瓜用鹽醃約30分鐘使它出水,倒掉鹽漬水再用冷開水漂洗瀝乾水分。</br> 4嫩薑絲泡水或不泡都可以的！', 9),
(41, 2, '將所有調味料倒在調理碗中調勻', 9),
(42, 3, '再將所有食材倒入調料中用手充分抓勻', 9),
(43, 4, '將抓勻的木耳裝入保鮮盒放冰箱冷藏冰陣,更是美味！', 9),
(44, 1, '菠菜洗淨切段。', 10),
(45, 2, '紅蘿蔔切絲、大蒜拍扁切末。', 10),
(46, 3, '熱鍋後下一大匙油炒軟紅蘿蔔絲。', 10),
(47, 4, '先加入3分之一杯水', 10),
(48, 5, '再加入菠菜菠菜上面撒上調味料及蒜末，不用攪拌。 蓋上蓋子，開大火計時1分鐘。', 10),
(49, 6, '1分鐘後掀開蓋子，把軟化的蔬菜與調味料攪拌均勻。', 10),
(50, 7, '美味的炒菠菜上菜嘍！ ', 10),
(51, 1, '綠豆芽我會將根去掉，整體比較好看，嫌麻煩的人，可以不用。 韭菜切段，圖片中的量是一把，其實偏多，可以用一半的量就可。 蒜頭切片。', 11),
(52, 2, '先炒蒜頭', 11),
(53, 3, '加入綠豆芽和韭菜，翻炒至微透。', 11),
(54, 4, '加入黑胡椒，量不要太少，太少不好吃。', 11),
(55, 5, '加入鹽、鰹魚粉調味就完成。', 11),
(56, 1, '無籽綠葡萄洗乾淨放冷凍庫冰凍。 蘋果去皮切塊。 冰開水。 以上，倒入果汁機打勻，即可食用。', 12),
(57, 1, '春天最茂盛的蔬菜，就是韭菜。', 13),
(58, 2, '新鮮的韭菜，韭菜水餃、韭菜盒、韭菜煎蛋，都好吃。', 13),
(59, 3, '韭菜清洗乾淨，水川燙五分鐘；撈起、擺盤、淋上柴魚醬油。', 13),
(60, 4, '菠菜清洗乾淨，水川燙五分鐘；撈起、擺盤、淋上柴魚醬油、撒上芝麻。', 13),
(61, 1, '小番茄用氣炸鍋180度15分鐘 或是 烤箱170度20分鐘', 14),
(62, 2, '蒜頭炒香，加蘑菇炒至軟 倒入烤好的小番茄 嗆白酒後，拌入九層塔，起鍋', 14),
(63, 1, '備料：半把韭菜洗淨後切約3-4公分，準備好蛋與牛奶、鹽巴份量', 15),
(64, 2, '熱炒鍋：開火熱鍋下油約5g，下韭菜炒出香味', 15),
(65, 3, '混合：將炒好的韭菜放回蛋液盆中，加入牛奶與鹽巴充分攪拌 Tip：牛奶已會讓滑蛋有個奶香甜味，若想要更甜的話，可以再加一點點味霖唷', 15),
(66, 4, '熱炒鍋：開火熱鍋下油約15g，熱鍋時先大火，筷子沾點蛋液測試下鍋時，若有泡泡即可轉中小火並倒入蛋液', 15),
(67, 5, '炒料塑形：小火待下面有一點點凝固時，順時針將底部的蛋液帶向中間，再逆時鐘撥一次，重複約三次後即可起鍋，完成！ Tip: 手法是輕輕的撥到中心，而不是整個翻炒，這樣會變成炒蛋喔', 15),
(68, 6, '擺盤，完成！', 15),
(69, 1, '培根跟高麗菜,韭菜切成易入口的小塊', 16),
(70, 2, '水跟高湯塊放入鍋內等水滾後放入食材', 16),
(71, 3, '依自己喜歡的奶味濃度斟酌牛奶加多加少</br>再灑些許鹽巴與胡椒即完成', 16),
(72, 1, '所有食材放入果汁機，打勻，調入冰塊，即可享用。', 17),
(73, 1, '絞肉和調味料揉捏均勻，加上義大利香料橄欖油，180度烤15分鐘', 18),
(74, 2, '切一塊步驟一烤好的絞肉排，用平底器具搗碎備用', 18),
(75, 3, '馬自瑞拉起司拿出半條，放在餅乾壓製圓鐵環中', 18),
(76, 4, '用水果刀挖洞，切除的部分不要丟棄，等一下要回填洞口', 18),
(77, 5, '填入絞肉九分滿', 18),
(78, 6, '用切除的餘塊回填洞口', 18),
(79, 7, '蛋打散，將圓柱狀馬自瑞拉充分沾上蛋汁', 18),
(80, 8, '杏仁粉與椰子細粉充分混合均勻，將沾滿蛋液的馬自瑞拉起司放在裹粉中，充分裹均勻', 18),
(81, 9, '小鍋（因為不想浪費太多油），倒進椰子油7分滿，大火加熱至油熱約200度', 18),
(82, 10, '將起司球輕輕放進油鍋中，炸15秒，切勿炸太久，起司遇熱會融化，這是常識。這個步驟只是把表皮的裹粉炸成金黃色', 18),
(83, 11, '同場加映酥炸馬自瑞拉起司片。 油用這麼多只做一種食物，太浪費，何況大家應該也很久沒有吃炸馬自瑞拉起司條了，順便一起做。 方法很簡單，把馬自瑞拉起司切片，裹上蛋汁跟裹粉，放進200度油鍋中，5-10秒起鍋。放在瀝油網上瀝除多餘油脂。', 18),
(84, 12, '完成', 18),
(85, 1, '將絞肉放入塑膠袋，稍微捶打至有彈性', 19),
(86, 2, '放入蜂蜜、醬油及調味料拌勻後， 入冰箱醃三個小時以上', 19),
(87, 3, '將杏仁片微微烤過(不樣像我一樣烤太焦XD)', 19),
(88, 4, '醃好的肉拿出來，加一大匙的油和白芝麻混勻，稍微再捶打一下', 19),
(89, 5, '放入杏仁片，小心翼翼的拌勻(杏仁片很容易碎)', 19),
(90, 6, '在烤盤上鋪上防沾的鋁箔紙或烘焙紙，放上絞肉，用手指將之鋪勻，想要多後就舖多厚 (我們這個分量我是做兩大片肉乾歐)', 19),
(91, 7, '轉烤箱，用145度烤到肉變褐色且有點縮水的狀況 (就是變得像肉乾的樣子XD)', 19),
(92, 1, '首先，將蘋果洗淨去核，切小塊。胡蘿蔔同樣要洗淨，削皮，切塊。然後把塊狀的蘋果、胡蘿蔔放入榨汁機中加入豆漿榨汁，汁成立即飲用。', 20),
(93, 1, '花椰菜洗淨切小塊、小番茄對切? 花椰菜滾水燙熟備用?', 21),
(94, 2, '小火熱鍋加油，放入蔥花慢慢炒至金黃色加1.5匙鹽?', 21),
(95, 3, '放入小番茄稍微拌炒幾下，加水煮滾?', 21),
(96, 4, '將麵條煮熟加入剛剛炒好的湯裡，水滾加蛋、蛤仔煮滾，加入燙熟的花椰菜即可', 21),
(97, 1, '這是今天的主角，跟以前看過的傳統茄子還有圓茄長得不一樣，就買來試試看囉', 22),
(98, 2, '茄子洗淨從中間剖開 冷水就下去燙唷', 22),
(99, 3, '等到水滾蓋鍋蓋煮到用筷子夾有痕跡就可以了', 22),
(100, 4, '切小塊備用', 22),
(101, 5, '蒜頭切片爆香', 22),
(102, 6, '蒜頭香氣出來後即可放入九層塔拌炒', 22),
(103, 7, '九層塔葉微軟後導入茄子拌炒一下', 22),
(104, 8, '加入蠔油跟收到，拌炒一下上鍋蓋悶2分鐘', 22),
(105, 9, '上菜囉', 22),
(106, 1, '大白菜洗淨切塊狀，香菇切條狀，大蒜拍開備用', 23),
(107, 2, '取一湯鍋加熱放油，下蒜爆香，接著下香菇和大白菜稍作拌炒', 23),
(108, 3, '倒入高湯和調味料，讓高湯煮滾約三分鐘使酒精蒸發，接著上蓋以小火燉煮約20分鐘', 23),
(109, 4, '時間到後開蓋灑上柴魚片裝飾即可上桌', 23),
(110, 1, '大白菜切大塊，木耳切塊，蕃茄切塊，蔥切末', 24),
(111, 2, '內鍋放入大白菜，木耳，蕃茄，油豆腐及適量的水', 24),
(112, 3, '外鍋放1杯水煮', 24),
(113, 4, '電鍋開關跳起後，適量的調味，灑上 蔥花即可', 24),
(114, 1, '柚子去皮剝肉', 25),
(115, 2, '柳丁2顆去皮剝肉 ( 柳丁去皮和外面的白色膜後, 一片一片分開 , 再用小剪刀把頂端筋脈剪去就可以剝肉 )', 25),
(116, 3, '紅石榴切半後 , 準備一個大碗和一根桿麵棒 ( 把紅石榴用手掌握住, 切面向下 , 用桿麵棒用力敲石榴 , 石榴籽便會掉下到碗中 )', 25),
(117, 4, '另一顆柳丁榨汁 , 淋到沙拉上即是美味的沙拉醬汁', 25),
(118, 1, '材料都切末', 26),
(119, 2, '加一個蛋跟醬料下去攪拌 *我是用手因為要把空氣擠出來', 26),
(120, 3, '先把它捏四個丸子', 26),
(121, 4, '下去煎時邊煎邊把它壓扁', 26),
(122, 5, '大火30秒就轉小火煎個4分鐘 看有咖啡黃就可以翻面', 26),
(123, 1, '銀耳泡入水中至膨脹發軟', 27),
(124, 2, '將銀耳撕成小朵,放入內鍋中,加入洗淨的紅棗與清水, 移入電鍋,外鍋一杯水燉熟,續燜至銀耳釋放出膠質,湯汁濃稠(睡前燉煮,燜一個夜晚口感最好)', 27),
(125, 3, '梨子削皮去芯切塊(或切厚片,用餅乾模型壓出喜歡的造型)', 27),
(126, 4, '將梨子塊與冰糖一起加入湯中,外鍋1/2杯水燉熟就做好了', 27),
(127, 1, '洋蔥橫切塊後，加入燒熱的鍋中爆香炒軟', 28),
(128, 2, '再放入馬鈴薯拌炒 接著放入紫甘藍炒勻', 28),
(129, 3, '加入水或高湯燉煮10～15分.', 28),
(130, 4, '最後在料理機當中打成泥後. 加入鹽 胡椒粉調味', 28),
(131, 5, '上桌前再滴幾滴橄欖油或鮮奶油都可！', 28),
(132, 1, '大火熱鍋，加入油2大匙，爆香大蒜，倒入小豆苗，炒熟加鹽盛盤。', 29),
(133, 2, '爐火不要關，加油1大匙，倒入紫甘藍，炒熟加少許鹽，小心盛在小豆苗中間，完成。', 29),
(134, 1, '1.雞蛋打散，取一半香菇醬油調味。另一半加少許鹽，或不調味皆可。 2.青江菜梗切一公分小菱形塊，葉切大片備用。', 30),
(135, 2, '玉子燒鍋中下一小匙油炒軟炒熟青江菜梗。 沒有玉子燒鍋就用一般平底鍋。', 30),
(136, 3, '在鍋中均勻加入1/2醬油蛋液，以中火煎。', 30),
(137, 4, '煎到蛋液開始凝固就可以慢慢開始捲起，有破沒關係，下一層補起來就好。', 30),
(138, 5, '捲好再倒入剩餘醬油蛋液，份量約可鋪平鍋底即可，略抬起蛋捲讓蛋液也流到蛋捲下方。', 30),
(139, 6, '放上青江菜葉，看到蛋液凝固就慢慢捲起蛋捲把菜葉包進玉子燒裡。', 30),
(140, 7, '重複動作到蛋液用完。 內側是醬油蛋液，外側是原味蛋液顏色較金黃亮麗。', 30),
(141, 8, '取出稍微涼即可用菜刀輕輕鋸切分成五段。', 30),
(142, 9, '若有剩下的青江菜原鍋炒熟放在玉子燒上或盤子邊當作裝飾。', 30),
(143, 1, '甜椒去梗去籽後洗淨瀝乾；洋蔥去皮洗淨；將甜椒和洋蔥都切絲；', 31),
(144, 2, '炒鍋內放入適量的橄欖油，炒香洋蔥；', 31),
(145, 3, '接著放入甜椒絲；', 31),
(146, 4, '加入調味料後拌炒；', 31),
(147, 5, '炒熟後試吃，並用鹽做微調便可起鍋囉～', 31),
(148, 1, '甜椒洗淨,切掉上方蒂頭處,清除內部甜椒子', 32),
(149, 2, '蛋打散', 32),
(150, 3, '加入鹽及昆布高湯拌勻', 32),
(151, 4, '高湯蛋液倒入甜椒', 32),
(152, 5, '置於碗內,放入電鍋,電鍋外1/3米杯水,開關跳起悶5分鐘即可上桌', 32),
(153, 1, '起油鍋，下蕃茄，炒至鍋中有紅汁', 33),
(154, 2, '下洋蔥、紅蘿蔔拌炒', 33),
(155, 3, '加入水', 33),
(156, 4, '煮至紅蘿蔔熟後，加入牛肉，轉小火慢燉20分鐘，最後加入鹽巴攪拌一下即完成囉。', 33),
(157, 5, '蔥花可加可不加。 如要加蔥花，攪拌一下就趕快起鍋囉！', 33),
(158, 1, '馬鈴薯去皮後切絲, (大概像圖中的那?細) 切絲後用乾淨的水洗2-3次, 目的是要把其澱粉洗掉, 吃起來才會有脆脆的感覺', 34),
(159, 2, '下油把香菇絲跟紅蘿蔔絲炒香', 34),
(160, 3, '把泡水的馬鈴薯絲瀝乾下鍋, 然後加1茶匙的鹽巴拌勻後、 蓋鍋約3分鐘 淋點辣油、黑醋(可以依個人口味調整) 我加了1/2茶匙的辣油及2茶匙的黑醋 起鍋前放入香菜拌勻', 34),
(161, 4, '好吃又營養的香辣土豆絲完成? 如果沒有香菜的話,也可以不加 或者,上菜前灑點芝麻也很美唷', 34),
(162, 1, '冬瓜削皮後切塊備用 薑切絲備用 準備一鍋滾水下排骨 等水回滾了將排骨撈起清水洗淨 再準備一鍋冷水 加入冬瓜、薑絲、洗淨排骨 大火蓋上鍋蓋煮15-20分 加入鹽巴調味 即完成', 35),
(163, 1, '食材準備： 1.芹菜切段 2.千張豆腐皮對切 3.蒜頭切末 4鴨肉丸切對半', 36),
(164, 2, '取一鍋熱油後倒入蒜頭爆香，下鴨肉丸炒出香味', 36),
(165, 3, '加入芹菜炒一下後加1/4杯的水', 36),
(166, 4, '加入千張豆皮拌炒一下（有水分比較好炒軟），炒軟後加鹽調味（因豆皮有鹹度，故少量就可）', 36),
(167, 5, '好吃又簡單菜餚上桌囉', 36),
(168, 1, '市售方形酥皮切半（提早10分鐘從冷凍拿出退冰，以免折半時斷裂）', 37),
(169, 2, '湯圓放一端，折一半。', 37),
(170, 3, '邊邊用叉子將2邊壓貼合，刷上蛋黃讓顏色更漂亮（我這次沒有刷蛋黃）。', 37),
(171, 4, '放入氣炸鍋180度15分鐘，10分鐘翻面。', 37),
(172, 1, '1.雞蛋分為蛋白與蛋黃。 2.低粉過篩備用。 3.開始備料的時候就可以開始預熱烤箱，以180度預熱20分鐘以上。(溫度要到才能開始烤，蛋糕糊備好就要立刻開烤，不能等喔！因此一定要先預熱烤箱)', 38),
(173, 2, '蘋果去核削成約0.2cm的薄片，以鹽水浸泡一下。 ＊若想要蘋果片較為柔軟易彎曲，用滾水煮蘋果片到成透明狀，約煮1~2分即可(可以用微波的，微波時間一樣1~2分)。 (今天沒有煮直接用)', 38),
(174, 3, '把胡蘿蔔磨成泥備用，取40-50g備用。', 38),
(175, 4, '把蛋白打發到起粗泡泡，加入1/3的砂糖，約分三次加入砂糖打發蛋白到硬性發泡。', 38),
(176, 5, '硬性發泡時的蛋白霜拉起時會有小尖角。 打發過程中可以稍微停止打發，觀察一下觀察蛋白霜的狀態。 過度打發的蛋白霜，會成棉絮狀(與蛋黃拌勻的時候會消泡)，若打成棉絮狀盡量重新取蛋白重新打發。', 38),
(177, 6, '蛋黃加砂糖拌勻。', 38),
(178, 7, '打發到呈現淡黃色。', 38),
(179, 8, '在蛋黃糊中加入肉桂粉與紅蘿蔔泥拌勻。', 38),
(180, 9, '加入過篩低筋麵粉拌勻。最後加入沙拉油拌勻成胡蘿蔔蛋黃糊。 (也有的食譜是先加沙拉油拌勻最後才加麵粉，可依照個人喜好做)', 38),
(181, 10, '取1/3的蛋白霜與蛋黃糊拌勻。拌勻後再倒回蛋白霜中輕輕翻拌均勻。', 38),
(182, 11, '把蘋果片排放在蛋糕糊中。放進預熱180度的烤箱中烤25-30分鐘。 *烤到25分時，可以竹籤刺入蛋糕中央測試一下，有沾黏到麵糊表示尚未熟成，再延長3~5分鐘烘焙時間。', 38),
(183, 12, '烤好的蛋糕用竹籤插入測試，取出的竹籤沒有沾到麵糊表示蛋糕已熟。 兩個蛋做的蛋糕份量不多，我沒有那麼小的模型，今天使用的是七吋模(不可使用不沾模型，底下不要鋪烘焙紙)，份量大約填到模型1/3左右。', 38),
(184, 13, '出爐的蛋糕從約15cm高度往桌上震一下，散出熱氣。 用架子撐住倒扣放涼。', 38),
(185, 14, '用竹籤或是刮刀在蛋糕周圍劃一圈取出蛋糕。 今天的蛋糕不是很甜，螞蟻人可以自行酌量增加糖量。', 38),
(186, 1, '將全部蔬菜洗淨後,浸泡於冷開水中', 39),
(187, 2, '洋蔥切絲後浸泡於冰水中去辛辣味 玉米整條入鍋煮熟泡冰水冰鎮 海帶芽泡開水等發脹備用', 39),
(188, 3, '蘿美生菜切段鋪底, 甜椒切絲,玉米以片刀整片削下, 黃瓜切斜片,蕃茄切薄片', 39),
(189, 4, '將全部切好的食材一一鋪在蘿美生菜上,可將顏色交錯,增加美觀 再將鱈魚肝鋪上,不要攪碎喔,看起來比較豪氣...呵呵 海帶芽水分擠乾放上去,可灑點芝麻增加美觀', 39),
(190, 5, '再將和風沙拉醬均勻淋在上面即完成', 39),
(191, 1, '蒜兩粒切末。蛋略打散加少許鹽調味。', 40),
(192, 2, '太白粉加柴魚粉、水、鹽調勻備用。', 40),
(193, 3, '熱鍋後加入一大匙油爆香蒜末。', 40),
(194, 4, '加入菠菜翻炒至軟。', 40),
(195, 5, '太白粉水再度攪拌均勻後淋入鍋中，略為拌炒到凝固。', 40),
(196, 6, '在鍋中加入蛋液，略拌炒到半熟。把菠菜糊翻過來蓋在蛋上，確認蛋都凝固即可起鍋。', 40),
(197, 7, '軟嫩的菠菜雞蛋煎，不必出門就能享用的下午鹹點完成了。 太白粉水已調味，無需再加醬就很好吃了！', 40),
(198, 1, '鄰居種植的韭菜，也當庭院裝飾、觀賞。', 41),
(199, 2, '準備食材：韭菜和雞蛋。', 41),
(200, 3, '韭菜沖洗乾淨。', 41),
(201, 4, '韭菜切成細末。', 41),
(202, 5, '蛋打散、加入1茶匙鹽，然後將蛋液倒入韭菜末中。', 41),
(203, 6, '將蛋液與韭菜拌勻。', 41),
(204, 7, '平底鍋加熱、倒入1湯匙蔬菜油，將拌勻的韭菜蛋液倒入鍋。', 41),
(205, 8, '待底面呈現金黃色，翻面再煎另一面。', 41),
(206, 9, '煎至雙面微焦、熟透。', 41),
(207, 10, '香氣四溢，美味佳餚上桌。', 41),
(208, 11, '當季食材，最佳的新鮮蔬食健康便當菜。', 41),
(209, 1, '食材準備好(蘋果我事後又多補一顆) 烤箱預熱200度', 42),
(210, 2, '兩顆蘋果去皮切丁泡水 兩顆蘋果拿來擦成泥滴幾滴檸檬汁避免氧化變黃', 42),
(211, 3, '乾淨鍋子加入無鹽奶油小火融化', 42),
(212, 4, '倒入蘋果及蘋果泥小火拌炒出水', 42),
(213, 5, '小火炒約五分鐘蘋果軟化後加入粉漿勾濃稠狀', 42),
(214, 6, '餡料完成品', 42),
(215, 7, '酥皮室溫解凍後分左右兩邊 右半邊切三個斜刀口 左半邊放蘋果泥 外圍一圈刷上蛋黃液準備封口', 42),
(216, 8, '對折後用叉子在四周輕壓封緊', 42),
(217, 9, '放置烤盤上用剩餘蛋黃液表面刷上 烤箱200度烤約15分鐘', 42),
(218, 10, '烤出來的完成品', 42),
(219, 11, '也可以用吐司去邊?麵棍壓扁代替酥皮 就變成吐司蘋果派囉！', 42),
(220, 1, '把何首烏60克放在藥材包裡加入?、生薑和米酒半瓶、水約六碗，以文火慢燉約30分鐘。', 43),
(221, 2, '雞蛋8顆以文火煮熟，約10分鐘。', 43),
(222, 3, '枸杞三分之一碗清洗備用。', 43),
(223, 4, '紅棗三分之一碗清洗備用。 紅棗也能保護肝，善用紅棗，對身體的助益也很大。', 43),
(224, 5, '雞蛋去殼清洗後放入鍋內。', 43),
(225, 6, '將紅棗、枸杞放入鍋內，再添加一茶匙鹽巴，文火約30分鐘即可。', 43),
(226, 1, '蓮藕洗淨削皮切薄片。', 44),
(227, 2, '將蓮藕入鍋加入100mL水燜煮10分鐘，最後開蓋將水煮乾。', 44),
(228, 3, '加入煮醬材料醬油，水，醋翻炒到水份略收時加入糖，繼續翻炒至糖融化。', 44),
(229, 1, '這次我用無印良品的無咖啡因葡萄博士茶當果凍底，完全就是十足的果香味，而且沒有咖啡因小朋友也能大口吃喔!!!', 45),
(230, 2, '先將吉利丁片泡水軟化備用。', 45),
(231, 3, '將無咖啡因葡萄博士茶加熱並且倒入適量的砂糖溶解即可。(甜度依個人喜好喔!!!) 擰乾吉利丁片加入博士茶內攪拌攪拌~', 45),
(232, 4, '將草莓切塊放入杯子內，倒入剛剛煮好的博士茶放入冰箱冷藏凝固。', 45),
(233, 5, '好簡單的「草莓果凍」輕鬆完成耶~', 45),
(234, 1, '先將水倒在要煮的容器，並且煮開', 46),
(235, 2, '並且放入蓮子', 46),
(236, 3, '約20分鐘後放入紅棗', 46),
(237, 4, '約10分鐘後加入枸杞', 46),
(238, 5, '約10分鐘後加入龍眼乾', 46),
(239, 6, '等龍眼乾膨脹後，先試蓮子是否軟綿，軟綿後就可加入冰糖囉', 46),
(240, 7, '溫暖的桂圓蓮子湯就完成囉', 46),
(241, 1, '糯米 泡4小時 水倒掉 倒入1杯又1/4的水 【電子鍋 設定 糯米】 【一般大同電鍋也可以】', 47),
(242, 2, '再來 準備 備料A：50cc.米酒 +桂圓泡一起 備料B：黃砂糖 1杯 【時間到 已保溫狀態】 把備料 A,B加入 ，伴一伴 完成★ 『可以直接偷吃或炸成甜米糕』', 47),
(243, 3, '拿容器裡面塗薄薄的油，把已完成甜米糕裝入！', 47),
(244, 4, '如果喜歡炸米糕可以 用水、起士酥炸粉+水 切 我們前面做的米糕 下去炸：又是一種不一樣的變化', 47),
(245, 1, '白花椰摘小朵，用淡鹽水浸泡約10分鐘，沖洗乾淨。番茄切小塊。', 48),
(246, 2, '將白花椰放入滾水中略為川燙一下，撈出過冷水瀝乾。', 48),
(247, 3, '鍋內熱油，放入番茄塊炒到快要軟透，再放入川燙過的白花椰一起翻炒，倒入約兩大匙的番茄醬快速炒勻。', 48),
(248, 4, '最後加入適量的鹽、糖、醋調味即成。', 48),
(249, 1, '準備好製作沙拉使用的食材及工具', 49),
(250, 2, '酪梨以酪梨去核切?器（美國品牌OXO）處理，取出果?後切塊備?', 49),
(251, 3, '將?番茄對半切備用', 49),
(252, 4, '將?鈴薯去皮切成塊煮熟備?', 49),
(253, 5, '將雞蛋煮成水煮蛋切片備用', 49),
(254, 6, '將培根切片煎熟備用', 49),
(255, 7, '準備好製作優格沙拉醬使用的食材及工具', 49),
(256, 8, '首先將優格與以1:3比例調配之紅酒醋 (或水果醋) 及冷壓初榨橄欖油，倒入醬汁搖搖量杯（美國品牌OXO）', 49),
(257, 9, '再加入鹽、胡椒以醬汁搖搖量杯（美國品牌OXO）搖至醬汁不分層即可', 49),
(258, 10, '盤子放上食材淋上優格沙拉醬就完成了！', 49),
(259, 1, '先把鵝油、蒜片、辣椒放入碗中微波30秒 （辣椒不吃辣的可省） （再懶一點可以直接放鵝油香蔥微波??）', 50),
(260, 2, '微波完將碗拿出，放入已熟的花椰菜之後，用湯匙拌勻，讓花椰菜都沾到油。再放入微波爐微波2分鐘', 50),
(261, 3, '微波完將碗拿出加1茶匙鹽，拌勻，再放入微波2分鐘', 50),
(262, 4, '微波完之後就完成啦', 50),
(263, 1, '備菜： 1.排骨川燙去血水。 2.玉米切斷，一根4段（依大小根可增減段數）。 3.蔥切白色那段，切數段。 4.紅蘿蔔、白蘿蔔切塊。', 51),
(264, 2, '大火將水滾開，放入步驟1的甜菜根、紅蘿蔔、白蘿蔔，轉中火蓋鍋蓋悶至水滾。', 51),
(265, 3, '加入步驟1的排骨、蔥段，蓋鍋悶至水滾，轉小火悶20分鐘。', 51),
(266, 4, '悶到確認白蘿蔔及紅蘿蔔軟嫩，灑上鹽巴、白胡椒，關火，上桌。', 51),
(267, 1, '苦瓜切薄片，丟到水裡燙2分鐘後取出泡冰水', 52),
(268, 2, '將醬料全部放到鍋裡煮到糖沒有顆粒後，放入苦瓜', 52),
(269, 3, '煮約4-5分鐘即可取出放涼', 52),
(270, 4, '夏天吃很退火喔', 52),
(271, 1, '先把葡萄洗淨瀝乾先對切取籽，然後用果汁機稍微打一下。（切小塊也可以，只不過比較費時間）', 53),
(272, 2, '蘋果削皮、取籽然後用刨刀刨絲，這樣就有果粒了??', 53),
(273, 3, '將步驟1、2倒在一起加砂糖、檸檬汁，因為我用果汁機打了所以就有水，如果葡萄是切丁的話需要停留時間待出水', 53),
(274, 4, '瓦斯中小火要邊攪拌不然會焦喔！ 上層的泡沫撈起，一直煮到濃稠約30分 趁燙的時候裝入玻璃罐倒放待涼再放入冰箱。', 53),
(275, 1, '把花椰菜都洗乾淨後切成適當大小，與 3 湯匙橄欖油、1/2 茶匙的鹽和些許黑胡椒拌勻', 54),
(276, 2, '花椰菜與堅果平舖在烤盤上，置於在烤箱靠近頂層的地方，以上下火攝氏 200 度烤 15 - 20 分鐘，直到花椰菜變稍脆，部分變成金黃色，移出置放至冷卻', 54),
(277, 3, '最後將剩下的果乾、肉桂粉、芹菜、蜂蜜、油醋、橄欖油拌入沙拉內，即可品嘗！', 54),
(278, 1, '冷凍的熟白蝦解凍後，放進鍋子用燒開的熱水略燙十幾秒，放涼後去殼。 如用生白蝦，可水煮或蒸熟後，放冰水冰鎮，然後再剝殼去腸子。 蓮霧洗淨。', 55),
(279, 2, '蝦子切1.5cm段。蓮霧去芯切1.5-2cm丁。切好放冰箱備用。', 55),
(280, 3, '把沙拉醬料混合。', 55),
(281, 4, '將醬料與蝦子及蓮霧拌均勻便完成。', 55),
(282, 1, '鳳梨削皮後，取出鳳梨心用果汁機打成泥', 56),
(283, 2, '鳳梨肉切成小丁，大小盡量一致，馬告拍碎', 56),
(284, 3, '將果肉丁、鳳梨泥與砂糖一起拌勻，加入檸檬汁', 56),
(285, 4, '小火煮至個人喜愛的濃稠度，關火後加入馬告即可', 56),
(286, 1, '將食材全部倒入果汁機打20秒', 57),
(287, 2, '就完成囉! ', 57),
(288, 1, '所有食材入攪拌機，打勻即可享用。', 58),
(289, 1, '冰箱煮好的綠豆湯拿出備用（我老公竟然把紅豆湯跟綠豆湯混在一起了...今天我才發現...暈倒...但不影響製作所以繼續做下去??）', 59),
(290, 2, '6包吉利丁粉放旁邊備用', 59),
(291, 3, '把綠豆湯的湯分出來（大約1100毫升），用一點綠豆清湯加入30克砂糖，煮至砂糖溶解後倒入綠豆清湯中，並加入吉利丁粉煮至粉末溶解（不可以煮滾，避免破壞吉利丁粉凝固），煮的過程中會有很多泡泡，可以將泡泡撈起來，待粉末溶解後放涼備用', 59),
(292, 4, '綠豆湯裡的料撈起備用', 59),
(293, 5, '將綠豆料平均分置容器中', 59),
(294, 6, '將放涼的綠豆清湯平均分裝至容器中，放涼一些後放入冰箱冰至少3小時，就可以食用囉！', 59),
(295, 1, '綠豆、薏仁洗淨後放入火紋鍋中，加入水及適量冰糖。', 60),
(296, 2, '選擇豆類行程。', 60),
(297, 1, '把西芹上的根撕走，切段並清洗乾淨。 在西芹上鋪滿花生醬。', 61),
(298, 2, '隨心而放上棉花糖、葡萄乾或巧克力等', 61),
(299, 1, '◇高麗菜，刈菜，雞腿切塊 ◇薑切片 ◇蔥切段', 62),
(300, 2, '◇加入些許麻油 ◇開小火把薑褊5至10分鐘', 62),
(301, 3, '◇飄出薑味放入雞肉 ◇炒至外表變色', 62),
(302, 4, '◇加入3罐料理米酒', 62),
(303, 5, '◇煮滾後加入川燙過的刈仁和1/4的高麗菜 ◇蓋鍋蓋煮沸', 62),
(304, 6, '◇加入剩下的1/4高麗菜', 62),
(305, 7, '◇煮沸後蓋鍋蓋小火悶30分鐘', 62),
(306, 8, '◇加入剩下的食材 ◇開大火煮沸即可', 62),
(307, 1, '蒜頭辣椒240度2分鐘爆香 加入蝦子跟啤酒240度15分鐘 完成', 63),
(308, 1, '先蒸熟南瓜，鹹蛋蛋白蛋黃分開', 64),
(309, 2, '南瓜擺一旁，熱鍋後先下鹹蛋黃，後加入米酒去腥，起泡後加入南瓜，炒勻後加入蒜末、蔥末，大炒後即可。', 64),
(310, 3, '依個人口味可以加入蠔油或醬油調味一下！', 64),
(311, 1, '鍋內放入水、冬瓜茶塊、洋菜一起煮滾至溶化 (可依喜好甜度增減水量)', 65),
(312, 2, '倒入玻璃保鮮盒放涼，加蓋放入冰箱冷藏', 65),
(313, 3, '依每次的量切小塊享用，可直接當茶凍吃，也可放入飲料或冰品中增添口感', 65),
(314, 1, '熱油鍋以小火爆香蒜頭和鹹蛋黃，蛋黃炒至發泡', 66),
(315, 2, '加入切薄片的苦瓜翻炒，確認苦瓜都有附著到鹹蛋黃', 66),
(316, 3, '加入蛋白及味霖翻炒，加入一大匙水，蓋上鍋蓋悶至苦瓜變軟 起鍋前試味道，若覺得太鹹可以加點砂糖調味', 66),
(317, 4, '鹹蛋苦瓜就完成囉', 66),
(318, 1, '雞肉退冰 加入鹽巴、蒜頭切丁、辣椒粉或辣椒 調味料依個人口味適量添加 兩面均勻塗抹後蓋上蓋子或保鮮膜 醃製15分鐘 背面抹油 180度 10分鐘 正面200度 8分鐘', 67),
(319, 2, '完成灑點胡椒粉 上桌', 67),
(320, 1, '備料。', 68),
(321, 2, '香菇泡水後切小丁備用、切蒜末。', 68),
(322, 3, '冷鍋下五花肉丁炒至出油。', 68),
(323, 4, '下蒜末炒香。', 68),
(324, 5, '下香菇炒香。', 68),
(325, 6, '下紅蔥酥炒香。', 68),
(326, 7, '下少許胡椒粉、五香粉(可省略)炒香。', 68),
(327, 8, '加4大匙醬油拌炒一下。', 68),
(328, 9, '加1大匙糖拌炒一下。', 68),
(329, 10, '加入300cc的水，小火熬煮約20分鐘至湯汁濃稠即可。', 68),
(330, 11, '也可以順便蒸個蛋來滷。', 68),
(331, 12, '完成囉。', 68),
(332, 13, '呈盤。', 68),
(333, 14, '上桌。', 68),
(334, 15, '另外也可以用五花肉切小丁來做滷肉飯，詳另一篇食譜。 ※用五花肉切小丁的口感比較好，但時間需要滷久一點，如果想要速成，就用絞肉。', 68),
(335, 16, '同場加映：煮乾麵。用一般在全聯買的麵條來煮。', 68),
(336, 17, '順便加熱一下沒吃完的肉燥。', 68),
(337, 18, '順便?燙大陸妹。', 68),
(338, 19, '起鍋，依序放上麵條、大陸妹、肉燥後，再淋一點醬油、一些鹽巴、胡椒粉，就完成了。', 68),
(339, 20, '開動前拌一拌，香噴噴的肉燥搭配滑嫩的麵條加上青脆的大陸妹，真的好好吃啊。', 68);

-- --------------------------------------------------------

--
-- 資料表結構 `score`
--

CREATE TABLE `score` (
  `ID` int(11) NOT NULL,
  `account` varchar(50) NOT NULL COMMENT '使用者帳號',
  `fid` int(5) NOT NULL COMMENT '料理編號',
  `recipe` text NOT NULL,
  `foodscore` int(32) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `score`
--

INSERT INTO `score` (`ID`, `account`, `fid`, `recipe`, `foodscore`) VALUES
(142, 'root', 69, '家常義大利肉醬（快速版）', 3),
(143, 'root', 333, '仰望星空派', 4),
(144, 'root', 534, '日式食蔬咖哩飯', 4),
(145, 'root', 84, '千層麵連義大利人都說好吃', 4),
(146, 'root', 85, '氣炸雞腿排', 5),
(147, 'root', 254, '芒果椰汁西米糕', 5),
(148, 'root', 253, '泰式檸檬豬', 4),
(149, 'root', 287, '韓式糖醋肉', 2),
(150, 'root', 344, '韃靼牛肉', 5),
(151, 'root', 254, '芒果椰汁西米糕', 5),
(152, 'root', 253, '泰式檸檬豬', 5),
(153, 'root', 140, '蒜香蜂蜜烤蕃茄＿簡單義式開胃菜', 4);

-- --------------------------------------------------------

--
-- 資料表結構 `sick`
--

CREATE TABLE `sick` (
  `ID` varchar(1) NOT NULL,
  `Name` varchar(10) DEFAULT NULL,
  `Noteat` varchar(500) DEFAULT NULL,
  `description` varchar(500) NOT NULL COMMENT '描述',
  `description2` varchar(500) NOT NULL,
  `source` varchar(200) NOT NULL,
  `img` varchar(50) NOT NULL,
  `sname` varchar(50) NOT NULL,
  `howtopre` varchar(500) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `sick`
--

INSERT INTO `sick` (`ID`, `Name`, `Noteat`, `description`, `description2`, `source`, `img`, `sname`, `howtopre`) VALUES
('1', '心臟疾病', '雞蛋、腦、內臟、魚子、糖、熱狗、香腸、肉乾、肉鬆、奶油、動物性鮮奶油、鮮奶油、牛肉、豬肉、羊肉、培根、白麵粉、飯、米飯、白米飯、白米', '心臟病是常見疾病，也是重要的死因。心臟病常常是突發性、陣發性、沒有明顯誘因或預警。心臟病最可怕是突然心臟病發猝死。很多心臟病在靜態或休息狀態下亳無症狀，但活動或刺激後才發心臟病，所以一般健康檢查並不容易查出心臟病，故此心臟病需心臟科醫師檢查治療。', '', 'https://www.jah.org.tw/form/index-1.asp?m=3&m1=8&m2=362&gp=361&id=139', 'hea', '仁愛醫療財團法人-認識心臟病', '<p>(1)	低鹽飲食、低熱量飲食、低脂肪飲食、多吃蔬菜水果、限制水分。</p>                     <p>(2)	適當運動、控制體重、均衡飲食健康生活方式、睡眠均衡，不過日夜顛倒夜生活，早睡早起。</p>                     <p>(3)	定期健康檢查、心臟病復健計劃、按時服藥，配合檢查，遵從醫囑。</p>                     <p>(4)	不抽菸、不酗酒。</p>                     <p>(5)	控制高血壓、控制糖尿病、控制感染、控制其他系統疾病。</p>                     <p>(6)	避免刺激性食物如咖啡、濃茶等。</p>                     <p>(7)	保持生活愉快，避免過勞及情緒緊張，保持快樂心態，人際關係，平衡心理。</p>                     <p>(8)	保持大小便暢通。</p>                     <p>(9)	安寧環境、保持適當溫度、冬季保暖。</p>                     <p>('),
('2', '肺炎', '洋蔥、大蔥、辣椒、薑、南薑、花椒、酒、白酒、紅酒、米酒、高梁酒、料酒、紅葡萄酒、白葡萄酒、葡萄酒、啤酒、清酒、蘭姆酒、香草精、咖啡、龍眼、桂皮', '係指肺部實質受到細菌或病毒感染的一種急性感染過程。可發生在所有年齡層。特別是免疫機能較差者，如老人、酗酒者或糖尿病患者。', '', 'https://www.kln.mohw.gov.tw/?aid=509&pid=81&page_n', 'pue', '衛教資訊 | 便民衛教 | 衛生福利部基隆醫院', '<p>（一） 在感冒流行時或身體抵抗力較弱時，勿到公共場所及避免和                     感冒的人接觸。</p>                     　 <p>（二） 要有良好的營養狀況和充足的睡眠，及適度的運動、以增加                     抵抗力。</p>                     　 <p>（三） 適時添加衣服避免受寒。</p>                     　 <p>（四） 認識感染的徵象：如痰量增加、變黃、變黏稠、發燒、咳嗽、呼吸困難加劇、或意識混亂嗜睡，若有以上情形，應立即看醫師。</p>'),
('3', '糖尿病', '果漿、蜜餞、糕、蓮藕、蜂蜜、馬鈴薯、栗子、粉條、內臟、油、酒、白酒、紅酒、米酒、啤酒、高梁酒、料酒、蘭姆酒、白葡萄酒、紅葡萄酒、葡萄酒、清酒、香草精、豬皮、雞皮、鴨皮、魚皮、肥肉、棕櫚油、椰子油、豬油、煎油、牛油、奶油、動物性鮮奶油、鮮奶油、香腸、貢丸、蝦餃、燕餃、魚餃、花生、瓜子、腰果、核桃、蟹黃、蛋黃、雞蛋、鴨蛋、鳥蛋、鵪鶉蛋、砂糖、白砂糖、黃砂糖、紅砂糖、糖粉、糖、糖漿、冰糖、黑糖、三温糖、棉花糖、羅漢果糖、果糖、含糖煉乳、煉乳、Oreo巧克力夾心餅乾', '糖尿病是一種漸進式的慢性疾病，若沒有好好控制或接受治療則可能引發\n如眼睛、心血管、腎臟、神經系統等併發症。', '', 'https://wwwv.tsgh.ndmctsgh.edu.tw/files/web/192/fi', 'dia', '三軍總醫院 - Tri-Service General Hospital', '<p>（一）控制良好血糖、血脂和血壓。並每年至少接受一次眼科的基本檢查， 包括：視力檢查、眼底視網膜檢查、眼壓測量。</p> <p>（二）注意足部護理，經常檢查足部，選擇合適鞋襪，預防足部受傷。因末 梢神經病變且下肢血液循環較差，尤其夜間、冬天、下雨/濕氣重時， 更應加強防護。</p> <p>（三）早期偵測『尿液微量白蛋白』，早期診斷腎臟病變，早期治療。</p> <p>（四）定期至合格醫療院所檢查治療，按時服藥，切勿自行採用草藥偏方。</p>'),
('4', '慢性呼吸道疾病', '地瓜、芋頭、馬鈴薯、花生、紅白薯、南瓜、栗子、土豆、糯米、玉米、饅頭、麵包、花椰菜、韭菜、白蘿蔔、高麗菜、洋蔥、蘋果、西瓜、豆漿、豆腐、豆乾、豆皮、豆花', '慢性呼吸道疾病(氣喘)是指受到過敏原或刺激物刺激後，支氣管產生慢性發炎的情形，依其嚴重的程度可以呈現呼吸困難、喘鳴音、胸悶和咳嗽等症狀，嚴重影響個人生活品質，是民眾重要的健康問題之一。雖然大部分的氣喘目前無法治癒，但是可以藉由良好的控制來減少或預防氣喘發作。', '', 'https://www.hpa.gov.tw/Pages/List.aspx?nodeid=215', 'low', '衛生福利部國民健康署', '<p>1. 保持清潔，遠離過敏原；</p> <p>2. 規律運動，不要太激烈；</p> <p>3. 戒菸及遠離二手菸、三手菸；</p> <p>4. 勤練腹式呼吸；</p> <p>5. 多喝水、勤拍痰；</p> <p>6. 常洗手、外出一定戴口罩；</p> <p>7. 避免到人多的地方及密閉環境；</p> <p>8. 飲食要均衡；</p>'),
('5', '高血壓性疾病', '雞湯、糖、巧克力、酒、辣椒、茶、豬心、豬肝、大腸、小腸、雞心、雞胗、內臟、砂糖、白砂糖、黃砂糖、紅砂糖、糖粉、糖、糖漿、冰糖、黑糖、三温糖、', '高血壓是一種常見的疾病，假始您患有高血壓，可能覺得沒有什麼不舒服，但是它卻是引發腦血管破裂(腦中風)的主因，也是引起冠狀動脈心臟病的危險因子之一，高血壓雖不能被根治，但是卻可以被妥善控制住。所以有關高血壓的認知，預防及注意事項，是生為現代人的我們必需具備的常識。', '', 'https://www.jah.org.tw/form/index-1.asp?m=3&m1=8&m2=362&gp=361&sid=20&id=129', 'hyp', '仁愛醫療財團法人-認識高血壓', ' <p>1.	定期檢查血壓及按時服用藥物，不可任意增減劑量</p> <p>2.	戒煙</p> <p>3.	避免攝取高膽固醇和脂肪性食物，避免用豬油炒菜，多吃蔬菜水果</p> <p>4.	避免過量飲酒</p> <p>5.	少吃鹽。飲食應清淡，避免食用罐頭、醬瓜、滷味等醃製品</p> <p>6.	控制體重</p> <p>7.	規律的運動</p> <p>8.	避免過度的緊張壓力，保持心情愉快</p> <p>9.	保持大便通暢，預防便秘，以防用力排便導致血管收縮使血壓上升</p> <p>10.	洗澡水不要太冷或太熱</p> <p>11.	充份休息睡眠</p>'),
('6', '腎臟病', '鹹菜、鹹蛋、蛋黃、鴨蛋、鹹鴨蛋、鵝蛋、醃肉、火腿、香腸、豆醬、醬油、昆布醬油、柴魚醬油、薄鹽醬油、鰹魚醬油、鹽巴、鹽、海鹽、楊桃、烏醋、白醋、醋、味精、味噌、沙茶醬、辣椒醬、豆瓣醬、蕃茄醬、蕃茄肉醬、番茄醬、鮮乳、牛奶、鮮奶、乳酪、優格、酸奶、優酪乳、發酵乳、蠶豆、紅豆、黑豆、綠豆、杏仁果、開心果、腰果、核桃、花生、南瓜子、南瓜、瓜子、芝麻、蓮子、薏仁、糙米、奇異果、太陽瓜、草莓、哈密瓜、香蕉、滷汁', '腎臟病之所以可怕就是在於此病在早期沒有明顯症狀，眾所周知的水腫雖是腎臟病常見的症狀之一，但當一個腎臟病人出現水腫時，通常疾病本身已經進行了一段時期。另外腎臟病人可能出現一些如食慾不振、倦怠失眠、頭暈目眩等症狀，由於這些症狀並不是腎臟病人特有的症狀，因此也不易診斷，所以「早期診斷及早治療」在腎臟病人身上並不容易。\\n\\n事實上要早期診斷腎臟病最重要的是尿液檢查，這是最簡單、方便、經濟且有效的方法來發現腎臟病，可以檢出病人有血尿或尿蛋白的現象，至於抽血檢查血液中代表腎功能的肌酸及尿素氮濃度是否升高等，雖然也可以知道腎臟有毛病，但血液檢查不如尿液檢查來的敏感。', '', 'http://www.kmuh.org.tw/www/kmcj/data/9010/4804.htm', 'kid', '高醫醫訊月刊第二十一卷第五期', '腎臟病之所以可怕就是在於此病在早期沒有明顯症狀，眾所周知的水腫雖是腎臟病常見的症狀之一，但當一個腎臟病人出現水腫時，通常疾病本身已經進行了一段時期。另外腎臟病人可能出現一些如食慾不振、倦怠失眠、頭暈目眩等症狀，由於這些症狀並不是腎臟病人特有的症狀，因此也不易診斷，所以「早期診斷及早治療」在腎臟病人身上並不容易。  事實上要早期診斷腎臟病最重要的是尿液檢查，這是最簡單、方便、經濟且有效的方法來發現腎臟病，可以檢出病人有血尿或尿蛋白的現象，至於抽血檢查血液中代表腎功能的肌酸及尿素氮濃度是否升高等，雖然也可以知道腎臟有毛病，但血液檢查不如尿液檢查來的敏感。'),
('7', '肝病', '炸雞、炸魚、炸豬排、培根、臘肉、豬排、豆辦醬、豆腐乳、豆鼓、臭豆腐、酒、白酒、紅酒、米酒、高梁酒、料酒、蘭姆酒、清酒、白葡萄酒、紅葡萄酒、葡萄酒、啤酒、竹筍、芹菜、芭樂、番茄、小番茄、大番茄、牛番茄、蕃茄、小蕃茄、大蕃茄、牛蕃茄、紅豆、綠豆、蠶豆，腰果、核桃、花生、瓜子、味精、蒜鹽、花椒鹽、豆瓣醬、沙茶醬、辣醬油、醬油、蠔油、蝦油、甜麵醬、番茄醬、蕃茄醬、蕃茄肉醬、味噌、芥茉醬、烏醋、檸檬醋、奶油、瑪琪琳、沙拉醬、蛋黃醬、榨菜、酸菜、泡菜、鹹菜、梅干菜、雪裡紅、筍干、冷凍蔬菜，豌豆莢、青豆仁、玉米罐頭', '指肝細胞遭受外來的(病毒、酒、藥物)破壞而造 成壞死現象。一般常用 GOT/GPT 的數字來判斷肝臟是否有發炎。', '', 'http://www.stm.org.tw/health/doc/doc_10.pdf', 'liv', '天主教聖馬爾定醫院', '<p>1.認識自己是那一型肝病。</p> <p>2.避免輸血、共用針筒針炙、紋眉、刺青、共用 毛巾及刮鬍刀等…。</p> <p>3.不要抽菸及喝酒。</p> <p>4.不要亂服偏方草藥。</p> <p>5.不要吃生食。</p> <p>6.不要熬夜且適當運動及休息。</p> <p>7.不要吃加工、發霉、過期的食物。</p> <p>8.少吃刺激性食物(油炸類、辛辣類、濃茶..等)。</p> <p>9.少吃油膩食物。</p> <p>10.少吃花生製品、豆瓣醬、豆腐乳、臭豆腐等， (因此類型的食物易產生黃麴毒素增加肝臟負 擔)。</p> <p>11.適量高蛋白質(因此類型的食物易產生植物性蛋白質，如大豆製品) 及蔬菜水果。 </p>');

-- --------------------------------------------------------

--
-- 資料表結構 `testacc`
--

CREATE TABLE `testacc` (
  `ID` int(11) NOT NULL DEFAULT 1,
  `account01` varchar(11) NOT NULL,
  `password01` varchar(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `testacc`
--

INSERT INTO `testacc` (`ID`, `account01`, `password01`) VALUES
(1, 'root', '123');

-- --------------------------------------------------------

--
-- 資料表結構 `type`
--

CREATE TABLE `type` (
  `id` int(11) NOT NULL COMMENT '流水號',
  `fid` int(11) NOT NULL COMMENT '分類編號',
  `name` varchar(50) NOT NULL COMMENT '名稱',
  `tag` varchar(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `type`
--

INSERT INTO `type` (`id`, `fid`, `name`, `tag`) VALUES
(1, 1, '義式料理', 'it'),
(2, 2, '美式料理', 'us'),
(3, 3, '泰式料理', 'th'),
(4, 4, '日式料理', 'jp'),
(5, 5, '韓式料理', 'ko'),
(6, 6, '台式料理', 'tw'),
(7, 7, '港式料理', 'hk'),
(8, 8, '四川料理', '4c'),
(9, 9, '中式料理', 'cn'),
(10, 10, '法式料理', 'fr'),
(11, 11, '英式料理', 'en'),
(12, 12, 'ALL', 'al');

-- --------------------------------------------------------

--
-- 資料表結構 `t_menu`
--

CREATE TABLE `t_menu` (
  `id` int(11) NOT NULL,
  `mid` varchar(60) NOT NULL COMMENT '編號',
  `name` varchar(60) NOT NULL COMMENT '名稱',
  `url` varchar(60) NOT NULL COMMENT '路徑'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `t_menu`
--

INSERT INTO `t_menu` (`id`, `mid`, `name`, `url`) VALUES
(1, '1', '首頁', 'index.php'),
(2, '2', '食譜總覽', 'allrec.php'),
(3, '3', '慢性病照護', 'sick.php'),
(4, '4', '餐點訂購', 'Service_Deal_A_Llama.php'),
(5, '5', '食材管理', 'material.php'),
(6, '6', '食材辨識', 'f_fscan.php'),
(7, '7&Pages=1', '食譜推薦', 'rec.php'),
(8, '8&Fclass=ALL', '<i class=\"far fa-hat-chef\"></i>主廚一覽', 'allchef.php');

-- --------------------------------------------------------

--
-- 資料表結構 `user_order`
--

CREATE TABLE `user_order` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `chef_id` int(5) NOT NULL,
  `data` varchar(1000) NOT NULL,
  `quantity` int(3) NOT NULL DEFAULT 1 COMMENT '數量',
  `order_id` varchar(200) NOT NULL,
  `recipe_score` int(1) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `user_order`
--

INSERT INTO `user_order` (`id`, `user_id`, `chef_id`, `data`, `quantity`, `order_id`, `recipe_score`) VALUES
(25, 3, 37, '149', 2, '0', NULL),
(26, 3, 37, '150', 2, '0', NULL),
(30, 3, 37, '148', 2, 'd2021080800001', NULL),
(31, 3, 37, '149', 1, 'd2021080800001', NULL),
(32, 3, 37, '153', 2, 'd2021080800001', NULL),
(33, 3, 40, '178', 2, 'd2021080800002', NULL),
(34, 3, 40, '182', 3, 'd2021080800002', NULL),
(35, 3, 40, '183', 1, 'd2021080800002', NULL),
(36, 3, 37, '148', 1, 'd2021080800003', NULL),
(37, 3, 37, '149', 3, 'd2021080800003', NULL),
(38, 3, 37, '157', 2, 'd2021080800003', NULL),
(39, 3, 37, '148', 1, 'd2021080800004', NULL),
(40, 3, 37, '149', 1, 'd2021080800004', NULL),
(41, 3, 36, '138', 1, 'd2021080900001', NULL),
(42, 3, 36, '140', 1, 'd2021080900001', NULL),
(43, 3, 30, '83', 1, 'd2021080900002', NULL),
(44, 3, 30, '84', 2, 'd2021080900002', NULL),
(45, 3, 30, '84', 1, 'd2021081000001', NULL),
(46, 3, 30, '85', 2, 'd2021081000001', NULL),
(47, 3, 36, '139', 1, 'd2021081000002', NULL),
(48, 3, 36, '140', 2, 'd2021081000002', NULL),
(49, 3, 39, '168', 1, 'd2021081000004', NULL),
(50, 3, 39, '169', 1, 'd2021081000004', NULL),
(51, 3, 39, '172', 2, 'd2021081600001', NULL),
(52, 3, 39, '173', 3, 'd2021081600001', NULL),
(53, 3, 36, '138', 2, 'd2021083100001', NULL),
(54, 3, 36, '141', 1, 'd2021083100001', NULL),
(55, 3, 36, '145', 1, 'd2021083100001', NULL),
(56, 3, 36, '147', 1, 'd2021083100001', NULL),
(57, 3, 36, 'check_ID', 139, 'o2021090700001', NULL),
(58, 3, 36, 'check_ID', 140, 'o2021090700001', NULL),
(59, 3, 36, 'check_ID', 139, 'o2021090700002', NULL),
(60, 3, 36, 'check_ID', 140, 'o2021090700002', NULL),
(61, 3, 38, 'check_ID', 139, 'o2021090700003', NULL),
(62, 3, 38, 'check_ID', 140, 'o2021090700003', NULL),
(63, 3, 36, '139', 5, 'o2021090700004', NULL),
(64, 3, 36, '140', 4, 'o2021090700004', NULL),
(65, 3, 36, '139', 2, 'd2021090700005', NULL),
(66, 3, 36, '140', 4, 'd2021090700005', NULL),
(67, 3, 36, '142', 1, 'd2021090700005', NULL),
(68, 3, 37, '139', 3, 'o2021090700006', NULL),
(69, 3, 37, 'Row_Total_hdn', 1050, 'o2021090700006', NULL),
(70, 3, 37, '141', 2, 'o2021090700006', NULL),
(71, 3, 37, 'Row_Total_hdn', 240, 'o2021090700006', NULL),
(72, 3, 37, '150', 4, 'o2021090700006', NULL),
(73, 3, 37, 'Row_Total_hdn', 320, 'o2021090700006', NULL),
(74, 3, 37, '140', 4, 'o2021090700007', NULL),
(75, 3, 37, 'Row_Total_hdn', 520, 'o2021090700007', NULL),
(76, 3, 37, '145', 2, 'o2021090700007', NULL),
(77, 3, 37, 'Row_Total_hdn', 250, 'o2021090700007', NULL),
(78, 3, 36, '139', 3, 'o2021090700008', NULL),
(79, 3, 36, 'Row_Total_hdn', 1050, 'o2021090700008', NULL),
(80, 3, 36, '140', 2, 'o2021090700008', NULL),
(81, 3, 36, 'Row_Total_hdn', 260, 'o2021090700008', NULL),
(82, 3, 37, '148', 1, 'd2021091400001', NULL),
(83, 3, 37, '149', 3, 'd2021091400001', NULL),
(84, 3, 37, '149', 4, 'o2021091400002', NULL),
(85, 3, 37, 'Row_Total_hdn', 520, 'o2021091400002', NULL),
(86, 3, 36, '138', 2, 'd2021091400003', NULL),
(87, 3, 36, '139', 2, 'd2021091400003', NULL),
(88, 3, 37, '138', 2, 'o2021091400004', NULL),
(89, 3, 37, 'Row_Total_hdn', 260, 'o2021091400004', NULL),
(90, 3, 37, '147', 2, 'o2021091400004', NULL),
(91, 3, 37, 'Row_Total_hdn', 240, 'o2021091400004', NULL),
(92, 3, 37, '138', 1, 'o2021100500001', NULL),
(93, 3, 37, 'Row_Total_hdn', 130, 'o2021100500001', NULL),
(94, 3, 37, '139', 1, 'o2021100500001', NULL),
(95, 3, 37, 'Row_Total_hdn', 350, 'o2021100500001', NULL),
(96, 3, 37, '155', 1, 'o2021100500001', NULL),
(97, 3, 37, 'Row_Total_hdn', 600, 'o2021100500001', NULL),
(98, 3, 37, '140', 1, 'o2021100500001', NULL),
(99, 3, 37, 'Row_Total_hdn', 130, 'o2021100500001', NULL),
(100, 3, 37, '157', 1, 'o2021100500001', NULL),
(101, 3, 37, 'Row_Total_hdn', 600, 'o2021100500001', NULL);

-- --------------------------------------------------------

--
-- 資料表結構 `user_order_group`
--

CREATE TABLE `user_order_group` (
  `ID` varchar(14) NOT NULL,
  `cust_id` int(200) NOT NULL,
  `chef_id` int(5) NOT NULL,
  `type` int(1) NOT NULL COMMENT '1外送;0到府',
  `status` int(1) NOT NULL DEFAULT 0 COMMENT '0 for prepareing 1 for delivering 2 for done',
  `date` date NOT NULL,
  `score` int(1) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `user_order_group`
--

INSERT INTO `user_order_group` (`ID`, `cust_id`, `chef_id`, `type`, `status`, `date`, `score`) VALUES
('d2021080800001', 3, 37, 1, 2, '2021-08-02', 5),
('d2021080800002', 3, 37, 1, 2, '2021-08-03', 4),
('d2021080800003', 3, 40, 1, 0, '2021-08-03', NULL),
('d2021080800004', 3, 37, 1, 1, '2021-08-03', NULL),
('d2021080900001', 3, 36, 1, 2, '2021-08-09', 3),
('d2021080900002', 3, 30, 1, 0, '2021-08-09', NULL),
('d2021081000001', 3, 30, 1, 0, '2021-08-10', NULL),
('d2021081000002', 3, 36, 1, 2, '2021-08-10', 3),
('d2021081000004', 3, 39, 1, 2, '2021-08-10', 2),
('d2021081600001', 3, 39, 1, 0, '2021-08-16', NULL),
('d2021083100001', 3, 36, 1, 2, '2021-08-31', 4),
('d2021090700005', 3, 36, 1, 0, '2021-09-07', NULL),
('d2021091400001', 3, 37, 1, 0, '2021-09-14', NULL),
('d2021091400003', 3, 36, 1, 2, '2021-09-14', NULL),
('o2021090700001', 3, 36, 0, 0, '2021-09-07', NULL),
('o2021090700002', 3, 36, 0, 0, '2021-09-07', NULL),
('o2021090700003', 3, 38, 0, 0, '2021-09-07', NULL),
('o2021090700004', 3, 36, 0, 0, '2021-09-07', NULL),
('o2021090700006', 3, 37, 0, 0, '2021-09-07', NULL),
('o2021090700007', 3, 37, 0, 0, '2021-09-07', NULL),
('o2021090700008', 3, 36, 0, 2, '2021-09-07', 4),
('o2021091400002', 3, 37, 0, 0, '2021-09-14', NULL),
('o2021091400004', 3, 37, 0, 0, '2021-09-14', NULL),
('o2021100500001', 3, 37, 0, 0, '2021-10-05', NULL);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`ID`);

--
-- 資料表索引 `allrec`
--
ALTER TABLE `allrec`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `type` (`type`),
  ADD KEY `type_2` (`type`);

--
-- 資料表索引 `chef_account`
--
ALTER TABLE `chef_account`
  ADD PRIMARY KEY (`ID`);

--
-- 資料表索引 `chef_recipe`
--
ALTER TABLE `chef_recipe`
  ADD PRIMARY KEY (`cr_ID`),
  ADD KEY `cr_chef` (`cr_chef`);

--
-- 資料表索引 `chef_recipe_ingredient`
--
ALTER TABLE `chef_recipe_ingredient`
  ADD PRIMARY KEY (`cri_ID`),
  ADD KEY `cri_recipe` (`cri_recipe`);

--
-- 資料表索引 `chef_recipe_price`
--
ALTER TABLE `chef_recipe_price`
  ADD PRIMARY KEY (`crp_ID`);

--
-- 資料表索引 `chef_recipe_score`
--
ALTER TABLE `chef_recipe_score`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `chef_score`
--
ALTER TABLE `chef_score`
  ADD PRIMARY KEY (`score_ID`);

--
-- 資料表索引 `chef_skill`
--
ALTER TABLE `chef_skill`
  ADD PRIMARY KEY (`skill_id`),
  ADD KEY `skill_id` (`skill_id`),
  ADD KEY `chef_ID` (`chef_ID`);

--
-- 資料表索引 `family_account`
--
ALTER TABLE `family_account`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `Username` (`Username`);

--
-- 資料表索引 `keep`
--
ALTER TABLE `keep`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user` (`user`),
  ADD KEY `recipe` (`recipe`);

--
-- 資料表索引 `material`
--
ALTER TABLE `material`
  ADD PRIMARY KEY (`ID`);

--
-- 資料表索引 `oldallrec`
--
ALTER TABLE `oldallrec`
  ADD PRIMARY KEY (`ID`);

--
-- 資料表索引 `personal_account`
--
ALTER TABLE `personal_account`
  ADD PRIMARY KEY (`ID`),
  ADD KEY `Owner` (`Owner`);

--
-- 資料表索引 `rec_step`
--
ALTER TABLE `rec_step`
  ADD PRIMARY KEY (`ID`);

--
-- 資料表索引 `score`
--
ALTER TABLE `score`
  ADD PRIMARY KEY (`ID`);

--
-- 資料表索引 `sick`
--
ALTER TABLE `sick`
  ADD PRIMARY KEY (`ID`);

--
-- 資料表索引 `testacc`
--
ALTER TABLE `testacc`
  ADD KEY `ID` (`ID`);

--
-- 資料表索引 `type`
--
ALTER TABLE `type`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fid` (`fid`),
  ADD KEY `fid_2` (`fid`),
  ADD KEY `fid_3` (`fid`);

--
-- 資料表索引 `t_menu`
--
ALTER TABLE `t_menu`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `user_order`
--
ALTER TABLE `user_order`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `user_order_group`
--
ALTER TABLE `user_order_group`
  ADD PRIMARY KEY (`ID`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `admin`
--
ALTER TABLE `admin`
  MODIFY `ID` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `chef_account`
--
ALTER TABLE `chef_account`
  MODIFY `ID` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=67;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `chef_recipe`
--
ALTER TABLE `chef_recipe`
  MODIFY `cr_ID` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=212;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `chef_recipe_ingredient`
--
ALTER TABLE `chef_recipe_ingredient`
  MODIFY `cri_ID` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3396;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `chef_recipe_price`
--
ALTER TABLE `chef_recipe_price`
  MODIFY `crp_ID` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `chef_recipe_score`
--
ALTER TABLE `chef_recipe_score`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `chef_score`
--
ALTER TABLE `chef_score`
  MODIFY `score_ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ID', AUTO_INCREMENT=12;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `chef_skill`
--
ALTER TABLE `chef_skill`
  MODIFY `skill_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=162;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `family_account`
--
ALTER TABLE `family_account`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=39;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `keep`
--
ALTER TABLE `keep`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '0流水號', AUTO_INCREMENT=65;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `material`
--
ALTER TABLE `material`
  MODIFY `ID` int(64) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=198;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `oldallrec`
--
ALTER TABLE `oldallrec`
  MODIFY `ID` int(32) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=72;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `personal_account`
--
ALTER TABLE `personal_account`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=90;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `rec_step`
--
ALTER TABLE `rec_step`
  MODIFY `ID` int(64) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=340;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `score`
--
ALTER TABLE `score`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=154;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `type`
--
ALTER TABLE `type`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=13;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `t_menu`
--
ALTER TABLE `t_menu`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `user_order`
--
ALTER TABLE `user_order`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=102;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `chef_recipe`
--
ALTER TABLE `chef_recipe`
  ADD CONSTRAINT `chef_recipe_ibfk_1` FOREIGN KEY (`cr_chef`) REFERENCES `chef_account` (`ID`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- 資料表的限制式 `chef_recipe_ingredient`
--
ALTER TABLE `chef_recipe_ingredient`
  ADD CONSTRAINT `chef_recipe_ingredient_ibfk_1` FOREIGN KEY (`cri_recipe`) REFERENCES `chef_recipe` (`cr_ID`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- 資料表的限制式 `chef_skill`
--
ALTER TABLE `chef_skill`
  ADD CONSTRAINT `chef_skill_ibfk_1` FOREIGN KEY (`chef_ID`) REFERENCES `chef_account` (`ID`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- 資料表的限制式 `keep`
--
ALTER TABLE `keep`
  ADD CONSTRAINT `keep_ibfk_1` FOREIGN KEY (`recipe`) REFERENCES `allrec` (`ID`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `keep_ibfk_2` FOREIGN KEY (`user`) REFERENCES `family_account` (`ID`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- 資料表的限制式 `personal_account`
--
ALTER TABLE `personal_account`
  ADD CONSTRAINT `personal_account_ibfk_1` FOREIGN KEY (`Owner`) REFERENCES `family_account` (`ID`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
